// BlueprintGeneratedClass BP_CoreHacking_Preview.BP_CoreHacking_Preview_C
// Size: 0x480 (Inherited: 0x260)
struct ABP_CoreHacking_Preview_C : AWTLCoreHackingPreviewRoom {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UFMODAudioComponent* FMODAudio_SwitchClick; // 0x268(0x08)
	struct UFMODAudioComponent* FMODAudio_HackingFailed; // 0x270(0x08)
	struct UFMODAudioComponent* FMODAudio_HackingSuccess; // 0x278(0x08)
	struct UFMODAudioComponent* FMODAudio_TestButton; // 0x280(0x08)
	struct UFMODAudioComponent* FMODAudio; // 0x288(0x08)
	struct URectLightComponent* RectLight1; // 0x290(0x08)
	struct URectLightComponent* RectLight; // 0x298(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard4; // 0x2a0(0x08)
	struct UPointLightComponent* LoadingLight; // 0x2a8(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard3; // 0x2b0(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard2; // 0x2b8(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard1; // 0x2c0(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard; // 0x2c8(0x08)
	struct USpotLightComponent* SpotLight1; // 0x2d0(0x08)
	struct UBoxComponent* TestButton; // 0x2d8(0x08)
	struct UPointLightComponent* ind3; // 0x2e0(0x08)
	struct UPointLightComponent* ind2; // 0x2e8(0x08)
	struct UPointLightComponent* ind1; // 0x2f0(0x08)
	struct UPointLightComponent* ind0; // 0x2f8(0x08)
	struct UBoxComponent* sw7; // 0x300(0x08)
	struct UBoxComponent* sw6; // 0x308(0x08)
	struct UBoxComponent* sw5; // 0x310(0x08)
	struct UBoxComponent* sw4; // 0x318(0x08)
	struct UBoxComponent* sw3; // 0x320(0x08)
	struct UBoxComponent* sw2; // 0x328(0x08)
	struct UBoxComponent* sw1; // 0x330(0x08)
	struct UBoxComponent* sw0; // 0x338(0x08)
	struct UStaticMeshComponent* Background; // 0x340(0x08)
	struct USpotLightComponent* SpotLight; // 0x348(0x08)
	float Timeline_0_Curve_CoreButtonTranslation_C668EB1544AB9842D75264812265F574; // 0x350(0x04)
	float Timeline_0_TranslationY_C668EB1544AB9842D75264812265F574; // 0x354(0x04)
	enum class ETimelineDirection Timeline_0__Direction_C668EB1544AB9842D75264812265F574; // 0x358(0x01)
	char pad_359[0x7]; // 0x359(0x07)
	struct UTimelineComponent* Timeline_1; // 0x360(0x08)
	float sw7tr_Curve_CoreSwitchTranslation_EAAE8C1C40281C5CC70CF4820F230342; // 0x368(0x04)
	float sw7tr_Curve_CoreSwitchTranslation_EAAE8C1C40281C5CC70CF4820F230342; // 0x36c(0x04)
	enum class ETimelineDirection sw7tr__Direction_EAAE8C1C40281C5CC70CF4820F230342; // 0x370(0x01)
	char pad_371[0x7]; // 0x371(0x07)
	struct UTimelineComponent* sw7tr; // 0x378(0x08)
	float sw6tr_Curve_CoreSwitchTranslation_4EB1CB09494907A4AC726FB5C55B899F; // 0x380(0x04)
	float sw6tr_Curve_CoreSwitchTranslation_4EB1CB09494907A4AC726FB5C55B899F; // 0x384(0x04)
	enum class ETimelineDirection sw6tr__Direction_4EB1CB09494907A4AC726FB5C55B899F; // 0x388(0x01)
	char pad_389[0x7]; // 0x389(0x07)
	struct UTimelineComponent* sw6tr; // 0x390(0x08)
	float sw5tr_Curve_CoreSwitchTranslation_0E2218754CA846D8B10138AC2645A548; // 0x398(0x04)
	float sw5tr_Curve_CoreSwitchTranslation_0E2218754CA846D8B10138AC2645A548; // 0x39c(0x04)
	enum class ETimelineDirection sw5tr__Direction_0E2218754CA846D8B10138AC2645A548; // 0x3a0(0x01)
	char pad_3A1[0x7]; // 0x3a1(0x07)
	struct UTimelineComponent* sw5tr; // 0x3a8(0x08)
	float sw4tr_Curve_CoreSwitchTranslation_4F340FD0402150B6A9E9FBBBBA8CF923; // 0x3b0(0x04)
	float sw4tr_Curve_CoreSwitchTranslation_4F340FD0402150B6A9E9FBBBBA8CF923; // 0x3b4(0x04)
	enum class ETimelineDirection sw4tr__Direction_4F340FD0402150B6A9E9FBBBBA8CF923; // 0x3b8(0x01)
	char pad_3B9[0x7]; // 0x3b9(0x07)
	struct UTimelineComponent* sw4tr; // 0x3c0(0x08)
	float sw3tr_Curve_CoreSwitchTranslation_52F98C124196BA0D5DE6BB85795D6602; // 0x3c8(0x04)
	float sw3tr_Curve_CoreSwitchTranslation_52F98C124196BA0D5DE6BB85795D6602; // 0x3cc(0x04)
	enum class ETimelineDirection sw3tr__Direction_52F98C124196BA0D5DE6BB85795D6602; // 0x3d0(0x01)
	char pad_3D1[0x7]; // 0x3d1(0x07)
	struct UTimelineComponent* sw3tr; // 0x3d8(0x08)
	float sw2tr_Curve_CoreSwitchTranslation_A4CE5C724DC11C224C95579074D9BC5C; // 0x3e0(0x04)
	float sw2tr_Curve_CoreSwitchTranslation_A4CE5C724DC11C224C95579074D9BC5C; // 0x3e4(0x04)
	enum class ETimelineDirection sw2tr__Direction_A4CE5C724DC11C224C95579074D9BC5C; // 0x3e8(0x01)
	char pad_3E9[0x7]; // 0x3e9(0x07)
	struct UTimelineComponent* sw2tr; // 0x3f0(0x08)
	float sw1tr_Curve_CoreSwitchTranslation_8018DC6E4E42582DF787E988DEDB13CB; // 0x3f8(0x04)
	float sw1tr_Curve_CoreSwitchTranslation_8018DC6E4E42582DF787E988DEDB13CB; // 0x3fc(0x04)
	enum class ETimelineDirection sw1tr__Direction_8018DC6E4E42582DF787E988DEDB13CB; // 0x400(0x01)
	char pad_401[0x7]; // 0x401(0x07)
	struct UTimelineComponent* sw1tr; // 0x408(0x08)
	float sw0tr_Curve_CoreSwitchTranslation_94689E774CF0F72A04CADBB1CBF6A43B; // 0x410(0x04)
	float sw0tr_Curve_CoreSwitchTranslation_94689E774CF0F72A04CADBB1CBF6A43B; // 0x414(0x04)
	enum class ETimelineDirection sw0tr__Direction_94689E774CF0F72A04CADBB1CBF6A43B; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct UTimelineComponent* sw0tr; // 0x420(0x08)
	float ButtonTranslation_Curve_CoreButtonTranslation_584DFB9E49C845818747908326F6C37B; // 0x428(0x04)
	float ButtonTranslation_TranslationY_584DFB9E49C845818747908326F6C37B; // 0x42c(0x04)
	enum class ETimelineDirection ButtonTranslation__Direction_584DFB9E49C845818747908326F6C37B; // 0x430(0x01)
	char pad_431[0x7]; // 0x431(0x07)
	struct UTimelineComponent* ButtonTranslation; // 0x438(0x08)
	float TranslationS0; // 0x440(0x04)
	float TranslationS1; // 0x444(0x04)
	float TranslationS2; // 0x448(0x04)
	float TranslationS3; // 0x44c(0x04)
	float TranslationS4; // 0x450(0x04)
	float TranslationS5; // 0x454(0x04)
	float TranslationS6; // 0x458(0x04)
	float TranslationS7; // 0x45c(0x04)
	bool bShowLoading; // 0x460(0x01)
	char pad_461[0x3]; // 0x461(0x03)
	float LoadingTimer; // 0x464(0x04)
	float RandDelay; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct UMaterialInstanceDynamic* LedMaterialInstance; // 0x470(0x08)
	bool CanProcess; // 0x478(0x01)
	char pad_479[0x3]; // 0x479(0x03)
	float TimeUntilNextIdleBlink; // 0x47c(0x04)

	void IdleIdication(float DeltaTime); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.IdleIdication // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ad0090
	void Show Loading Process(bool Value); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.Show Loading Process // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ad0090
	void SetInficatorColor(struct FLinearColor NewColor); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.SetInficatorColor // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ad0090
	void GetLoadingLedState(bool& Value); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.GetLoadingLedState // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1ad0090
	void HIghlightLoadingLed(bool Value); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.HIghlightLoadingLed // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ad0090
	void UserConstructionScript(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.UserConstructionScript // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ad0090
	void ButtonTranslation__FinishedFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.ButtonTranslation__FinishedFunc // (BlueprintEvent) // @ game+0x1ad0090
	void ButtonTranslation__UpdateFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.ButtonTranslation__UpdateFunc // (BlueprintEvent) // @ game+0x1ad0090
	void Timeline_0__FinishedFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.Timeline_0__FinishedFunc // (BlueprintEvent) // @ game+0x1ad0090
	void Timeline_0__UpdateFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.Timeline_0__UpdateFunc // (BlueprintEvent) // @ game+0x1ad0090
	void sw7tr__FinishedFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.sw7tr__FinishedFunc // (BlueprintEvent) // @ game+0x1ad0090
	void sw7tr__UpdateFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.sw7tr__UpdateFunc // (BlueprintEvent) // @ game+0x1ad0090
	void sw6tr__FinishedFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.sw6tr__FinishedFunc // (BlueprintEvent) // @ game+0x1ad0090
	void sw6tr__UpdateFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.sw6tr__UpdateFunc // (BlueprintEvent) // @ game+0x1ad0090
	void sw5tr__FinishedFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.sw5tr__FinishedFunc // (BlueprintEvent) // @ game+0x1ad0090
	void sw5tr__UpdateFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.sw5tr__UpdateFunc // (BlueprintEvent) // @ game+0x1ad0090
	void sw4tr__FinishedFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.sw4tr__FinishedFunc // (BlueprintEvent) // @ game+0x1ad0090
	void sw4tr__UpdateFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.sw4tr__UpdateFunc // (BlueprintEvent) // @ game+0x1ad0090
	void sw3tr__FinishedFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.sw3tr__FinishedFunc // (BlueprintEvent) // @ game+0x1ad0090
	void sw3tr__UpdateFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.sw3tr__UpdateFunc // (BlueprintEvent) // @ game+0x1ad0090
	void sw2tr__FinishedFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.sw2tr__FinishedFunc // (BlueprintEvent) // @ game+0x1ad0090
	void sw2tr__UpdateFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.sw2tr__UpdateFunc // (BlueprintEvent) // @ game+0x1ad0090
	void sw1tr__FinishedFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.sw1tr__FinishedFunc // (BlueprintEvent) // @ game+0x1ad0090
	void sw1tr__UpdateFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.sw1tr__UpdateFunc // (BlueprintEvent) // @ game+0x1ad0090
	void sw0tr__FinishedFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.sw0tr__FinishedFunc // (BlueprintEvent) // @ game+0x1ad0090
	void sw0tr__UpdateFunc(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.sw0tr__UpdateFunc // (BlueprintEvent) // @ game+0x1ad0090
	void K2_UpdateSwitchState(char Index, bool Value); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.K2_UpdateSwitchState // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void K2_HighlightIndicator(char Index, bool Value); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.K2_HighlightIndicator // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void LoadingIndicatorProcess(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.LoadingIndicatorProcess // (BlueprintCallable|BlueprintEvent) // @ game+0x1ad0090
	void ReceiveBeginPlay(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x1ad0090
	void K2_HightlightStateIndicator(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.K2_HightlightStateIndicator // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void ReceiveTick(float DeltaSeconds); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.ReceiveTick // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void K2_IsSuccess(bool Value); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.K2_IsSuccess // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void K2_OnComponentPressed(struct UPrimitiveComponent* HitComponent); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.K2_OnComponentPressed // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void K2_OnTestButtonPressed(); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.K2_OnTestButtonPressed // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void ExecuteUbergraph_BP_CoreHacking_Preview(int32_t EntryPoint); // Function BP_CoreHacking_Preview.BP_CoreHacking_Preview_C.ExecuteUbergraph_BP_CoreHacking_Preview // (Final|UbergraphFunction) // @ game+0x1ad0090
};

