// AnimBlueprintGeneratedClass AB_Male_TPC_Anim.AB_Male_TPC_Anim_C
// Size: 0x12038 (Inherited: 0xfa0)
struct UAB_Male_TPC_Anim_C : UWTLCharacterBodyAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xfa0(0x08)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0xfa8(0x80)
	struct FAnimNode_Slot AnimGraphNode_Slot_14; // 0x1028(0x48)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_10; // 0x1070(0x190)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x1200(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x12a0(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7; // 0x1320(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57; // 0x13e8(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_8; // 0x1410(0xd0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x14e0(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56; // 0x1560(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55; // 0x1588(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6; // 0x15b0(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54; // 0x1678(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53; // 0x16a0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52; // 0x16c8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51; // 0x16f0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x1718(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x1798(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_19; // 0x1838(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_18; // 0x1920(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_17; // 0x1a08(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16; // 0x1af0(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_23; // 0x1bd8(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x1c98(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0x1d18(0xe8)
	struct FAnimNode_Slot AnimGraphNode_Slot_13; // 0x1e00(0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0x1e48(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_22; // 0x1f30(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x1ff0(0x80)
	struct FAnimNode_Slot AnimGraphNode_Slot_12; // 0x2070(0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x20b8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x21a0(0xe8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_23; // 0x2288(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_22; // 0x23e0(0x158)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x2538(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50; // 0x25e8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x2610(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x26b0(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x2798(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x2848(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x28f8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21; // 0x29a8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49; // 0x2b00(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_11; // 0x2b28(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_10; // 0x2b70(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x2bb8(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x2c58(0xe8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8; // 0x2d40(0xc8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_80; // 0x2e08(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_79; // 0x2f10(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_15; // 0x3018(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_15; // 0x3038(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_78; // 0x3058(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x3160(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x31e0(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_77; // 0x3280(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_76; // 0x3388(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20; // 0x3490(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48; // 0x35e8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47; // 0x3610(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x3638(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x3720(0xa0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_3; // 0x37c0(0xf0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_14; // 0x38b0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_14; // 0x38d0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_13; // 0x38f0(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x3910(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x3990(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_21; // 0x3a78(0xc0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_75; // 0x3b38(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_74; // 0x3c40(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_73; // 0x3d48(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_72; // 0x3e50(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_71; // 0x3f58(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_70; // 0x4060(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_69; // 0x4168(0x108)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_9; // 0x4270(0x190)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_20; // 0x4400(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x44c0(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x4540(0xe8)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_7; // 0x4628(0xd0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x46f8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46; // 0x4798(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0x47c0(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_9; // 0x4888(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x48d0(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_19; // 0x4918(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45; // 0x49d8(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_8; // 0x4a00(0x190)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_4; // 0x4b90(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_3; // 0x4c80(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier_2; // 0x4d70(0xf0)
	struct FAnimNode_RotationMultiplier AnimGraphNode_RotationMultiplier; // 0x4e60(0xf0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_68; // 0x4f50(0x108)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_18; // 0x5058(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_17; // 0x5118(0xc0)
	char pad_51D8[0x8]; // 0x51d8(0x08)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik_2; // 0x51e0(0x190)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x5370(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7; // 0x53f0(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44; // 0x54b8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0x54e0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0x5638(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0x5660(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0x5728(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x5750(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_16; // 0x57d0(0xc0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_7; // 0x5890(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_6; // 0x5a20(0x190)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_6; // 0x5bb0(0xd0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0x5c80(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x5ca8(0x80)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_5; // 0x5d28(0xd0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0x5df8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x5e20(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0x5ea0(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_5; // 0x5ec8(0x190)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x6058(0x48)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0x60a0(0x190)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_15; // 0x6230(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0x62f0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0x6448(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0x6470(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_14; // 0x6498(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x6558(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0x65a0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0x66f8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0x6720(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_67; // 0x6748(0x108)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik; // 0x6850(0x190)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_66; // 0x69e0(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x6ae8(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x6b68(0xc8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_65; // 0x6c30(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_64; // 0x6d38(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_63; // 0x6e40(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_62; // 0x6f48(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_61; // 0x7050(0x108)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x7158(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13; // 0x71a0(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0x7260(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0x73b8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0x73e0(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_60; // 0x7408(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_59; // 0x7510(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_58; // 0x7618(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_57; // 0x7720(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_12; // 0x7828(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_13; // 0x7848(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_56; // 0x7868(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_11; // 0x7970(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_12; // 0x7990(0x20)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12; // 0x79b0(0xc0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_55; // 0x7a70(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_54; // 0x7b78(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0x7c80(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_53; // 0x7ca8(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0x7db0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0x7f08(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0x7f30(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x7f58(0xc0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_11; // 0x8018(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_10; // 0x8038(0x20)
	char pad_8058[0x8]; // 0x8058(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_12; // 0x8060(0x1e0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x8240(0xc0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_10; // 0x8300(0x20)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_11; // 0x8320(0x1e0)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_10; // 0x8500(0x1e0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_52; // 0x86e0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_51; // 0x87e8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_50; // 0x88f0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_49; // 0x89f8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_48; // 0x8b00(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_47; // 0x8c08(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_46; // 0x8d10(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_45; // 0x8e18(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_44; // 0x8f20(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_43; // 0x9028(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_42; // 0x9130(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_41; // 0x9238(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_40; // 0x9340(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_39; // 0x9448(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_38; // 0x9550(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_37; // 0x9658(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_36; // 0x9760(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_35; // 0x9868(0x108)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x9970(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x9a30(0x80)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_34; // 0x9ab0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_33; // 0x9bb8(0x108)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_2; // 0x9cc0(0xf0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_32; // 0x9db0(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9; // 0x9eb8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_31; // 0x9ed8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9; // 0x9fe0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_30; // 0xa000(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_29; // 0xa108(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_28; // 0xa210(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_27; // 0xa318(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_26; // 0xa420(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0xa528(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0xa680(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0xa6a8(0x158)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0xa800(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0xa8c8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0xa8f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0xa918(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0xa940(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0xa9c0(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_25; // 0xa9e8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_24; // 0xaaf0(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0xabf8(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8; // 0xac20(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8; // 0xac40(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0xac60(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0xadb8(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0xaf10(0x158)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0xb068(0x80)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7; // 0xb0e8(0x20)
	char pad_B108[0x8]; // 0xb108(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_9; // 0xb110(0x1e0)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_8; // 0xb2f0(0x1e0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_23; // 0xb4d0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7; // 0xb5d8(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0xb5f8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0xb750(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0xb778(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0xb7a0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0xb7c0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0xb7e0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0xb800(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0xb820(0x158)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0xb978(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0xba40(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0xbae0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0xbb08(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0xbb88(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_22; // 0xbc28(0x108)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0xbd30(0xf0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_21; // 0xbe20(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_20; // 0xbf28(0x108)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0xc030(0x190)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0xc1c0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0xc280(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_19; // 0xc2a8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_18; // 0xc3b0(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0xc4b8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0xc558(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0xc5d8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0xc658(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0xc6f8(0x158)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0xc850(0x190)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0xc9e0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0xca80(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0xcb00(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0xcbe8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0xcc88(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0xcd28(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0xcda8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0xce28(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0xcec8(0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0xcf10(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0xcfd8(0x80)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0xd058(0x190)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0xd1e8(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0xd2d0(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0xd350(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0xd418(0x80)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_17; // 0xd498(0x108)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_7; // 0xd5a0(0x1e0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0xd780(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0xd7a0(0x20)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_6; // 0xd7c0(0x1e0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_16; // 0xd9a0(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0xdaa8(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xdc00(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0xdd58(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0xdd80(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0xdda8(0x28)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_5; // 0xddd0(0x1e0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xdfb0(0xc8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_15; // 0xe078(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0xe180(0x28)
	char pad_E1A8[0x8]; // 0xe1a8(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_4; // 0xe1b0(0x1e0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14; // 0xe390(0x108)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0xe498(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0xe558(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0xe580(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13; // 0xe5a8(0x108)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0xe6b0(0xc0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0xe770(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xe790(0x158)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0xe8e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0xe910(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0xe938(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0xe960(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0xe988(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0xe9b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xe9d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xea00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0xea28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xea50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xea78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xeaa0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xeac8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xeaf0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xeb18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xeb40(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0xeb68(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0xebe8(0x30)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_4; // 0xec18(0xd0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xece8(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0xed68(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0xed90(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0xedc0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0xee40(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0xee70(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0xeef0(0x30)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3; // 0xef20(0xd0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xeff0(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0xf070(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0xf098(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xf0c8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0xf148(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xf178(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0xf1f8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0xf228(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0xf250(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xf280(0xb0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0xf330(0xc8)
	char pad_F3F8[0x8]; // 0xf3f8(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_3; // 0xf400(0x1e0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0xf5e0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0xf6a0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0xf6c8(0x28)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0xf6f0(0x1e0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0xf8d0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0xf970(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0xf998(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0xfa58(0xc0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0xfb18(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0xfb38(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0xfc40(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0xfce0(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0xfde8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xfe10(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xff68(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0xff90(0xc0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x10050(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x10158(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x10260(0x108)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x10368(0xe8)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x10450(0x1e0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x10630(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x10738(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x10758(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x10778(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x10880(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x10988(0x20)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0x109a8(0xd0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x10a78(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x10b60(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x10c48(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x10ce8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x10df0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x10ef8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x11000(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x11108(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x11130(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x11178(0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x11198(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x11280(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x11320(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x113e0(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x11428(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x11580(0x158)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x116d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x11700(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x11728(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x11750(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x11778(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x117a0(0xd0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x11870(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x11898(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x11918(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x11948(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x11a10(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x11a38(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x11ab8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x11ae8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x11b68(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x11b98(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x11bc0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x11bf0(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x11ca0(0x48)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x11ce8(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x11db0(0x28)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x11dd8(0x30)
	float RotationSpeedHorizontalWithDirectionMultiplier; // 0x11e08(0x04)
	struct FRotator RootBoneRotation; // 0x11e0c(0x0c)
	float RotationSpeedHorizontalWithDirectionCurrent; // 0x11e18(0x04)
	float FootOffset_R; // 0x11e1c(0x04)
	float FootOffset_L; // 0x11e20(0x04)
	float PelvisZOffset; // 0x11e24(0x04)
	struct FRotator FootRotation_R; // 0x11e28(0x0c)
	struct FRotator FootRotation_L; // 0x11e34(0x0c)
	float FootRotation_R_Alpha; // 0x11e40(0x04)
	float FootRotation_L_Alpha; // 0x11e44(0x04)
	float PelvisZOffsetTarget; // 0x11e48(0x04)
	float FootOffset_R_Target; // 0x11e4c(0x04)
	float FootOffset_L_Target; // 0x11e50(0x04)
	bool IsPKM; // 0x11e54(0x01)
	char pad_11E55[0x3]; // 0x11e55(0x03)
	struct FVector PKM_RotationPoint; // 0x11e58(0x0c)
	struct FVector PKM_Offset; // 0x11e64(0x0c)
	struct FVector PKM_CameraAimOffsetVector; // 0x11e70(0x0c)
	struct FVector PKM_CameraAimOffsetVectorInverse; // 0x11e7c(0x0c)
	float IK_LeftHand_Alpha; // 0x11e88(0x04)
	float IK_RightHand_Alpha; // 0x11e8c(0x04)
	float EmptyHandsCurveValue; // 0x11e90(0x04)
	struct FRotator AimOffsetHeadRotation; // 0x11e94(0x0c)
	float PickupAlpha; // 0x11ea0(0x04)
	char pad_11EA4[0xc]; // 0x11ea4(0x0c)
	struct FTransform PickupFABRICEffectorTransform; // 0x11eb0(0x30)
	float MixEmptyHands; // 0x11ee0(0x04)
	float MinCameraOffset; // 0x11ee4(0x04)
	float WeaponAimOffset; // 0x11ee8(0x04)
	float Rest; // 0x11eec(0x04)
	float OneMinusRest; // 0x11ef0(0x04)
	float ActionSlotAlpha; // 0x11ef4(0x04)
	struct FVector BackpackTranslation; // 0x11ef8(0x0c)
	float IK_Foot_Alpha; // 0x11f04(0x04)
	float PDA_Alpha; // 0x11f08(0x04)
	float HandsAimOffsetUpAlpha; // 0x11f0c(0x04)
	struct FVector HandsAimOffsetUpTranslationOffset; // 0x11f10(0x0c)
	float IsRunAlpha; // 0x11f1c(0x04)
	float SexAlpha; // 0x11f20(0x04)
	struct FVector FemaleGrenadeDownOffset; // 0x11f24(0x0c)
	struct FVector FemaleGrenadeMiddleDwnffset; // 0x11f30(0x0c)
	float MyDeltaTime; // 0x11f3c(0x04)
	float IKHand_L; // 0x11f40(0x04)
	bool IsServer; // 0x11f44(0x01)
	char pad_11F45[0x3]; // 0x11f45(0x03)
	struct ABP_Devourer_Projectile_C* Spike; // 0x11f48(0x08)
	float MinSpeedToSwitchSwimmigStates; // 0x11f50(0x04)
	float SwimmingAlpha; // 0x11f54(0x04)
	bool InVehicle; // 0x11f58(0x01)
	char pad_11F59[0x3]; // 0x11f59(0x03)
	float WheelAngle_1; // 0x11f5c(0x04)
	struct FVector Vector_FootOffset_R; // 0x11f60(0x0c)
	struct FVector Vector_FootOffset_L_1; // 0x11f6c(0x0c)
	struct FVector Vector_PelvisZOffset; // 0x11f78(0x0c)
	struct FRotator Rotator_BodyUnderWater; // 0x11f84(0x0c)
	float Alpha_RHCenter; // 0x11f90(0x04)
	float Alpha_RHDown; // 0x11f94(0x04)
	float Alpha_RHUp; // 0x11f98(0x04)
	float Alpha_LHCenter; // 0x11f9c(0x04)
	float Alpha_LHDown; // 0x11fa0(0x04)
	float Alpha_LHUp; // 0x11fa4(0x04)
	float alpha_upperarm_l; // 0x11fa8(0x04)
	float alpha_lowerarm_l; // 0x11fac(0x04)
	float alpha_lowerarm_l2; // 0x11fb0(0x04)
	float alpha_AimOffsetBoneRotation; // 0x11fb4(0x04)
	float alpha_AimOffsetBoneRotation_Velosity; // 0x11fb8(0x04)
	float KnifeOnRunAttack_L; // 0x11fbc(0x04)
	float KnifeOnRunAttack_R; // 0x11fc0(0x04)
	float KnifeOnRunAttack; // 0x11fc4(0x04)
	float Inspect; // 0x11fc8(0x04)
	bool Debug_Crouch; // 0x11fcc(0x01)
	char pad_11FCD[0x3]; // 0x11fcd(0x03)
	struct FRotator RotInVehicle; // 0x11fd0(0x0c)
	bool bIsInVehicle; // 0x11fdc(0x01)
	char pad_11FDD[0x3]; // 0x11fdd(0x03)
	struct FVector CurrentHandsOffsetWithMonocular; // 0x11fe0(0x0c)
	float MSRAlpha; // 0x11fec(0x04)
	float MSRDesiredAlpha; // 0x11ff0(0x04)
	char pad_11FF4[0x4]; // 0x11ff4(0x04)
	struct TArray<int32_t> BadWeponIDList; // 0x11ff8(0x10)
	bool bUseMortar; // 0x12008(0x01)
	char pad_12009[0x3]; // 0x12009(0x03)
	struct FVector MortarLeftHandTarget; // 0x1200c(0x0c)
	struct FVector MortarRightHandTarget; // 0x12018(0x0c)
	float MortarInclineAlphaInterp; // 0x12024(0x04)
	bool bFishing; // 0x12028(0x01)
	char pad_12029[0x3]; // 0x12029(0x03)
	float TiltWithRod; // 0x1202c(0x04)
	float Test_IKHand_L; // 0x12030(0x04)
	float Test_IKHand_R; // 0x12034(0x04)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function AB_Male_TPC_Anim.AB_Male_TPC_Anim_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ad0090
	void DotP(struct FVector v1, struct FVector v2, float Intencity, float& DotP); // Function AB_Male_TPC_Anim.AB_Male_TPC_Anim_C.DotP // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ad0090
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Male_TPC_Anim_AnimGraphNode_TransitionResult_06B9A58B4BE07324DA461B9D8F1E9DA9(); // Function AB_Male_TPC_Anim.AB_Male_TPC_Anim_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Male_TPC_Anim_AnimGraphNode_TransitionResult_06B9A58B4BE07324DA461B9D8F1E9DA9 // (BlueprintEvent) // @ game+0x1ad0090
