#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x4 (0x4 - 0x0)
// Function BI_CanBeTakeDamage.BI_CanBeTakeDamage_C.DecrementHealth
struct IBI_CanBeTakeDamage_C_DecrementHealth_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function BI_CanBeTakeDamage.BI_CanBeTakeDamage_C.IncrementHealth
struct IBI_CanBeTakeDamage_C_IncrementHealth_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function BI_CanBeTakeDamage.BI_CanBeTakeDamage_C.GetName
struct IBI_CanBeTakeDamage_C_GetName_Params
{
public:
	class FText                                  Result;                                            // 0x0(0x18)(Parm, OutParm)
};

// 0x4 (0x4 - 0x0)
// Function BI_CanBeTakeDamage.BI_CanBeTakeDamage_C.GetHealthAlpha
struct IBI_CanBeTakeDamage_C_GetHealthAlpha_Params
{
public:
	float                                        Result;                                            // 0x0(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function BI_CanBeTakeDamage.BI_CanBeTakeDamage_C.CanBeTakeDamage
struct IBI_CanBeTakeDamage_C_CanBeTakeDamage_Params
{
public:
	bool                                         Result;                                            // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function BI_CanBeTakeDamage.BI_CanBeTakeDamage_C.IsAlive
struct IBI_CanBeTakeDamage_C_IsAlive_Params
{
public:
	bool                                         Result;                                            // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function BI_CanBeTakeDamage.BI_CanBeTakeDamage_C.GetMaxHealth
struct IBI_CanBeTakeDamage_C_GetMaxHealth_Params
{
public:
	float                                        Result;                                            // 0x0(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function BI_CanBeTakeDamage.BI_CanBeTakeDamage_C.GetCurrentHealth
struct IBI_CanBeTakeDamage_C_GetCurrentHealth_Params
{
public:
	float                                        Result;                                            // 0x0(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


