#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x100 (0x500 - 0x400)
// BlueprintGeneratedClass BP_MonsterSpawnerBase.BP_MonsterSpawnerBase_C
class ABP_MonsterSpawnerBase_C : public AWTLMonsterSpawner
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x400(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                       Arrow;                                             // 0x408(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                   billboard;                                         // 0x410(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x418(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AWTLMonsterPawn*>               FreeMonsterPoints;                                 // 0x420(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_SpawnPointForMonster_C*>    SpawnPoints;                                       // 0x430(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<int32>                                TempIdSpawnPoint;                                  // 0x440(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        TempId;                                            // 0x450(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DrawSpawnPointsInRadius;                           // 0x454(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_13BF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CurrentID;                                         // 0x458(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_13C0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AWTLMonsterPawn*                       FreePtr;                                           // 0x460(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            EventOnMonsterDead;                                // 0x468(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         RandomSpawnPoint;                                  // 0x478(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_13C5[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                FindMonsterClass;                                  // 0x480(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                ReplaceMonsterClass;                               // 0x488(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CountMonstersReplaced;                             // 0x490(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Distance;                                          // 0x494(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               SpawnLocation;                                     // 0x498(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_13C7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                NameSpawnClass;                                    // 0x4A8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                MonsterLimit;                                      // 0x4B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                        CountSpawnPoints;                                  // 0x4C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SetSpawnPointAnchor;                               // 0x4CC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_13C8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            EventOnMonsterSpawned;                             // 0x4D0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ABP_FortificationCommandCore_C*        MyFortificationCommandCore;                        // 0x4E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        RandomID;                                          // 0x4E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_13C9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ABP_SpawnPointForMonster_C*>    CorrectSpawnPoints;                                // 0x4F0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate)

	static class UClass* StaticClass();
	static class ABP_MonsterSpawnerBase_C* GetDefaultObj();

	void DrawSpawnPoints(int32 Temp_int_Array_Index_Variable, class ABP_SpawnPointForMonster_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_2, bool CallFunc_IsValid_ReturnValue, int32 Temp_int_Loop_Counter_Variable, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue);
	void GenerateSpawnPoints(const struct FVector& LocalProjectedLocation, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue_2, float CallFunc_GetSpawnRadius_ReturnValue, class UNavigationSystemV1* CallFunc_GetNavigationSystem_ReturnValue, const struct FVector& CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation, bool CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, class UNavigationSystemV1* CallFunc_GetNavigationSystem_ReturnValue_1, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, const struct FVector& CallFunc_K2_ProjectPointToNavigation_ProjectedLocation, bool CallFunc_K2_ProjectPointToNavigation_ReturnValue, class ABP_SpawnPointForMonster_C* CallFunc_FinishSpawningActor_ReturnValue, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, TArray<class ABP_SpawnPointForMonster_C*>& CallFunc_GetAllActorsOfClass_OutActors, class ABP_SpawnPointForMonster_C* CallFunc_Array_Get_Item, class ABP_SpawnPointForMonster_C* CallFunc_Array_Get_Item_1, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, bool CallFunc_LessEqual_IntInt_ReturnValue);
	void ShowRadiusSpawn(float CallFunc_GetSpawnRadius_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue);
	void ReplaceMonsters(int32 Temp_int_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, const class FString& CallFunc_GetClassDisplayName_ReturnValue, const class FString& CallFunc_GetClassDisplayName_ReturnValue_1, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, bool CallFunc_IsValidClass_ReturnValue, bool CallFunc_IsValidClass_ReturnValue_1, TArray<class ABP_MonsterSpawnerBase_C*>& CallFunc_GetAllActorsOfClass_OutActors, int32 CallFunc_Array_Length_ReturnValue, class ABP_MonsterSpawnerBase_C* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, TSubclassOf<class AWTLMonsterPawn> CallFunc_GetMonsterClass_ReturnValue, bool CallFunc_EqualEqual_ClassClass_ReturnValue);
	void SpawnMonster(class UClass* Monster, const struct FVector& Location, uint8 Level, class AWTLMonsterPawn* CallFunc_SpawnLevel_ReturnValue);
	void UserConstructionScript(int32 CallFunc_GetMonstersLimit_ReturnValue, TSubclassOf<class AWTLMonsterPawn> CallFunc_GetMonsterClass_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_GetClassDisplayName_ReturnValue, bool CallFunc_IsValidClass_ReturnValue);
	void OnSpawnMonster();
	void ReceiveBeginPlay();
	void OnDeadMonster(class AWTLMonsterPawn* Pawn);
	void K2_MonsterSpawned(class AWTLMonsterPawn* Pawn);
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_MonsterSpawnerBase(int32 EntryPoint, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Array_Index_Variable, TArray<class ABP_SpawnPointForMonster_C*>& CallFunc_GetAllActorsOfClass_OutActors, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, float CallFunc_GetSpawnRadius_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, int32 Temp_int_Array_Index_Variable_1, class AWTLMonsterPawn* K2Node_Event_Pawn_1, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_2, int32 Temp_int_Array_Index_Variable_2, bool CallFunc_Less_IntInt_ReturnValue, class ABP_SpawnPointForMonster_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Add_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, float CallFunc_VSizeSquared_ReturnValue, bool CallFunc_LessEqual_FloatFloat_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue_3, class AWTLMonsterPawn* CallFunc_Spawn_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_4, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_5, int32 CallFunc_RandomInteger_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_1, int32 CallFunc_Array_Get_Item_1, int32 Temp_int_Loop_Counter_Variable_3, int32 CallFunc_Array_Get_Item_2, class ABP_SpawnPointForMonster_C* CallFunc_Array_Get_Item_3, int32 CallFunc_Add_IntInt_ReturnValue_3, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_3, class AWTLMonsterPawn* CallFunc_Spawn_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_Array_IsValidIndex_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_6, int32 CallFunc_RandomInteger_ReturnValue_1, enum class EWTLBPCheckResult CallFunc_WTLSwitchHasAuthority_Result, int32 CallFunc_Array_Length_ReturnValue_7, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_Greater_IntInt_ReturnValue_2, class ABP_SpawnPointForMonster_C* CallFunc_Array_Get_Item_4, int32 CallFunc_Array_Length_ReturnValue_8, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_2, int32 CallFunc_Array_Add_ReturnValue_2, class ABP_SpawnPointForMonster_C* CallFunc_Array_Get_Item_5, int32 CallFunc_Array_Length_ReturnValue_9, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_3, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_4, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue_1, float CallFunc_VSizeSquared_ReturnValue_1, class AWTLMonsterPawn* CallFunc_Spawn_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_4, bool CallFunc_Greater_FloatFloat_ReturnValue, bool CallFunc_RandomBool_ReturnValue, int32 Temp_int_Array_Index_Variable_3, class AWTLMonsterPawn* CallFunc_Array_Get_Item_6, int32 CallFunc_Array_Add_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_5, int32 Temp_int_Loop_Counter_Variable_4, int32 Temp_int_Array_Index_Variable_4, class AWTLMonsterPawn* CallFunc_Array_Get_Item_7, bool CallFunc_IsValid_ReturnValue_6, bool CallFunc_IsAlive_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_4, int32 CallFunc_Add_IntInt_ReturnValue_4, class AWTLMonsterPawn* K2Node_Event_Pawn, float K2Node_Event_DeltaSeconds, bool CallFunc_IsValid_ReturnValue_7, enum class EWTLBPCheckResult CallFunc_WTLSwitchHasAuthority_Result_1, bool K2Node_SwitchEnum_CmpSuccess_1, bool CallFunc_IsValid_ReturnValue_8, enum class EWTLFaction CallFunc_GetControlFaction_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue, class ABP_SpawnPointForMonster_C* CallFunc_Array_Get_Item_8, bool CallFunc_IsValid_ReturnValue_9, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_5, class AWTLMonsterPawn* CallFunc_Spawn_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_10, int32 CallFunc_Array_Add_ReturnValue_4);
	void EventOnMonsterSpawned__DelegateSignature(class AWTLMonsterPawn* Monster, class ABP_MonsterSpawnerBase_C* Spawner);
	void EventOnMonsterDead__DelegateSignature(class AWTLMonsterPawn* MonsterPawn, class ABP_MonsterSpawnerBase_C* Spawner);
};

}


