/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package ControlRig.

/// Class /Script/ControlRig.ControlRig
/// Size: 0x0628 (0x000028 - 0x000650)
class UControlRig : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x1D];                                      // 0x0028   (0x001D)  MISSED
	ERigExecutionType                                  ExecutionType;                                              // 0x0045   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x0046   (0x0002)  MISSED
	URigVM*                                            VM;                                                         // 0x0048   (0x0008)  
	FRigHierarchyContainer                             Hierarchy;                                                  // 0x0050   (0x0368)  
	TWeakObjectPtr<UControlRigGizmoLibrary*>           GizmoLibrary;                                               // 0x03B8   (0x0028)  
	unsigned char                                      UnknownData02_5[0x10];                                      // 0x03E0   (0x0010)  MISSED
	TMap<FName, FCachedPropertyPath>                   InputProperties;                                            // 0x03F0   (0x0050)  
	TMap<FName, FCachedPropertyPath>                   OutputProperties;                                           // 0x0440   (0x0050)  
	FControlRigDrawContainer                           DrawContainer;                                              // 0x0490   (0x0018)  
	unsigned char                                      UnknownData03_5[0x18];                                      // 0x04A8   (0x0018)  MISSED
	UAnimationDataSourceRegistry*                      DataSourceRegistry;                                         // 0x04C0   (0x0008)  
	TArray<FName>                                      EventQueue;                                                 // 0x04C8   (0x0010)  
	unsigned char                                      UnknownData04_5[0x78];                                      // 0x04D8   (0x0078)  MISSED
	FRigInfluenceMapPerEvent                           Influences;                                                 // 0x0550   (0x0060)  
	UControlRig*                                       InteractionRig;                                             // 0x05B0   (0x0008)  
	UClass*                                            InteractionRigClass;                                        // 0x05B8   (0x0008)  
	TArray<UAssetUserData*>                            AssetUserData;                                              // 0x05C0   (0x0010)  
	unsigned char                                      UnknownData05_6[0x80];                                      // 0x05D0   (0x0080)  MISSED


	/// Functions
	// Function /Script/ControlRig.ControlRig.SetInteractionRigClass
	void SetInteractionRigClass(UClass* InInteractionRigClass);                                                              // [0xf39390] Final|Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRig.SetInteractionRig
	void SetInteractionRig(UControlRig* InInteractionRig);                                                                   // [0xf39600] Final|Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRig.GetInteractionRigClass
	UClass* GetInteractionRigClass();                                                                                        // [0xf395e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ControlRig.ControlRig.GetInteractionRig
	UControlRig* GetInteractionRig();                                                                                        // [0xf396e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/ControlRig.AdditiveControlRig
/// Size: 0x0010 (0x000650 - 0x000660)
class UAdditiveControlRig : public UControlRig
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0650   (0x0010)  MISSED
};

/// Class /Script/ControlRig.ControlRigAnimInstance
/// Size: 0x0000 (0x0002C0 - 0x0002C0)
class UControlRigAnimInstance : public UAnimInstance
{ 
public:
};

/// Class /Script/ControlRig.ControlRigBlueprintGeneratedClass
/// Size: 0x0000 (0x000328 - 0x000328)
class UControlRigBlueprintGeneratedClass : public UBlueprintGeneratedClass
{ 
public:
};

/// Class /Script/ControlRig.ControlRigComponent
/// Size: 0x0100 (0x000440 - 0x000540)
class UControlRigComponent : public UPrimitiveComponent
{ 
public:
	UClass*                                            ControlRigClass;                                            // 0x0440   (0x0008)  
	FMulticastInlineDelegate                           OnPostInitializeDelegate;                                   // 0x0448   (0x0010)  
	FMulticastInlineDelegate                           OnPreSetupDelegate;                                         // 0x0458   (0x0010)  
	FMulticastInlineDelegate                           OnPostSetupDelegate;                                        // 0x0468   (0x0010)  
	FMulticastInlineDelegate                           OnPreUpdateDelegate;                                        // 0x0478   (0x0010)  
	FMulticastInlineDelegate                           OnPostUpdateDelegate;                                       // 0x0488   (0x0010)  
	TArray<FControlRigComponentMappedElement>          MappedElements;                                             // 0x0498   (0x0010)  
	bool                                               bResetTransformBeforeTick;                                  // 0x04A8   (0x0001)  
	bool                                               bResetInitialsBeforeSetup;                                  // 0x04A9   (0x0001)  
	bool                                               bUpdateRigOnTick;                                           // 0x04AA   (0x0001)  
	bool                                               bUpdateInEditor;                                            // 0x04AB   (0x0001)  
	bool                                               bDrawBones;                                                 // 0x04AC   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x04AD   (0x0003)  MISSED
	UControlRig*                                       ControlRig;                                                 // 0x04B0   (0x0008)  
	unsigned char                                      UnknownData01_6[0x88];                                      // 0x04B8   (0x0088)  MISSED


	/// Functions
	// Function /Script/ControlRig.ControlRigComponent.Update
	void Update(float DeltaTime);                                                                                            // [0xf3ee80] Final|Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.SetMappedElements
	void SetMappedElements(TArray<FControlRigComponentMappedElement> NewMappedElements);                                     // [0xf3ec30] Final|Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.SetInitialSpaceTransform
	void SetInitialSpaceTransform(FName SpaceName, FTransform InitialTransform, EControlRigComponentSpace Space);            // [0xf3a600] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.SetInitialBoneTransform
	void SetInitialBoneTransform(FName BoneName, FTransform InitialTransform, EControlRigComponentSpace Space, bool bPropagateToChildren); // [0xf3d6c0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.SetControlVector2D
	void SetControlVector2D(FName ControlName, FVector2D Value);                                                             // [0xf3c010] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.SetControlTransform
	void SetControlTransform(FName ControlName, FTransform Value, EControlRigComponentSpace Space);                          // [0xf3b310] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.SetControlScale
	void SetControlScale(FName ControlName, FVector Value, EControlRigComponentSpace Space);                                 // [0xf3b5e0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.SetControlRotator
	void SetControlRotator(FName ControlName, FRotator Value, EControlRigComponentSpace Space);                              // [0xf3b9d0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.SetControlPosition
	void SetControlPosition(FName ControlName, FVector Value, EControlRigComponentSpace Space);                              // [0xf3bbc0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.SetControlOffset
	void SetControlOffset(FName ControlName, FTransform OffsetTransform, EControlRigComponentSpace Space);                   // [0xf3ae00] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.SetControlInt
	void SetControlInt(FName ControlName, int32_t Value);                                                                    // [0xf3c230] Final|Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.SetControlFloat
	void SetControlFloat(FName ControlName, float Value);                                                                    // [0xf3c440] Final|Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.SetControlBool
	void SetControlBool(FName ControlName, bool Value);                                                                      // [0xf3c660] Final|Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.SetBoneTransform
	void SetBoneTransform(FName BoneName, FTransform Transform, EControlRigComponentSpace Space, float Weight, bool bPropagateToChildren); // [0xf3d990] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.SetBoneInitialTransformsFromSkeletalMesh
	void SetBoneInitialTransformsFromSkeletalMesh(USkeletalMesh* InSkeletalMesh);                                            // [0xf3e550] Final|Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.OnPreUpdate
	void OnPreUpdate(UControlRigComponent* Component);                                                                       // [0xf3f050] Native|Event|Public|BlueprintEvent 
	// Function /Script/ControlRig.ControlRigComponent.OnPreSetup
	void OnPreSetup(UControlRigComponent* Component);                                                                        // [0xf3f210] Native|Event|Public|BlueprintEvent 
	// Function /Script/ControlRig.ControlRigComponent.OnPostUpdate
	void OnPostUpdate(UControlRigComponent* Component);                                                                      // [0xf3ef70] Native|Event|Public|BlueprintEvent 
	// Function /Script/ControlRig.ControlRigComponent.OnPostSetup
	void OnPostSetup(UControlRigComponent* Component);                                                                       // [0xf3f130] Native|Event|Public|BlueprintEvent 
	// Function /Script/ControlRig.ControlRigComponent.OnPostInitialize
	void OnPostInitialize(UControlRigComponent* Component);                                                                  // [0xf3f2f0] Native|Event|Public|BlueprintEvent 
	// Function /Script/ControlRig.ControlRigComponent.Initialize
	void Initialize();                                                                                                       // [0xf3ef50] Final|Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.GetSpaceTransform
	FTransform GetSpaceTransform(FName SpaceName, EControlRigComponentSpace Space);                                          // [0xf3ab30] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/ControlRig.ControlRigComponent.GetInitialSpaceTransform
	FTransform GetInitialSpaceTransform(FName SpaceName, EControlRigComponentSpace Space);                                   // [0xf3a860] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/ControlRig.ControlRigComponent.GetInitialBoneTransform
	FTransform GetInitialBoneTransform(FName BoneName, EControlRigComponentSpace Space);                                     // [0xf3dd00] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/ControlRig.ControlRigComponent.GetElementNames
	TArray<FName> GetElementNames(ERigElementType ElementType);                                                              // [0xf3e430] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/ControlRig.ControlRigComponent.GetControlVector2D
	FVector2D GetControlVector2D(FName ControlName);                                                                         // [0xf3d230] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/ControlRig.ControlRigComponent.GetControlTransform
	FTransform GetControlTransform(FName ControlName, EControlRigComponentSpace Space);                                      // [0xf3c870] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/ControlRig.ControlRigComponent.GetControlScale
	FVector GetControlScale(FName ControlName, EControlRigComponentSpace Space);                                             // [0xf3caa0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/ControlRig.ControlRigComponent.GetControlRotator
	FRotator GetControlRotator(FName ControlName, EControlRigComponentSpace Space);                                          // [0xf3cd20] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/ControlRig.ControlRigComponent.GetControlRig
	UControlRig* GetControlRig();                                                                                            // [0xf3f410] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/ControlRig.ControlRigComponent.GetControlPosition
	FVector GetControlPosition(FName ControlName, EControlRigComponentSpace Space);                                          // [0xf3cf90] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/ControlRig.ControlRigComponent.GetControlOffset
	FTransform GetControlOffset(FName ControlName, EControlRigComponentSpace Space);                                         // [0xf3b100] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.GetControlInt
	int32_t GetControlInt(FName ControlName);                                                                                // [0xf3d360] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/ControlRig.ControlRigComponent.GetControlFloat
	float GetControlFloat(FName ControlName);                                                                                // [0xf3d490] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/ControlRig.ControlRigComponent.GetControlBool
	bool GetControlBool(FName ControlName);                                                                                  // [0xf3d5b0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/ControlRig.ControlRigComponent.GetBoneTransform
	FTransform GetBoneTransform(FName BoneName, EControlRigComponentSpace Space);                                            // [0xf3dfa0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/ControlRig.ControlRigComponent.GetAbsoluteTime
	float GetAbsoluteTime();                                                                                                 // [0xf3f3d0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ControlRig.ControlRigComponent.DoesElementExist
	bool DoesElementExist(FName Name, ERigElementType ElementType);                                                          // [0xf3e2c0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/ControlRig.ControlRigComponent.ClearMappedElements
	void ClearMappedElements();                                                                                              // [0xf3ee60] Final|Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.AddMappedSkeletalMesh
	void AddMappedSkeletalMesh(USkeletalMeshComponent* SkeletalMeshComponent, TArray<FControlRigComponentMappedBone> Bones, TArray<FControlRigComponentMappedCurve> Curves); // [0xf3e740] Final|Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.AddMappedElements
	void AddMappedElements(TArray<FControlRigComponentMappedElement> NewMappedElements);                                     // [0xf3eaf0] Final|Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.AddMappedComponents
	void AddMappedComponents(TArray<FControlRigComponentMappedComponent> Components);                                        // [0xf3e9c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigComponent.AddMappedCompleteSkeletalMesh
	void AddMappedCompleteSkeletalMesh(USkeletalMeshComponent* SkeletalMeshComponent);                                       // [0xf3e640] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/ControlRig.ControlRigControlActor
/// Size: 0x0090 (0x000220 - 0x0002B0)
class AControlRigControlActor : public AActor
{ 
public:
	AActor*                                            ActorToTrack;                                               // 0x0220   (0x0008)  
	UClass*                                            ControlRigClass;                                            // 0x0228   (0x0008)  
	bool                                               bRefreshOnTick;                                             // 0x0230   (0x0001)  
	bool                                               bIsSelectable;                                              // 0x0231   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x0232   (0x0006)  MISSED
	UMaterialInterface*                                MaterialOverride;                                           // 0x0238   (0x0008)  
	FString                                            ColorParameter;                                             // 0x0240   (0x0010)  
	bool                                               bCastShadows;                                               // 0x0250   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0251   (0x0007)  MISSED
	USceneComponent*                                   ActorRootComponent;                                         // 0x0258   (0x0008)  
	UControlRig*                                       ControlRig;                                                 // 0x0260   (0x0008)  
	TArray<FName>                                      ControlNames;                                               // 0x0268   (0x0010)  
	TArray<FTransform>                                 GizmoTransforms;                                            // 0x0278   (0x0010)  
	TArray<UStaticMeshComponent*>                      Components;                                                 // 0x0288   (0x0010)  
	TArray<UMaterialInstanceDynamic*>                  Materials;                                                  // 0x0298   (0x0010)  
	FName                                              ColorParameterName;                                         // 0x02A8   (0x0008)  


	/// Functions
	// Function /Script/ControlRig.ControlRigControlActor.Refresh
	void Refresh();                                                                                                          // [0xf42cc0] Final|Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigControlActor.Clear
	void Clear();                                                                                                            // [0xf42ce0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/ControlRig.ControlRigGizmoActor
/// Size: 0x0028 (0x000220 - 0x000248)
class AControlRigGizmoActor : public AActor
{ 
public:
	USceneComponent*                                   ActorRootComponent;                                         // 0x0220   (0x0008)  
	UStaticMeshComponent*                              StaticMeshComponent;                                        // 0x0228   (0x0008)  
	uint32_t                                           ControlRigIndex;                                            // 0x0230   (0x0004)  
	FName                                              ControlName;                                                // 0x0234   (0x0008)  
	FName                                              ColorParameterName;                                         // 0x023C   (0x0008)  
	bool                                               bEnabled;                                                   // 0x0244:0 (0x0001)  
	bool                                               bSelected;                                                  // 0x0244:1 (0x0001)  
	bool                                               bSelectable;                                                // 0x0244:2 (0x0001)  
	bool                                               bHovered;                                                   // 0x0244:3 (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0245   (0x0003)  MISSED


	/// Functions
	// Function /Script/ControlRig.ControlRigGizmoActor.SetSelected
	void SetSelected(bool bInSelected);                                                                                      // [0xf43ee0] Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigGizmoActor.SetSelectable
	void SetSelectable(bool bInSelectable);                                                                                  // [0xf43dd0] Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigGizmoActor.SetHovered
	void SetHovered(bool bInHovered);                                                                                        // [0xf43cf0] Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigGizmoActor.SetGlobalTransform
	void SetGlobalTransform(FTransform& InTransform);                                                                        // [0xf43b80] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigGizmoActor.SetEnabled
	void SetEnabled(bool bInEnabled);                                                                                        // [0xf43ff0] Native|Public|BlueprintCallable 
	// Function /Script/ControlRig.ControlRigGizmoActor.OnTransformChanged
	void OnTransformChanged(FTransform& NewTransform);                                                                       // [0x1ad0090] Event|Public|HasOutParms|HasDefaults|BlueprintEvent 
	// Function /Script/ControlRig.ControlRigGizmoActor.OnSelectionChanged
	void OnSelectionChanged(bool bIsSelected);                                                                               // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/ControlRig.ControlRigGizmoActor.OnManipulatingChanged
	void OnManipulatingChanged(bool bIsManipulating);                                                                        // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/ControlRig.ControlRigGizmoActor.OnHoveredChanged
	void OnHoveredChanged(bool bIsSelected);                                                                                 // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/ControlRig.ControlRigGizmoActor.OnEnabledChanged
	void OnEnabledChanged(bool bIsEnabled);                                                                                  // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/ControlRig.ControlRigGizmoActor.IsSelectedInEditor
	bool IsSelectedInEditor();                                                                                               // [0xf43eb0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ControlRig.ControlRigGizmoActor.IsHovered
	bool IsHovered();                                                                                                        // [0xf43cc0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ControlRig.ControlRigGizmoActor.IsEnabled
	bool IsEnabled();                                                                                                        // [0xf43fc0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ControlRig.ControlRigGizmoActor.GetGlobalTransform
	FTransform GetGlobalTransform();                                                                                         // [0xf43b00] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/ControlRig.ControlRigGizmoLibrary
/// Size: 0x00B8 (0x000028 - 0x0000E0)
class UControlRigGizmoLibrary : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FControlRigGizmoDefinition                         DefaultGizmo;                                               // 0x0030   (0x0060)  
	TWeakObjectPtr<UMaterial*>                         DefaultMaterial;                                            // 0x0090   (0x0028)  
	FName                                              MaterialColorParameter;                                     // 0x00B8   (0x0008)  
	TArray<FControlRigGizmoDefinition>                 Gizmos;                                                     // 0x00C0   (0x0010)  
	unsigned char                                      UnknownData01_6[0x10];                                      // 0x00D0   (0x0010)  MISSED
};

/// Class /Script/ControlRig.ControlRigLayerInstance
/// Size: 0x0000 (0x0002C0 - 0x0002C0)
class UControlRigLayerInstance : public UAnimInstance
{ 
public:
};

/// Class /Script/ControlRig.ControlRigValidationPass
/// Size: 0x0000 (0x000028 - 0x000028)
class UControlRigValidationPass : public UObject
{ 
public:
};

/// Class /Script/ControlRig.ControlRigNumericalValidationPass
/// Size: 0x0038 (0x000028 - 0x000060)
class UControlRigNumericalValidationPass : public UControlRigValidationPass
{ 
public:
	bool                                               bCheckControls;                                             // 0x0028   (0x0001)  
	bool                                               bCheckBones;                                                // 0x0029   (0x0001)  
	bool                                               bCheckCurves;                                               // 0x002A   (0x0001)  
	unsigned char                                      UnknownData00_5[0x1];                                       // 0x002B   (0x0001)  MISSED
	float                                              TranslationPrecision;                                       // 0x002C   (0x0004)  
	float                                              RotationPrecision;                                          // 0x0030   (0x0004)  
	float                                              ScalePrecision;                                             // 0x0034   (0x0004)  
	float                                              CurvePrecision;                                             // 0x0038   (0x0004)  
	FName                                              EventNameA;                                                 // 0x003C   (0x0008)  
	FName                                              EventNameB;                                                 // 0x0044   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x004C   (0x0004)  MISSED
	FRigPose                                           Pose;                                                       // 0x0050   (0x0010)  
};

/// Class /Script/ControlRig.ControlRigObjectHolder
/// Size: 0x0010 (0x000028 - 0x000038)
class UControlRigObjectHolder : public UObject
{ 
public:
	TArray<UObject*>                                   Objects;                                                    // 0x0028   (0x0010)  
};

/// Class /Script/ControlRig.ControlRigSequence
/// Size: 0x0058 (0x0001C8 - 0x000220)
class UControlRigSequence : public ULevelSequence
{ 
public:
	TWeakObjectPtr<UAnimSequence*>                     LastExportedToAnimationSequence;                            // 0x01C8   (0x0028)  
	TWeakObjectPtr<USkeletalMesh*>                     LastExportedUsingSkeletalMesh;                              // 0x01F0   (0x0028)  
	float                                              LastExportedFrameRate;                                      // 0x0218   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x021C   (0x0004)  MISSED
};

/// Class /Script/ControlRig.ControlRigSequencerAnimInstance
/// Size: 0x0010 (0x0002C0 - 0x0002D0)
class UControlRigSequencerAnimInstance : public UAnimSequencerInstance
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x02C0   (0x0010)  MISSED
};

/// Class /Script/ControlRig.ControlRigSettings
/// Size: 0x0000 (0x000038 - 0x000038)
class UControlRigSettings : public UDeveloperSettings
{ 
public:
};

/// Class /Script/ControlRig.ControlRigValidator
/// Size: 0x0040 (0x000028 - 0x000068)
class UControlRigValidator : public UObject
{ 
public:
	TArray<UControlRigValidationPass*>                 Passes;                                                     // 0x0028   (0x0010)  
	unsigned char                                      UnknownData00_6[0x30];                                      // 0x0038   (0x0030)  MISSED
};

/// Class /Script/ControlRig.FKControlRig
/// Size: 0x0018 (0x000650 - 0x000668)
class UFKControlRig : public UControlRig
{ 
public:
	TArray<bool>                                       IsControlActive;                                            // 0x0650   (0x0010)  
	EControlRigFKRigExecuteMode                        ApplyMode;                                                  // 0x0660   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0661   (0x0007)  MISSED
};

/// Class /Script/ControlRig.MovieSceneControlRigParameterSection
/// Size: 0x01A8 (0x000148 - 0x0002F0)
class UMovieSceneControlRigParameterSection : public UMovieSceneParameterSection
{ 
public:
	UControlRig*                                       ControlRig;                                                 // 0x0148   (0x0008)  
	TArray<bool>                                       ControlsMask;                                               // 0x0150   (0x0010)  
	FMovieSceneTransformMask                           TransformMask;                                              // 0x0160   (0x0004)  
	bool                                               bAdditive;                                                  // 0x0164   (0x0001)  
	bool                                               bApplyBoneFilter;                                           // 0x0165   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0166   (0x0002)  MISSED
	FInputBlendPose                                    BoneFilter;                                                 // 0x0168   (0x0010)  
	FMovieSceneFloatChannel                            Weight;                                                     // 0x0178   (0x00A0)  
	TMap<FName, FChannelMapInfo>                       ControlChannelMap;                                          // 0x0218   (0x0050)  
	TArray<FEnumParameterNameAndCurve>                 EnumParameterNamesAndCurves;                                // 0x0268   (0x0010)  
	TArray<FIntegerParameterNameAndCurve>              IntegerParameterNamesAndCurves;                             // 0x0278   (0x0010)  
	unsigned char                                      UnknownData01_6[0x68];                                      // 0x0288   (0x0068)  MISSED
};

/// Class /Script/ControlRig.MovieSceneControlRigParameterTrack
/// Size: 0x0038 (0x000078 - 0x0000B0)
class UMovieSceneControlRigParameterTrack : public UMovieSceneNameableTrack
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0078   (0x0010)  MISSED
	UControlRig*                                       ControlRig;                                                 // 0x0088   (0x0008)  
	UMovieSceneSection*                                SectionToKey;                                               // 0x0090   (0x0008)  
	TArray<UMovieSceneSection*>                        Sections;                                                   // 0x0098   (0x0010)  
	FName                                              TrackName;                                                  // 0x00A8   (0x0008)  
};

/// Struct /Script/ControlRig.AnimationHierarchy
/// Size: 0x0010 (0x000078 - 0x000088)
struct FAnimationHierarchy : FNodeHierarchyWithUserData
{ 
	TArray<FConstraintNodeData>                        UserData;                                                   // 0x0078   (0x0010)  
};

/// Struct /Script/ControlRig.ConstraintNodeData
/// Size: 0x00B0 (0x000000 - 0x0000B0)
struct FConstraintNodeData
{ 
	FTransform                                         RelativeParent;                                             // 0x0000   (0x0030)  
	FConstraintOffset                                  ConstraintOffset;                                           // 0x0030   (0x0060)  
	FName                                              LinkedNode;                                                 // 0x0090   (0x0008)  
	TArray<FTransformConstraint>                       Constraints;                                                // 0x0098   (0x0010)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x00A8   (0x0008)  MISSED
};

/// Struct /Script/ControlRig.AnimNode_ControlRigBase
/// Size: 0x0118 (0x000058 - 0x000170)
struct FAnimNode_ControlRigBase : FAnimNode_CustomProperty
{ 
	FPoseLink                                          Source;                                                     // 0x0058   (0x0010)  
	TMap<FName, uint16_t>                              ControlRigBoneMapping;                                      // 0x0068   (0x0050)  
	TMap<FName, uint16_t>                              ControlRigCurveMapping;                                     // 0x00B8   (0x0050)  
	TMap<FName, uint16_t>                              InputToCurveMappingUIDs;                                    // 0x0108   (0x0050)  
	TWeakObjectPtr<UNodeMappingContainer*>             NodeMappingContainer;                                       // 0x0158   (0x0008)  
	FControlRigIOSettings                              InputSettings;                                              // 0x0160   (0x0002)  
	FControlRigIOSettings                              OutputSettings;                                             // 0x0162   (0x0002)  
	bool                                               bExecute;                                                   // 0x0164   (0x0001)  
	unsigned char                                      UnknownData00_6[0xB];                                       // 0x0165   (0x000B)  MISSED
};

/// Struct /Script/ControlRig.ControlRigIOSettings
/// Size: 0x0002 (0x000000 - 0x000002)
struct FControlRigIOSettings
{ 
	bool                                               bUpdatePose;                                                // 0x0000   (0x0001)  
	bool                                               bUpdateCurves;                                              // 0x0001   (0x0001)  
};

/// Struct /Script/ControlRig.AnimNode_ControlRig
/// Size: 0x01F8 (0x000170 - 0x000368)
struct FAnimNode_ControlRig : FAnimNode_ControlRigBase
{ 
	UClass*                                            ControlRigClass;                                            // 0x0170   (0x0008)  
	UControlRig*                                       ControlRig;                                                 // 0x0178   (0x0008)  
	float                                              Alpha;                                                      // 0x0180   (0x0004)  
	EAnimAlphaInputType                                AlphaInputType;                                             // 0x0184   (0x0001)  
	bool                                               bAlphaBoolEnabled;                                          // 0x0185:0 (0x0001)  
	bool                                               bSetRefPoseFromSkeleton;                                    // 0x0185:1 (0x0001)  
	unsigned char                                      UnknownData00_4[0x2];                                       // 0x0186   (0x0002)  MISSED
	FInputScaleBias                                    AlphaScaleBias;                                             // 0x0188   (0x0008)  
	FInputAlphaBoolBlend                               AlphaBoolBlend;                                             // 0x0190   (0x0048)  
	FName                                              AlphaCurveName;                                             // 0x01D8   (0x0008)  
	FInputScaleBiasClamp                               AlphaScaleBiasClamp;                                        // 0x01E0   (0x0030)  
	TMap<FName, FName>                                 InputMapping;                                               // 0x0210   (0x0050)  
	TMap<FName, FName>                                 OutputMapping;                                              // 0x0260   (0x0050)  
	unsigned char                                      UnknownData01_5[0xB0];                                      // 0x02B0   (0x00B0)  MISSED
	int32_t                                            LODThreshold;                                               // 0x0360   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0364   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.AnimNode_ControlRig_ExternalSource
/// Size: 0x0008 (0x000170 - 0x000178)
struct FAnimNode_ControlRig_ExternalSource : FAnimNode_ControlRigBase
{ 
	TWeakObjectPtr<UControlRig*>                       ControlRig;                                                 // 0x0170   (0x0008)  
};

/// Struct /Script/ControlRig.ControlRigAnimInstanceProxy
/// Size: 0x00A0 (0x000760 - 0x000800)
struct FControlRigAnimInstanceProxy : FAnimInstanceProxy
{ 
	unsigned char                                      UnknownData00_1[0xA0];                                      // 0x0760   (0x00A0)  MISSED
};

/// Struct /Script/ControlRig.ControlRigComponentMappedCurve
/// Size: 0x0010 (0x000000 - 0x000010)
struct FControlRigComponentMappedCurve
{ 
	FName                                              Source;                                                     // 0x0000   (0x0008)  
	FName                                              Target;                                                     // 0x0008   (0x0008)  
};

/// Struct /Script/ControlRig.ControlRigComponentMappedBone
/// Size: 0x0010 (0x000000 - 0x000010)
struct FControlRigComponentMappedBone
{ 
	FName                                              Source;                                                     // 0x0000   (0x0008)  
	FName                                              Target;                                                     // 0x0008   (0x0008)  
};

/// Struct /Script/ControlRig.ControlRigComponentMappedComponent
/// Size: 0x0018 (0x000000 - 0x000018)
struct FControlRigComponentMappedComponent
{ 
	USceneComponent*                                   Component;                                                  // 0x0000   (0x0008)  
	FName                                              ElementName;                                                // 0x0008   (0x0008)  
	ERigElementType                                    ElementType;                                                // 0x0010   (0x0001)  
	EControlRigComponentMapDirection                   Direction;                                                  // 0x0011   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0012   (0x0006)  MISSED
};

/// Struct /Script/ControlRig.ControlRigComponentMappedElement
/// Size: 0x00A0 (0x000000 - 0x0000A0)
struct FControlRigComponentMappedElement
{ 
	FComponentReference                                ComponentReference;                                         // 0x0000   (0x0028)  
	int32_t                                            TransformIndex;                                             // 0x0028   (0x0004)  
	FName                                              TransformName;                                              // 0x002C   (0x0008)  
	ERigElementType                                    ElementType;                                                // 0x0034   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0035   (0x0003)  MISSED
	FName                                              ElementName;                                                // 0x0038   (0x0008)  
	EControlRigComponentMapDirection                   Direction;                                                  // 0x0040   (0x0001)  
	unsigned char                                      UnknownData01_5[0xF];                                       // 0x0041   (0x000F)  MISSED
	FTransform                                         Offset;                                                     // 0x0050   (0x0030)  
	float                                              Weight;                                                     // 0x0080   (0x0004)  
	EControlRigComponentSpace                          Space;                                                      // 0x0084   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0085   (0x0003)  MISSED
	USceneComponent*                                   SceneComponent;                                             // 0x0088   (0x0008)  
	int32_t                                            ElementIndex;                                               // 0x0090   (0x0004)  
	int32_t                                            SubIndex;                                                   // 0x0094   (0x0004)  
	unsigned char                                      UnknownData03_6[0x8];                                       // 0x0098   (0x0008)  MISSED
};

/// Struct /Script/ControlRig.ControlRigExecuteContext
/// Size: 0x0008 (0x000058 - 0x000060)
struct FControlRigExecuteContext : FRigVMExecuteContext
{ 
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0058   (0x0008)  MISSED
};

/// Struct /Script/ControlRig.ControlRigDrawContainer
/// Size: 0x0018 (0x000000 - 0x000018)
struct FControlRigDrawContainer
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
	TArray<FControlRigDrawInstruction>                 Instructions;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/ControlRig.ControlRigDrawInstruction
/// Size: 0x00A0 (0x000000 - 0x0000A0)
struct FControlRigDrawInstruction
{ 
	FName                                              Name;                                                       // 0x0000   (0x0008)  
	TEnumAsByte<EControlRigDrawSettings>               PrimitiveType;                                              // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0009   (0x0007)  MISSED
	TArray<FVector>                                    Positions;                                                  // 0x0010   (0x0010)  
	FLinearColor                                       Color;                                                      // 0x0020   (0x0010)  
	float                                              Thickness;                                                  // 0x0030   (0x0004)  
	unsigned char                                      UnknownData01_5[0xC];                                       // 0x0034   (0x000C)  MISSED
	FTransform                                         Transform;                                                  // 0x0040   (0x0030)  
	unsigned char                                      UnknownData02_6[0x30];                                      // 0x0070   (0x0030)  MISSED
};

/// Struct /Script/ControlRig.ControlRigDrawInterface
/// Size: 0x0000 (0x000018 - 0x000018)
struct FControlRigDrawInterface : FControlRigDrawContainer
{ 
};

/// Struct /Script/ControlRig.GizmoActorCreationParam
/// Size: 0x0120 (0x000000 - 0x000120)
struct FGizmoActorCreationParam
{ 
	unsigned char                                      UnknownData00_1[0x120];                                     // 0x0000   (0x0120)  MISSED
};

/// Struct /Script/ControlRig.ControlRigGizmoDefinition
/// Size: 0x0060 (0x000000 - 0x000060)
struct FControlRigGizmoDefinition
{ 
	FName                                              GizmoName;                                                  // 0x0000   (0x0008)  
	TWeakObjectPtr<UStaticMesh*>                       StaticMesh;                                                 // 0x0008   (0x0028)  
	FTransform                                         Transform;                                                  // 0x0030   (0x0030)  
};

/// Struct /Script/ControlRig.ControlRigLayerInstanceProxy
/// Size: 0x00A0 (0x000760 - 0x000800)
struct FControlRigLayerInstanceProxy : FAnimInstanceProxy
{ 
	unsigned char                                      UnknownData00_1[0xA0];                                      // 0x0760   (0x00A0)  MISSED
};

/// Struct /Script/ControlRig.AnimNode_ControlRigInputPose
/// Size: 0x0020 (0x000010 - 0x000030)
struct FAnimNode_ControlRigInputPose : FAnimNode_Base
{ 
	FPoseLink                                          InputPose;                                                  // 0x0010   (0x0010)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x0020   (0x0010)  MISSED
};

/// Struct /Script/ControlRig.CRFourPointBezier
/// Size: 0x0030 (0x000000 - 0x000030)
struct FCRFourPointBezier
{ 
	FVector                                            A;                                                          // 0x0000   (0x000C)  
	FVector                                            B;                                                          // 0x000C   (0x000C)  
	FVector                                            C;                                                          // 0x0018   (0x000C)  
	FVector                                            D;                                                          // 0x0024   (0x000C)  
};

/// Struct /Script/ControlRig.ControlRigSequenceObjectReferenceMap
/// Size: 0x0020 (0x000000 - 0x000020)
struct FControlRigSequenceObjectReferenceMap
{ 
	TArray<FGuid>                                      BindingIds;                                                 // 0x0000   (0x0010)  
	TArray<FControlRigSequenceObjectReferences>        References;                                                 // 0x0010   (0x0010)  
};

/// Struct /Script/ControlRig.ControlRigSequenceObjectReferences
/// Size: 0x0010 (0x000000 - 0x000010)
struct FControlRigSequenceObjectReferences
{ 
	TArray<FControlRigSequenceObjectReference>         Array;                                                      // 0x0000   (0x0010)  
};

/// Struct /Script/ControlRig.ControlRigSequenceObjectReference
/// Size: 0x0008 (0x000000 - 0x000008)
struct FControlRigSequenceObjectReference
{ 
	UClass*                                            ControlRigClass;                                            // 0x0000   (0x0008)  
};

/// Struct /Script/ControlRig.ControlRigSequencerAnimInstanceProxy
/// Size: 0x02B0 (0x000A00 - 0x000CB0)
struct FControlRigSequencerAnimInstanceProxy : FAnimSequencerInstanceProxy
{ 
	unsigned char                                      UnknownData00_1[0x2B0];                                     // 0x0A00   (0x02B0)  MISSED
};

/// Struct /Script/ControlRig.ControlRigSettingsPerPinBool
/// Size: 0x0050 (0x000000 - 0x000050)
struct FControlRigSettingsPerPinBool
{ 
	TMap<FString, bool>                                Values;                                                     // 0x0000   (0x0050)  
};

/// Struct /Script/ControlRig.ControlRigValidationContext
/// Size: 0x0028 (0x000000 - 0x000028)
struct FControlRigValidationContext
{ 
	unsigned char                                      UnknownData00_1[0x28];                                      // 0x0000   (0x0028)  MISSED
};

/// Struct /Script/ControlRig.CRSimContainer
/// Size: 0x0018 (0x000000 - 0x000018)
struct FCRSimContainer
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
	float                                              TimeStep;                                                   // 0x0008   (0x0004)  
	float                                              AccumulatedTime;                                            // 0x000C   (0x0004)  
	float                                              TimeLeftForStep;                                            // 0x0010   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.CRSimLinearSpring
/// Size: 0x0010 (0x000000 - 0x000010)
struct FCRSimLinearSpring
{ 
	int32_t                                            SubjectA;                                                   // 0x0000   (0x0004)  
	int32_t                                            SubjectB;                                                   // 0x0004   (0x0004)  
	float                                              Coefficient;                                                // 0x0008   (0x0004)  
	float                                              Equilibrium;                                                // 0x000C   (0x0004)  
};

/// Struct /Script/ControlRig.CRSimPoint
/// Size: 0x0028 (0x000000 - 0x000028)
struct FCRSimPoint
{ 
	float                                              Mass;                                                       // 0x0000   (0x0004)  
	float                                              Size;                                                       // 0x0004   (0x0004)  
	float                                              LinearDamping;                                              // 0x0008   (0x0004)  
	float                                              InheritMotion;                                              // 0x000C   (0x0004)  
	FVector                                            Position;                                                   // 0x0010   (0x000C)  
	FVector                                            LinearVelocity;                                             // 0x001C   (0x000C)  
};

/// Struct /Script/ControlRig.CRSimPointConstraint
/// Size: 0x0024 (0x000000 - 0x000024)
struct FCRSimPointConstraint
{ 
	ECRSimConstraintType                               Type;                                                       // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            SubjectA;                                                   // 0x0004   (0x0004)  
	int32_t                                            SubjectB;                                                   // 0x0008   (0x0004)  
	FVector                                            DataA;                                                      // 0x000C   (0x000C)  
	FVector                                            DataB;                                                      // 0x0018   (0x000C)  
};

/// Struct /Script/ControlRig.CRSimPointContainer
/// Size: 0x0060 (0x000018 - 0x000078)
struct FCRSimPointContainer : FCRSimContainer
{ 
	TArray<FCRSimPoint>                                Points;                                                     // 0x0018   (0x0010)  
	TArray<FCRSimLinearSpring>                         Springs;                                                    // 0x0028   (0x0010)  
	TArray<FCRSimPointForce>                           Forces;                                                     // 0x0038   (0x0010)  
	TArray<FCRSimSoftCollision>                        CollisionVolumes;                                           // 0x0048   (0x0010)  
	TArray<FCRSimPointConstraint>                      Constraints;                                                // 0x0058   (0x0010)  
	TArray<FCRSimPoint>                                PreviousStep;                                               // 0x0068   (0x0010)  
};

/// Struct /Script/ControlRig.CRSimSoftCollision
/// Size: 0x0050 (0x000000 - 0x000050)
struct FCRSimSoftCollision
{ 
	FTransform                                         Transform;                                                  // 0x0000   (0x0030)  
	ECRSimSoftCollisionType                            ShapeType;                                                  // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0031   (0x0003)  MISSED
	float                                              MinimumDistance;                                            // 0x0034   (0x0004)  
	float                                              MaximumDistance;                                            // 0x0038   (0x0004)  
	EControlRigAnimEasingType                          FalloffType;                                                // 0x003C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x003D   (0x0003)  MISSED
	float                                              Coefficient;                                                // 0x0040   (0x0004)  
	bool                                               bInverted;                                                  // 0x0044   (0x0001)  
	unsigned char                                      UnknownData02_6[0xB];                                       // 0x0045   (0x000B)  MISSED
};

/// Struct /Script/ControlRig.CRSimPointForce
/// Size: 0x0018 (0x000000 - 0x000018)
struct FCRSimPointForce
{ 
	ECRSimPointForceType                               ForceType;                                                  // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	FVector                                            Vector;                                                     // 0x0004   (0x000C)  
	float                                              Coefficient;                                                // 0x0010   (0x0004)  
	bool                                               bNormalize;                                                 // 0x0014   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0015   (0x0003)  MISSED
};

/// Struct /Script/ControlRig.MovieSceneControlRigInstanceData
/// Size: 0x00D0 (0x000008 - 0x0000D8)
struct FMovieSceneControlRigInstanceData : FMovieSceneSequenceInstanceData
{ 
	bool                                               bAdditive;                                                  // 0x0008   (0x0001)  
	bool                                               bApplyBoneFilter;                                           // 0x0009   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x000A   (0x0006)  MISSED
	FInputBlendPose                                    BoneFilter;                                                 // 0x0010   (0x0010)  
	FMovieSceneFloatChannel                            Weight;                                                     // 0x0020   (0x00A0)  
	FMovieSceneEvaluationOperand                       Operand;                                                    // 0x00C0   (0x0014)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x00D4   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.ChannelMapInfo
/// Size: 0x0018 (0x000000 - 0x000018)
struct FChannelMapInfo
{ 
	int32_t                                            ControlIndex;                                               // 0x0000   (0x0004)  
	int32_t                                            TotalChannelIndex;                                          // 0x0004   (0x0004)  
	int32_t                                            ChannelIndex;                                               // 0x0008   (0x0004)  
	int32_t                                            ParentControlIndex;                                         // 0x000C   (0x0004)  
	FName                                              ChannelTypeName;                                            // 0x0010   (0x0008)  
};

/// Struct /Script/ControlRig.IntegerParameterNameAndCurve
/// Size: 0x0098 (0x000000 - 0x000098)
struct FIntegerParameterNameAndCurve
{ 
	FName                                              ParameterName;                                              // 0x0000   (0x0008)  
	FMovieSceneIntegerChannel                          ParameterCurve;                                             // 0x0008   (0x0090)  
};

/// Struct /Script/ControlRig.EnumParameterNameAndCurve
/// Size: 0x00A0 (0x000000 - 0x0000A0)
struct FEnumParameterNameAndCurve
{ 
	FName                                              ParameterName;                                              // 0x0000   (0x0008)  
	FMovieSceneByteChannel                             ParameterCurve;                                             // 0x0008   (0x0098)  
};

/// Struct /Script/ControlRig.MovieSceneControlRigParameterTemplate
/// Size: 0x0020 (0x000080 - 0x0000A0)
struct FMovieSceneControlRigParameterTemplate : FMovieSceneParameterSectionTemplate
{ 
	TArray<FEnumParameterNameAndCurve>                 Enums;                                                      // 0x0080   (0x0010)  
	TArray<FIntegerParameterNameAndCurve>              Integers;                                                   // 0x0090   (0x0010)  
};

/// Struct /Script/ControlRig.RigBoneHierarchy
/// Size: 0x0098 (0x000000 - 0x000098)
struct FRigBoneHierarchy
{ 
	unsigned char                                      UnknownData00_2[0x20];                                      // 0x0000   (0x0020)  MISSED
	TArray<FRigBone>                                   Bones;                                                      // 0x0020   (0x0010)  
	TMap<FName, int32_t>                               NameToIndexMapping;                                         // 0x0030   (0x0050)  
	TArray<FName>                                      Selection;                                                  // 0x0080   (0x0010)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0090   (0x0008)  MISSED
};

/// Struct /Script/ControlRig.RigElement
/// Size: 0x0018 (0x000000 - 0x000018)
struct FRigElement
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
	FName                                              Name;                                                       // 0x0008   (0x0008)  
	int32_t                                            Index;                                                      // 0x0010   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigBone
/// Size: 0x00C8 (0x000018 - 0x0000E0)
struct FRigBone : FRigElement
{ 
	FName                                              ParentName;                                                 // 0x0018   (0x0008)  
	int32_t                                            ParentIndex;                                                // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_5[0xC];                                       // 0x0024   (0x000C)  MISSED
	FTransform                                         InitialTransform;                                           // 0x0030   (0x0030)  
	FTransform                                         GlobalTransform;                                            // 0x0060   (0x0030)  
	FTransform                                         LocalTransform;                                             // 0x0090   (0x0030)  
	TArray<int32_t>                                    Dependents;                                                 // 0x00C0   (0x0010)  
	ERigBoneType                                       Type;                                                       // 0x00D0   (0x0001)  
	unsigned char                                      UnknownData01_6[0xF];                                       // 0x00D1   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigControlHierarchy
/// Size: 0x0108 (0x000000 - 0x000108)
struct FRigControlHierarchy
{ 
	unsigned char                                      UnknownData00_2[0x98];                                      // 0x0000   (0x0098)  MISSED
	TArray<FRigControl>                                Controls;                                                   // 0x0098   (0x0010)  
	TMap<FName, int32_t>                               NameToIndexMapping;                                         // 0x00A8   (0x0050)  
	TArray<FName>                                      Selection;                                                  // 0x00F8   (0x0010)  
};

/// Struct /Script/ControlRig.RigControl
/// Size: 0x02D8 (0x000018 - 0x0002F0)
struct FRigControl : FRigElement
{ 
	ERigControlType                                    ControlType;                                                // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0019   (0x0003)  MISSED
	FName                                              DisplayName;                                                // 0x001C   (0x0008)  
	FName                                              ParentName;                                                 // 0x0024   (0x0008)  
	int32_t                                            ParentIndex;                                                // 0x002C   (0x0004)  
	FName                                              SpaceName;                                                  // 0x0030   (0x0008)  
	int32_t                                            SpaceIndex;                                                 // 0x0038   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x003C   (0x0004)  MISSED
	FTransform                                         OffsetTransform;                                            // 0x0040   (0x0030)  
	FRigControlValue                                   InitialValue;                                               // 0x0070   (0x0080)  
	FRigControlValue                                   Value;                                                      // 0x00F0   (0x0080)  
	ERigControlAxis                                    PrimaryAxis;                                                // 0x0170   (0x0001)  
	bool                                               bIsCurve;                                                   // 0x0171   (0x0001)  
	bool                                               bAnimatable;                                                // 0x0172   (0x0001)  
	bool                                               bLimitTranslation;                                          // 0x0173   (0x0001)  
	bool                                               bLimitRotation;                                             // 0x0174   (0x0001)  
	bool                                               bLimitScale;                                                // 0x0175   (0x0001)  
	bool                                               bDrawLimits;                                                // 0x0176   (0x0001)  
	unsigned char                                      UnknownData02_5[0x9];                                       // 0x0177   (0x0009)  MISSED
	FRigControlValue                                   MinimumValue;                                               // 0x0180   (0x0080)  
	FRigControlValue                                   MaximumValue;                                               // 0x0200   (0x0080)  
	bool                                               bGizmoEnabled;                                              // 0x0280   (0x0001)  
	bool                                               bGizmoVisible;                                              // 0x0281   (0x0001)  
	unsigned char                                      UnknownData03_5[0x2];                                       // 0x0282   (0x0002)  MISSED
	FName                                              GizmoName;                                                  // 0x0284   (0x0008)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x028C   (0x0004)  MISSED
	FTransform                                         GizmoTransform;                                             // 0x0290   (0x0030)  
	FLinearColor                                       GizmoColor;                                                 // 0x02C0   (0x0010)  
	TArray<int32_t>                                    Dependents;                                                 // 0x02D0   (0x0010)  
	bool                                               bIsTransientControl;                                        // 0x02E0   (0x0001)  
	unsigned char                                      UnknownData05_5[0x7];                                       // 0x02E1   (0x0007)  MISSED
	UEnum*                                             ControlEnum;                                                // 0x02E8   (0x0008)  
};

/// Struct /Script/ControlRig.RigControlValue
/// Size: 0x0080 (0x000000 - 0x000080)
struct FRigControlValue
{ 
	FRigControlValueStorage                            FloatStorage;                                               // 0x0000   (0x0044)  
	unsigned char                                      UnknownData00_5[0xC];                                       // 0x0044   (0x000C)  MISSED
	FTransform                                         Storage;                                                    // 0x0050   (0x0030)  
};

/// Struct /Script/ControlRig.RigControlValueStorage
/// Size: 0x0044 (0x000000 - 0x000044)
struct FRigControlValueStorage
{ 
	float                                              Float00;                                                    // 0x0000   (0x0004)  
	float                                              Float01;                                                    // 0x0004   (0x0004)  
	float                                              Float02;                                                    // 0x0008   (0x0004)  
	float                                              Float03;                                                    // 0x000C   (0x0004)  
	float                                              Float10;                                                    // 0x0010   (0x0004)  
	float                                              Float11;                                                    // 0x0014   (0x0004)  
	float                                              Float12;                                                    // 0x0018   (0x0004)  
	float                                              Float13;                                                    // 0x001C   (0x0004)  
	float                                              Float20;                                                    // 0x0020   (0x0004)  
	float                                              Float21;                                                    // 0x0024   (0x0004)  
	float                                              Float22;                                                    // 0x0028   (0x0004)  
	float                                              Float23;                                                    // 0x002C   (0x0004)  
	float                                              Float30;                                                    // 0x0030   (0x0004)  
	float                                              Float31;                                                    // 0x0034   (0x0004)  
	float                                              Float32;                                                    // 0x0038   (0x0004)  
	float                                              Float33;                                                    // 0x003C   (0x0004)  
	bool                                               bValid;                                                     // 0x0040   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0041   (0x0003)  MISSED
};

/// Struct /Script/ControlRig.RigCurveContainer
/// Size: 0x0098 (0x000000 - 0x000098)
struct FRigCurveContainer
{ 
	unsigned char                                      UnknownData00_2[0x20];                                      // 0x0000   (0x0020)  MISSED
	TArray<FRigCurve>                                  Curves;                                                     // 0x0020   (0x0010)  
	TMap<FName, int32_t>                               NameToIndexMapping;                                         // 0x0030   (0x0050)  
	TArray<FName>                                      Selection;                                                  // 0x0080   (0x0010)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0090   (0x0008)  MISSED
};

/// Struct /Script/ControlRig.RigCurve
/// Size: 0x0008 (0x000018 - 0x000020)
struct FRigCurve : FRigElement
{ 
	float                                              Value;                                                      // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.CachedRigElement
/// Size: 0x0014 (0x000000 - 0x000014)
struct FCachedRigElement
{ 
	FRigElementKey                                     Key;                                                        // 0x0000   (0x000C)  
	uint16_t                                           Index;                                                      // 0x000C   (0x0002)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x000E   (0x0002)  MISSED
	int32_t                                            ContainerVersion;                                           // 0x0010   (0x0004)  
};

/// Struct /Script/ControlRig.RigElementKey
/// Size: 0x000C (0x000000 - 0x00000C)
struct FRigElementKey
{ 
	ERigElementType                                    Type;                                                       // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              Name;                                                       // 0x0004   (0x0008)  
};

/// Struct /Script/ControlRig.RigHierarchyRef
/// Size: 0x0001 (0x000000 - 0x000001)
struct FRigHierarchyRef
{ 
	unsigned char                                      UnknownData00_1[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/ControlRig.RigHierarchyContainer
/// Size: 0x0368 (0x000000 - 0x000368)
struct FRigHierarchyContainer
{ 
	FRigBoneHierarchy                                  BoneHierarchy;                                              // 0x0000   (0x0098)  
	FRigSpaceHierarchy                                 SpaceHierarchy;                                             // 0x0098   (0x0090)  
	FRigControlHierarchy                               ControlHierarchy;                                           // 0x0128   (0x0108)  
	FRigCurveContainer                                 CurveContainer;                                             // 0x0230   (0x0098)  
	int32_t                                            Version;                                                    // 0x02C8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x9C];                                      // 0x02CC   (0x009C)  MISSED
};

/// Struct /Script/ControlRig.RigSpaceHierarchy
/// Size: 0x0090 (0x000000 - 0x000090)
struct FRigSpaceHierarchy
{ 
	unsigned char                                      UnknownData00_2[0x20];                                      // 0x0000   (0x0020)  MISSED
	TArray<FRigSpace>                                  Spaces;                                                     // 0x0020   (0x0010)  
	TMap<FName, int32_t>                               NameToIndexMapping;                                         // 0x0030   (0x0050)  
	TArray<FName>                                      Selection;                                                  // 0x0080   (0x0010)  
};

/// Struct /Script/ControlRig.RigSpace
/// Size: 0x0078 (0x000018 - 0x000090)
struct FRigSpace : FRigElement
{ 
	ERigSpaceType                                      SpaceType;                                                  // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0019   (0x0003)  MISSED
	FName                                              ParentName;                                                 // 0x001C   (0x0008)  
	int32_t                                            ParentIndex;                                                // 0x0024   (0x0004)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x0028   (0x0008)  MISSED
	FTransform                                         InitialTransform;                                           // 0x0030   (0x0030)  
	FTransform                                         LocalTransform;                                             // 0x0060   (0x0030)  
};

/// Struct /Script/ControlRig.RigMirrorSettings
/// Size: 0x0028 (0x000000 - 0x000028)
struct FRigMirrorSettings
{ 
	TEnumAsByte<EAxis>                                 MirrorAxis;                                                 // 0x0000   (0x0001)  
	TEnumAsByte<EAxis>                                 AxisToFlip;                                                 // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x0002   (0x0006)  MISSED
	FString                                            OldName;                                                    // 0x0008   (0x0010)  
	FString                                            NewName;                                                    // 0x0018   (0x0010)  
};

/// Struct /Script/ControlRig.RigHierarchyCopyPasteContent
/// Size: 0x0040 (0x000000 - 0x000040)
struct FRigHierarchyCopyPasteContent
{ 
	TArray<ERigElementType>                            Types;                                                      // 0x0000   (0x0010)  
	TArray<FString>                                    Contents;                                                   // 0x0010   (0x0010)  
	TArray<FTransform>                                 LocalTransforms;                                            // 0x0020   (0x0010)  
	TArray<FTransform>                                 GlobalTransforms;                                           // 0x0030   (0x0010)  
};

/// Struct /Script/ControlRig.RigEventContext
/// Size: 0x0028 (0x000000 - 0x000028)
struct FRigEventContext
{ 
	unsigned char                                      UnknownData00_1[0x28];                                      // 0x0000   (0x0028)  MISSED
};

/// Struct /Script/ControlRig.RigElementKeyCollection
/// Size: 0x0010 (0x000000 - 0x000010)
struct FRigElementKeyCollection
{ 
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/ControlRig.RigControlModifiedContext
/// Size: 0x0010 (0x000000 - 0x000010)
struct FRigControlModifiedContext
{ 
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/ControlRig.RigPose
/// Size: 0x0010 (0x000000 - 0x000010)
struct FRigPose
{ 
	TArray<FRigPoseElement>                            Elements;                                                   // 0x0000   (0x0010)  
};

/// Struct /Script/ControlRig.RigPoseElement
/// Size: 0x0090 (0x000000 - 0x000090)
struct FRigPoseElement
{ 
	FCachedRigElement                                  Index;                                                      // 0x0000   (0x0014)  
	unsigned char                                      UnknownData00_5[0xC];                                       // 0x0014   (0x000C)  MISSED
	FTransform                                         GlobalTransform;                                            // 0x0020   (0x0030)  
	FTransform                                         LocalTransform;                                             // 0x0050   (0x0030)  
	float                                              CurveValue;                                                 // 0x0080   (0x0004)  
	unsigned char                                      UnknownData01_6[0xC];                                       // 0x0084   (0x000C)  MISSED
};

/// Struct /Script/ControlRig.RigInfluenceMapPerEvent
/// Size: 0x0060 (0x000000 - 0x000060)
struct FRigInfluenceMapPerEvent
{ 
	TArray<FRigInfluenceMap>                           Maps;                                                       // 0x0000   (0x0010)  
	TMap<FName, int32_t>                               EventToIndex;                                               // 0x0010   (0x0050)  
};

/// Struct /Script/ControlRig.RigInfluenceMap
/// Size: 0x0068 (0x000000 - 0x000068)
struct FRigInfluenceMap
{ 
	FName                                              EventName;                                                  // 0x0000   (0x0008)  
	TArray<FRigInfluenceEntry>                         Entries;                                                    // 0x0008   (0x0010)  
	TMap<FRigElementKey, int32_t>                      KeyToIndex;                                                 // 0x0018   (0x0050)  
};

/// Struct /Script/ControlRig.RigInfluenceEntry
/// Size: 0x0020 (0x000000 - 0x000020)
struct FRigInfluenceEntry
{ 
	FRigElementKey                                     Source;                                                     // 0x0000   (0x000C)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<FRigElementKey>                             AffectedList;                                               // 0x0010   (0x0010)  
};

/// Struct /Script/ControlRig.RigInfluenceEntryModifier
/// Size: 0x0010 (0x000000 - 0x000010)
struct FRigInfluenceEntryModifier
{ 
	TArray<FRigElementKey>                             AffectedList;                                               // 0x0000   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit
/// Size: 0x0000 (0x000008 - 0x000008)
struct FRigUnit : FRigVMStruct
{ 
};

/// Struct /Script/ControlRig.RigUnitMutable
/// Size: 0x0060 (0x000008 - 0x000068)
struct FRigUnitMutable : FRigUnit
{ 
	FControlRigExecuteContext                          ExecuteContext;                                             // 0x0008   (0x0060)  
};

/// Struct /Script/ControlRig.RigUnit_SimBase
/// Size: 0x0000 (0x000008 - 0x000008)
struct FRigUnit_SimBase : FRigUnit
{ 
};

/// Struct /Script/ControlRig.RigUnit_AccumulateVectorRange
/// Size: 0x0040 (0x000008 - 0x000048)
struct FRigUnit_AccumulateVectorRange : FRigUnit_SimBase
{ 
	FVector                                            Value;                                                      // 0x0008   (0x000C)  
	FVector                                            Minimum;                                                    // 0x0014   (0x000C)  
	FVector                                            Maximum;                                                    // 0x0020   (0x000C)  
	FVector                                            AccumulatedMinimum;                                         // 0x002C   (0x000C)  
	FVector                                            AccumulatedMaximum;                                         // 0x0038   (0x000C)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0044   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_AccumulateFloatRange
/// Size: 0x0018 (0x000008 - 0x000020)
struct FRigUnit_AccumulateFloatRange : FRigUnit_SimBase
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	float                                              Minimum;                                                    // 0x000C   (0x0004)  
	float                                              Maximum;                                                    // 0x0010   (0x0004)  
	float                                              AccumulatedMinimum;                                         // 0x0014   (0x0004)  
	float                                              AccumulatedMaximum;                                         // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_AccumulateTransformLerp
/// Size: 0x00D8 (0x000008 - 0x0000E0)
struct FRigUnit_AccumulateTransformLerp : FRigUnit_SimBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FTransform                                         TargetValue;                                                // 0x0010   (0x0030)  
	FTransform                                         InitialValue;                                               // 0x0040   (0x0030)  
	float                                              Blend;                                                      // 0x0070   (0x0004)  
	bool                                               bIntegrateDeltaTime;                                        // 0x0074   (0x0001)  
	unsigned char                                      UnknownData01_5[0xB];                                       // 0x0075   (0x000B)  MISSED
	FTransform                                         Result;                                                     // 0x0080   (0x0030)  
	FTransform                                         AccumulatedValue;                                           // 0x00B0   (0x0030)  
};

/// Struct /Script/ControlRig.RigUnit_AccumulateQuatLerp
/// Size: 0x0058 (0x000008 - 0x000060)
struct FRigUnit_AccumulateQuatLerp : FRigUnit_SimBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              TargetValue;                                                // 0x0010   (0x0010)  
	FQuat                                              InitialValue;                                               // 0x0020   (0x0010)  
	float                                              Blend;                                                      // 0x0030   (0x0004)  
	bool                                               bIntegrateDeltaTime;                                        // 0x0034   (0x0001)  
	unsigned char                                      UnknownData01_5[0xB];                                       // 0x0035   (0x000B)  MISSED
	FQuat                                              Result;                                                     // 0x0040   (0x0010)  
	FQuat                                              AccumulatedValue;                                           // 0x0050   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_AccumulateVectorLerp
/// Size: 0x0038 (0x000008 - 0x000040)
struct FRigUnit_AccumulateVectorLerp : FRigUnit_SimBase
{ 
	FVector                                            TargetValue;                                                // 0x0008   (0x000C)  
	FVector                                            InitialValue;                                               // 0x0014   (0x000C)  
	float                                              Blend;                                                      // 0x0020   (0x0004)  
	bool                                               bIntegrateDeltaTime;                                        // 0x0024   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0025   (0x0003)  MISSED
	FVector                                            Result;                                                     // 0x0028   (0x000C)  
	FVector                                            AccumulatedValue;                                           // 0x0034   (0x000C)  
};

/// Struct /Script/ControlRig.RigUnit_AccumulateFloatLerp
/// Size: 0x0018 (0x000008 - 0x000020)
struct FRigUnit_AccumulateFloatLerp : FRigUnit_SimBase
{ 
	float                                              TargetValue;                                                // 0x0008   (0x0004)  
	float                                              InitialValue;                                               // 0x000C   (0x0004)  
	float                                              Blend;                                                      // 0x0010   (0x0004)  
	bool                                               bIntegrateDeltaTime;                                        // 0x0014   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0015   (0x0003)  MISSED
	float                                              Result;                                                     // 0x0018   (0x0004)  
	float                                              AccumulatedValue;                                           // 0x001C   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_AccumulateTransformMul
/// Size: 0x00D8 (0x000008 - 0x0000E0)
struct FRigUnit_AccumulateTransformMul : FRigUnit_SimBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FTransform                                         Multiplier;                                                 // 0x0010   (0x0030)  
	FTransform                                         InitialValue;                                               // 0x0040   (0x0030)  
	bool                                               bFlipOrder;                                                 // 0x0070   (0x0001)  
	bool                                               bIntegrateDeltaTime;                                        // 0x0071   (0x0001)  
	unsigned char                                      UnknownData01_5[0xE];                                       // 0x0072   (0x000E)  MISSED
	FTransform                                         Result;                                                     // 0x0080   (0x0030)  
	FTransform                                         AccumulatedValue;                                           // 0x00B0   (0x0030)  
};

/// Struct /Script/ControlRig.RigUnit_AccumulateQuatMul
/// Size: 0x0058 (0x000008 - 0x000060)
struct FRigUnit_AccumulateQuatMul : FRigUnit_SimBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              Multiplier;                                                 // 0x0010   (0x0010)  
	FQuat                                              InitialValue;                                               // 0x0020   (0x0010)  
	bool                                               bFlipOrder;                                                 // 0x0030   (0x0001)  
	bool                                               bIntegrateDeltaTime;                                        // 0x0031   (0x0001)  
	unsigned char                                      UnknownData01_5[0xE];                                       // 0x0032   (0x000E)  MISSED
	FQuat                                              Result;                                                     // 0x0040   (0x0010)  
	FQuat                                              AccumulatedValue;                                           // 0x0050   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_AccumulateVectorMul
/// Size: 0x0038 (0x000008 - 0x000040)
struct FRigUnit_AccumulateVectorMul : FRigUnit_SimBase
{ 
	FVector                                            Multiplier;                                                 // 0x0008   (0x000C)  
	FVector                                            InitialValue;                                               // 0x0014   (0x000C)  
	bool                                               bIntegrateDeltaTime;                                        // 0x0020   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0021   (0x0003)  MISSED
	FVector                                            Result;                                                     // 0x0024   (0x000C)  
	FVector                                            AccumulatedValue;                                           // 0x0030   (0x000C)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x003C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_AccumulateFloatMul
/// Size: 0x0018 (0x000008 - 0x000020)
struct FRigUnit_AccumulateFloatMul : FRigUnit_SimBase
{ 
	float                                              Multiplier;                                                 // 0x0008   (0x0004)  
	float                                              InitialValue;                                               // 0x000C   (0x0004)  
	bool                                               bIntegrateDeltaTime;                                        // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0011   (0x0003)  MISSED
	float                                              Result;                                                     // 0x0014   (0x0004)  
	float                                              AccumulatedValue;                                           // 0x0018   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_AccumulateVectorAdd
/// Size: 0x0038 (0x000008 - 0x000040)
struct FRigUnit_AccumulateVectorAdd : FRigUnit_SimBase
{ 
	FVector                                            Increment;                                                  // 0x0008   (0x000C)  
	FVector                                            InitialValue;                                               // 0x0014   (0x000C)  
	bool                                               bIntegrateDeltaTime;                                        // 0x0020   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0021   (0x0003)  MISSED
	FVector                                            Result;                                                     // 0x0024   (0x000C)  
	FVector                                            AccumulatedValue;                                           // 0x0030   (0x000C)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x003C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_AccumulateFloatAdd
/// Size: 0x0018 (0x000008 - 0x000020)
struct FRigUnit_AccumulateFloatAdd : FRigUnit_SimBase
{ 
	float                                              Increment;                                                  // 0x0008   (0x0004)  
	float                                              InitialValue;                                               // 0x000C   (0x0004)  
	bool                                               bIntegrateDeltaTime;                                        // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0011   (0x0003)  MISSED
	float                                              Result;                                                     // 0x0014   (0x0004)  
	float                                              AccumulatedValue;                                           // 0x0018   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_AddBoneTransform
/// Size: 0x0058 (0x000068 - 0x0000C0)
struct FRigUnit_AddBoneTransform : FRigUnitMutable
{ 
	FName                                              Bone;                                                       // 0x0068   (0x0008)  
	FTransform                                         Transform;                                                  // 0x0070   (0x0030)  
	float                                              Weight;                                                     // 0x00A0   (0x0004)  
	bool                                               bPostMultiply;                                              // 0x00A4   (0x0001)  
	bool                                               bPropagateToChildren;                                       // 0x00A5   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x00A6   (0x0002)  MISSED
	FCachedRigElement                                  CachedBone;                                                 // 0x00A8   (0x0014)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x00BC   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_HighlevelBaseMutable
/// Size: 0x0000 (0x000068 - 0x000068)
struct FRigUnit_HighlevelBaseMutable : FRigUnitMutable
{ 
};

/// Struct /Script/ControlRig.RigUnit_AimItem
/// Size: 0x00E8 (0x000068 - 0x000150)
struct FRigUnit_AimItem : FRigUnit_HighlevelBaseMutable
{ 
	FRigElementKey                                     Item;                                                       // 0x0068   (0x000C)  
	FRigUnit_AimItem_Target                            Primary;                                                    // 0x0074   (0x002C)  
	FRigUnit_AimItem_Target                            Secondary;                                                  // 0x00A0   (0x002C)  
	float                                              Weight;                                                     // 0x00CC   (0x0004)  
	FRigUnit_AimBone_DebugSettings                     DebugSettings;                                              // 0x00D0   (0x0040)  
	FCachedRigElement                                  CachedItem;                                                 // 0x0110   (0x0014)  
	FCachedRigElement                                  PrimaryCachedSpace;                                         // 0x0124   (0x0014)  
	FCachedRigElement                                  SecondaryCachedSpace;                                       // 0x0138   (0x0014)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x014C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_AimBone_DebugSettings
/// Size: 0x0040 (0x000000 - 0x000040)
struct FRigUnit_AimBone_DebugSettings
{ 
	bool                                               bEnabled;                                                   // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	float                                              Scale;                                                      // 0x0004   (0x0004)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x0008   (0x0008)  MISSED
	FTransform                                         WorldOffset;                                                // 0x0010   (0x0030)  
};

/// Struct /Script/ControlRig.RigUnit_AimItem_Target
/// Size: 0x002C (0x000000 - 0x00002C)
struct FRigUnit_AimItem_Target
{ 
	float                                              Weight;                                                     // 0x0000   (0x0004)  
	FVector                                            Axis;                                                       // 0x0004   (0x000C)  
	FVector                                            Target;                                                     // 0x0010   (0x000C)  
	EControlRigVectorKind                              Kind;                                                       // 0x001C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x001D   (0x0003)  MISSED
	FRigElementKey                                     Space;                                                      // 0x0020   (0x000C)  
};

/// Struct /Script/ControlRig.RigUnit_AimBone
/// Size: 0x00E8 (0x000068 - 0x000150)
struct FRigUnit_AimBone : FRigUnit_HighlevelBaseMutable
{ 
	FName                                              Bone;                                                       // 0x0068   (0x0008)  
	FRigUnit_AimBone_Target                            Primary;                                                    // 0x0070   (0x0028)  
	FRigUnit_AimBone_Target                            Secondary;                                                  // 0x0098   (0x0028)  
	float                                              Weight;                                                     // 0x00C0   (0x0004)  
	bool                                               bPropagateToChildren;                                       // 0x00C4   (0x0001)  
	unsigned char                                      UnknownData00_5[0xB];                                       // 0x00C5   (0x000B)  MISSED
	FRigUnit_AimBone_DebugSettings                     DebugSettings;                                              // 0x00D0   (0x0040)  
	FCachedRigElement                                  CachedBoneIndex;                                            // 0x0110   (0x0014)  
	FCachedRigElement                                  PrimaryCachedSpace;                                         // 0x0124   (0x0014)  
	FCachedRigElement                                  SecondaryCachedSpace;                                       // 0x0138   (0x0014)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x014C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_AimBone_Target
/// Size: 0x0028 (0x000000 - 0x000028)
struct FRigUnit_AimBone_Target
{ 
	float                                              Weight;                                                     // 0x0000   (0x0004)  
	FVector                                            Axis;                                                       // 0x0004   (0x000C)  
	FVector                                            Target;                                                     // 0x0010   (0x000C)  
	EControlRigVectorKind                              Kind;                                                       // 0x001C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x001D   (0x0003)  MISSED
	FName                                              Space;                                                      // 0x0020   (0x0008)  
};

/// Struct /Script/ControlRig.RigUnit_HighlevelBase
/// Size: 0x0000 (0x000008 - 0x000008)
struct FRigUnit_HighlevelBase : FRigUnit
{ 
};

/// Struct /Script/ControlRig.RigUnit_AimBoneMath
/// Size: 0x0138 (0x000008 - 0x000140)
struct FRigUnit_AimBoneMath : FRigUnit_HighlevelBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FTransform                                         InputTransform;                                             // 0x0010   (0x0030)  
	FRigUnit_AimItem_Target                            Primary;                                                    // 0x0040   (0x002C)  
	FRigUnit_AimItem_Target                            Secondary;                                                  // 0x006C   (0x002C)  
	float                                              Weight;                                                     // 0x0098   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x009C   (0x0004)  MISSED
	FTransform                                         Result;                                                     // 0x00A0   (0x0030)  
	FRigUnit_AimBone_DebugSettings                     DebugSettings;                                              // 0x00D0   (0x0040)  
	FCachedRigElement                                  PrimaryCachedSpace;                                         // 0x0110   (0x0014)  
	FCachedRigElement                                  SecondaryCachedSpace;                                       // 0x0124   (0x0014)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x0138   (0x0008)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_AimConstraint
/// Size: 0x0058 (0x000068 - 0x0000C0)
struct FRigUnit_AimConstraint : FRigUnitMutable
{ 
	FName                                              Joint;                                                      // 0x0068   (0x0008)  
	EAimMode                                           AimMode;                                                    // 0x0070   (0x0001)  
	EAimMode                                           UpMode;                                                     // 0x0071   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0072   (0x0002)  MISSED
	FVector                                            AimVector;                                                  // 0x0074   (0x000C)  
	FVector                                            UpVector;                                                   // 0x0080   (0x000C)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x008C   (0x0004)  MISSED
	TArray<FAimTarget>                                 AimTargets;                                                 // 0x0090   (0x0010)  
	TArray<FAimTarget>                                 UpTargets;                                                  // 0x00A0   (0x0010)  
	FRigUnit_AimConstraint_WorkData                    WorkData;                                                   // 0x00B0   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_AimConstraint_WorkData
/// Size: 0x0010 (0x000000 - 0x000010)
struct FRigUnit_AimConstraint_WorkData
{ 
	TArray<FConstraintData>                            ConstraintData;                                             // 0x0000   (0x0010)  
};

/// Struct /Script/ControlRig.AimTarget
/// Size: 0x0050 (0x000000 - 0x000050)
struct FAimTarget
{ 
	float                                              Weight;                                                     // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0xC];                                       // 0x0004   (0x000C)  MISSED
	FTransform                                         Transform;                                                  // 0x0010   (0x0030)  
	FVector                                            AlignVector;                                                // 0x0040   (0x000C)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x004C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_AlphaInterpVector
/// Size: 0x0080 (0x000008 - 0x000088)
struct FRigUnit_AlphaInterpVector : FRigUnit_SimBase
{ 
	FVector                                            Value;                                                      // 0x0008   (0x000C)  
	float                                              Scale;                                                      // 0x0014   (0x0004)  
	float                                              Bias;                                                       // 0x0018   (0x0004)  
	bool                                               bMapRange;                                                  // 0x001C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x001D   (0x0003)  MISSED
	FInputRange                                        InRange;                                                    // 0x0020   (0x0008)  
	FInputRange                                        OutRange;                                                   // 0x0028   (0x0008)  
	bool                                               bClampResult;                                               // 0x0030   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0031   (0x0003)  MISSED
	float                                              ClampMin;                                                   // 0x0034   (0x0004)  
	float                                              ClampMax;                                                   // 0x0038   (0x0004)  
	bool                                               bInterpResult;                                              // 0x003C   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x003D   (0x0003)  MISSED
	float                                              InterpSpeedIncreasing;                                      // 0x0040   (0x0004)  
	float                                              InterpSpeedDecreasing;                                      // 0x0044   (0x0004)  
	FVector                                            Result;                                                     // 0x0048   (0x000C)  
	FInputScaleBiasClamp                               ScaleBiasClamp;                                             // 0x0054   (0x0030)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x0084   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_AlphaInterp
/// Size: 0x0070 (0x000008 - 0x000078)
struct FRigUnit_AlphaInterp : FRigUnit_SimBase
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	float                                              Scale;                                                      // 0x000C   (0x0004)  
	float                                              Bias;                                                       // 0x0010   (0x0004)  
	bool                                               bMapRange;                                                  // 0x0014   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0015   (0x0003)  MISSED
	FInputRange                                        InRange;                                                    // 0x0018   (0x0008)  
	FInputRange                                        OutRange;                                                   // 0x0020   (0x0008)  
	bool                                               bClampResult;                                               // 0x0028   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0029   (0x0003)  MISSED
	float                                              ClampMin;                                                   // 0x002C   (0x0004)  
	float                                              ClampMax;                                                   // 0x0030   (0x0004)  
	bool                                               bInterpResult;                                              // 0x0034   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0035   (0x0003)  MISSED
	float                                              InterpSpeedIncreasing;                                      // 0x0038   (0x0004)  
	float                                              InterpSpeedDecreasing;                                      // 0x003C   (0x0004)  
	float                                              Result;                                                     // 0x0040   (0x0004)  
	FInputScaleBiasClamp                               ScaleBiasClamp;                                             // 0x0044   (0x0030)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x0074   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_AnimBase
/// Size: 0x0000 (0x000008 - 0x000008)
struct FRigUnit_AnimBase : FRigUnit
{ 
};

/// Struct /Script/ControlRig.RigUnit_AnimEasing
/// Size: 0x0020 (0x000008 - 0x000028)
struct FRigUnit_AnimEasing : FRigUnit_AnimBase
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	EControlRigAnimEasingType                          Type;                                                       // 0x000C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x000D   (0x0003)  MISSED
	float                                              SourceMinimum;                                              // 0x0010   (0x0004)  
	float                                              SourceMaximum;                                              // 0x0014   (0x0004)  
	float                                              TargetMinimum;                                              // 0x0018   (0x0004)  
	float                                              TargetMaximum;                                              // 0x001C   (0x0004)  
	float                                              Result;                                                     // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_AnimEasingType
/// Size: 0x0008 (0x000008 - 0x000010)
struct FRigUnit_AnimEasingType : FRigUnit_AnimBase
{ 
	EControlRigAnimEasingType                          Type;                                                       // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_AnimEvalRichCurve
/// Size: 0x00A8 (0x000008 - 0x0000B0)
struct FRigUnit_AnimEvalRichCurve : FRigUnit_AnimBase
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	FRuntimeFloatCurve                                 Curve;                                                      // 0x0010   (0x0088)  
	float                                              SourceMinimum;                                              // 0x0098   (0x0004)  
	float                                              SourceMaximum;                                              // 0x009C   (0x0004)  
	float                                              TargetMinimum;                                              // 0x00A0   (0x0004)  
	float                                              TargetMaximum;                                              // 0x00A4   (0x0004)  
	float                                              Result;                                                     // 0x00A8   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x00AC   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_AnimRichCurve
/// Size: 0x0088 (0x000008 - 0x000090)
struct FRigUnit_AnimRichCurve : FRigUnit_AnimBase
{ 
	FRuntimeFloatCurve                                 Curve;                                                      // 0x0008   (0x0088)  
};

/// Struct /Script/ControlRig.RigUnit_ApplyFK
/// Size: 0x0088 (0x000068 - 0x0000F0)
struct FRigUnit_ApplyFK : FRigUnitMutable
{ 
	FName                                              Joint;                                                      // 0x0068   (0x0008)  
	FTransform                                         Transform;                                                  // 0x0070   (0x0030)  
	FTransformFilter                                   Filter;                                                     // 0x00A0   (0x0009)  
	EApplyTransformMode                                ApplyTransformMode;                                         // 0x00A9   (0x0001)  
	ETransformSpaceMode                                ApplyTransformSpace;                                        // 0x00AA   (0x0001)  
	unsigned char                                      UnknownData00_5[0x5];                                       // 0x00AB   (0x0005)  MISSED
	FTransform                                         BaseTransform;                                              // 0x00B0   (0x0030)  
	FName                                              BaseJoint;                                                  // 0x00E0   (0x0008)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x00E8   (0x0008)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_BeginExecution
/// Size: 0x0060 (0x000008 - 0x000068)
struct FRigUnit_BeginExecution : FRigUnit
{ 
	FControlRigExecuteContext                          ExecuteContext;                                             // 0x0008   (0x0060)  
};

/// Struct /Script/ControlRig.RigUnit_BlendTransform
/// Size: 0x0078 (0x000008 - 0x000080)
struct FRigUnit_BlendTransform : FRigUnit
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FTransform                                         Source;                                                     // 0x0010   (0x0030)  
	TArray<FBlendTarget>                               Targets;                                                    // 0x0040   (0x0010)  
	FTransform                                         Result;                                                     // 0x0050   (0x0030)  
};

/// Struct /Script/ControlRig.BlendTarget
/// Size: 0x0040 (0x000000 - 0x000040)
struct FBlendTarget
{ 
	FTransform                                         Transform;                                                  // 0x0000   (0x0030)  
	float                                              Weight;                                                     // 0x0030   (0x0004)  
	unsigned char                                      UnknownData00_6[0xC];                                       // 0x0034   (0x000C)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_ItemHarmonics
/// Size: 0x0080 (0x000068 - 0x0000E8)
struct FRigUnit_ItemHarmonics : FRigUnit_HighlevelBaseMutable
{ 
	TArray<FRigUnit_Harmonics_TargetItem>              Targets;                                                    // 0x0068   (0x0010)  
	FVector                                            WaveSpeed;                                                  // 0x0078   (0x000C)  
	FVector                                            WaveFrequency;                                              // 0x0084   (0x000C)  
	FVector                                            WaveAmplitude;                                              // 0x0090   (0x000C)  
	FVector                                            WaveOffset;                                                 // 0x009C   (0x000C)  
	FVector                                            WaveNoise;                                                  // 0x00A8   (0x000C)  
	EControlRigAnimEasingType                          WaveEase;                                                   // 0x00B4   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x00B5   (0x0003)  MISSED
	float                                              WaveMinimum;                                                // 0x00B8   (0x0004)  
	float                                              WaveMaximum;                                                // 0x00BC   (0x0004)  
	EControlRigRotationOrder                           RotationOrder;                                              // 0x00C0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x00C1   (0x0007)  MISSED
	FRigUnit_BoneHarmonics_WorkData                    WorkData;                                                   // 0x00C8   (0x0020)  
};

/// Struct /Script/ControlRig.RigUnit_BoneHarmonics_WorkData
/// Size: 0x0020 (0x000000 - 0x000020)
struct FRigUnit_BoneHarmonics_WorkData
{ 
	TArray<FCachedRigElement>                          CachedItems;                                                // 0x0000   (0x0010)  
	FVector                                            WaveTime;                                                   // 0x0010   (0x000C)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_Harmonics_TargetItem
/// Size: 0x0010 (0x000000 - 0x000010)
struct FRigUnit_Harmonics_TargetItem
{ 
	FRigElementKey                                     Item;                                                       // 0x0000   (0x000C)  
	float                                              Ratio;                                                      // 0x000C   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_BoneHarmonics
/// Size: 0x0080 (0x000068 - 0x0000E8)
struct FRigUnit_BoneHarmonics : FRigUnit_HighlevelBaseMutable
{ 
	TArray<FRigUnit_BoneHarmonics_BoneTarget>          Bones;                                                      // 0x0068   (0x0010)  
	FVector                                            WaveSpeed;                                                  // 0x0078   (0x000C)  
	FVector                                            WaveFrequency;                                              // 0x0084   (0x000C)  
	FVector                                            WaveAmplitude;                                              // 0x0090   (0x000C)  
	FVector                                            WaveOffset;                                                 // 0x009C   (0x000C)  
	FVector                                            WaveNoise;                                                  // 0x00A8   (0x000C)  
	EControlRigAnimEasingType                          WaveEase;                                                   // 0x00B4   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x00B5   (0x0003)  MISSED
	float                                              WaveMinimum;                                                // 0x00B8   (0x0004)  
	float                                              WaveMaximum;                                                // 0x00BC   (0x0004)  
	EControlRigRotationOrder                           RotationOrder;                                              // 0x00C0   (0x0001)  
	bool                                               bPropagateToChildren;                                       // 0x00C1   (0x0001)  
	unsigned char                                      UnknownData01_5[0x6];                                       // 0x00C2   (0x0006)  MISSED
	FRigUnit_BoneHarmonics_WorkData                    WorkData;                                                   // 0x00C8   (0x0020)  
};

/// Struct /Script/ControlRig.RigUnit_BoneHarmonics_BoneTarget
/// Size: 0x000C (0x000000 - 0x00000C)
struct FRigUnit_BoneHarmonics_BoneTarget
{ 
	FName                                              Bone;                                                       // 0x0000   (0x0008)  
	float                                              Ratio;                                                      // 0x0008   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_ControlName
/// Size: 0x0008 (0x000008 - 0x000010)
struct FRigUnit_ControlName : FRigUnit
{ 
	FName                                              Control;                                                    // 0x0008   (0x0008)  
};

/// Struct /Script/ControlRig.RigUnit_SpaceName
/// Size: 0x0008 (0x000008 - 0x000010)
struct FRigUnit_SpaceName : FRigUnit
{ 
	FName                                              Space;                                                      // 0x0008   (0x0008)  
};

/// Struct /Script/ControlRig.RigUnit_BoneName
/// Size: 0x0008 (0x000008 - 0x000010)
struct FRigUnit_BoneName : FRigUnit
{ 
	FName                                              Bone;                                                       // 0x0008   (0x0008)  
};

/// Struct /Script/ControlRig.RigUnit_Item
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_Item : FRigUnit
{ 
	FRigElementKey                                     Item;                                                       // 0x0008   (0x000C)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_CCDIKPerItem
/// Size: 0x00D8 (0x000068 - 0x000140)
struct FRigUnit_CCDIKPerItem : FRigUnit_HighlevelBaseMutable
{ 
	FRigElementKeyCollection                           Items;                                                      // 0x0068   (0x0010)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0078   (0x0008)  MISSED
	FTransform                                         EffectorTransform;                                          // 0x0080   (0x0030)  
	float                                              Precision;                                                  // 0x00B0   (0x0004)  
	float                                              Weight;                                                     // 0x00B4   (0x0004)  
	int32_t                                            MaxIterations;                                              // 0x00B8   (0x0004)  
	bool                                               bStartFromTail;                                             // 0x00BC   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x00BD   (0x0003)  MISSED
	float                                              BaseRotationLimit;                                          // 0x00C0   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x00C4   (0x0004)  MISSED
	TArray<FRigUnit_CCDIK_RotationLimitPerItem>        RotationLimits;                                             // 0x00C8   (0x0010)  
	bool                                               bPropagateToChildren;                                       // 0x00D8   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x00D9   (0x0007)  MISSED
	FRigUnit_CCDIK_WorkData                            WorkData;                                                   // 0x00E0   (0x0058)  
	unsigned char                                      UnknownData04_6[0x8];                                       // 0x0138   (0x0008)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_CCDIK_WorkData
/// Size: 0x0058 (0x000000 - 0x000058)
struct FRigUnit_CCDIK_WorkData
{ 
	TArray<FCCDIKChainLink>                            Chain;                                                      // 0x0000   (0x0010)  
	TArray<FCachedRigElement>                          CachedItems;                                                // 0x0010   (0x0010)  
	TArray<int32_t>                                    RotationLimitIndex;                                         // 0x0020   (0x0010)  
	TArray<float>                                      RotationLimitsPerItem;                                      // 0x0030   (0x0010)  
	FCachedRigElement                                  CachedEffector;                                             // 0x0040   (0x0014)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0054   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_CCDIK_RotationLimitPerItem
/// Size: 0x0010 (0x000000 - 0x000010)
struct FRigUnit_CCDIK_RotationLimitPerItem
{ 
	FRigElementKey                                     Item;                                                       // 0x0000   (0x000C)  
	float                                              Limit;                                                      // 0x000C   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_CCDIK
/// Size: 0x00D8 (0x000068 - 0x000140)
struct FRigUnit_CCDIK : FRigUnit_HighlevelBaseMutable
{ 
	FName                                              StartBone;                                                  // 0x0068   (0x0008)  
	FName                                              EffectorBone;                                               // 0x0070   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0078   (0x0008)  MISSED
	FTransform                                         EffectorTransform;                                          // 0x0080   (0x0030)  
	float                                              Precision;                                                  // 0x00B0   (0x0004)  
	float                                              Weight;                                                     // 0x00B4   (0x0004)  
	int32_t                                            MaxIterations;                                              // 0x00B8   (0x0004)  
	bool                                               bStartFromTail;                                             // 0x00BC   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x00BD   (0x0003)  MISSED
	float                                              BaseRotationLimit;                                          // 0x00C0   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x00C4   (0x0004)  MISSED
	TArray<FRigUnit_CCDIK_RotationLimit>               RotationLimits;                                             // 0x00C8   (0x0010)  
	bool                                               bPropagateToChildren;                                       // 0x00D8   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x00D9   (0x0007)  MISSED
	FRigUnit_CCDIK_WorkData                            WorkData;                                                   // 0x00E0   (0x0058)  
	unsigned char                                      UnknownData04_6[0x8];                                       // 0x0138   (0x0008)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_CCDIK_RotationLimit
/// Size: 0x000C (0x000000 - 0x00000C)
struct FRigUnit_CCDIK_RotationLimit
{ 
	FName                                              Bone;                                                       // 0x0000   (0x0008)  
	float                                              Limit;                                                      // 0x0008   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_ChainHarmonicsPerItem
/// Size: 0x0208 (0x000068 - 0x000270)
struct FRigUnit_ChainHarmonicsPerItem : FRigUnit_HighlevelBaseMutable
{ 
	FRigElementKey                                     ChainRoot;                                                  // 0x0068   (0x000C)  
	FVector                                            Speed;                                                      // 0x0074   (0x000C)  
	FRigUnit_ChainHarmonics_Reach                      Reach;                                                      // 0x0080   (0x0028)  
	FRigUnit_ChainHarmonics_Wave                       Wave;                                                       // 0x00A8   (0x0040)  
	FRuntimeFloatCurve                                 WaveCurve;                                                  // 0x00E8   (0x0088)  
	FRigUnit_ChainHarmonics_Pendulum                   Pendulum;                                                   // 0x0170   (0x003C)  
	bool                                               bDrawDebug;                                                 // 0x01AC   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x01AD   (0x0003)  MISSED
	FTransform                                         DrawWorldOffset;                                            // 0x01B0   (0x0030)  
	FRigUnit_ChainHarmonics_WorkData                   WorkData;                                                   // 0x01E0   (0x0090)  
};

/// Struct /Script/ControlRig.RigUnit_ChainHarmonics_WorkData
/// Size: 0x0090 (0x000000 - 0x000090)
struct FRigUnit_ChainHarmonics_WorkData
{ 
	FVector                                            Time;                                                       // 0x0000   (0x000C)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<FCachedRigElement>                          Items;                                                      // 0x0010   (0x0010)  
	TArray<float>                                      Ratio;                                                      // 0x0020   (0x0010)  
	TArray<FVector>                                    LocalTip;                                                   // 0x0030   (0x0010)  
	TArray<FVector>                                    PendulumTip;                                                // 0x0040   (0x0010)  
	TArray<FVector>                                    PendulumPosition;                                           // 0x0050   (0x0010)  
	TArray<FVector>                                    PendulumVelocity;                                           // 0x0060   (0x0010)  
	TArray<FVector>                                    HierarchyLine;                                              // 0x0070   (0x0010)  
	TArray<FVector>                                    VelocityLines;                                              // 0x0080   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_ChainHarmonics_Pendulum
/// Size: 0x003C (0x000000 - 0x00003C)
struct FRigUnit_ChainHarmonics_Pendulum
{ 
	bool                                               bEnabled;                                                   // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	float                                              PendulumStiffness;                                          // 0x0004   (0x0004)  
	FVector                                            PendulumGravity;                                            // 0x0008   (0x000C)  
	float                                              PendulumBlend;                                              // 0x0014   (0x0004)  
	float                                              PendulumDrag;                                               // 0x0018   (0x0004)  
	float                                              PendulumMinimum;                                            // 0x001C   (0x0004)  
	float                                              PendulumMaximum;                                            // 0x0020   (0x0004)  
	EControlRigAnimEasingType                          PendulumEase;                                               // 0x0024   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0025   (0x0003)  MISSED
	FVector                                            UnwindAxis;                                                 // 0x0028   (0x000C)  
	float                                              UnwindMinimum;                                              // 0x0034   (0x0004)  
	float                                              UnwindMaximum;                                              // 0x0038   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_ChainHarmonics_Wave
/// Size: 0x0040 (0x000000 - 0x000040)
struct FRigUnit_ChainHarmonics_Wave
{ 
	bool                                               bEnabled;                                                   // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	FVector                                            WaveFrequency;                                              // 0x0004   (0x000C)  
	FVector                                            WaveAmplitude;                                              // 0x0010   (0x000C)  
	FVector                                            WaveOffset;                                                 // 0x001C   (0x000C)  
	FVector                                            WaveNoise;                                                  // 0x0028   (0x000C)  
	float                                              WaveMinimum;                                                // 0x0034   (0x0004)  
	float                                              WaveMaximum;                                                // 0x0038   (0x0004)  
	EControlRigAnimEasingType                          WaveEase;                                                   // 0x003C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x003D   (0x0003)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_ChainHarmonics_Reach
/// Size: 0x0028 (0x000000 - 0x000028)
struct FRigUnit_ChainHarmonics_Reach
{ 
	bool                                               bEnabled;                                                   // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	FVector                                            ReachTarget;                                                // 0x0004   (0x000C)  
	FVector                                            ReachAxis;                                                  // 0x0010   (0x000C)  
	float                                              ReachMinimum;                                               // 0x001C   (0x0004)  
	float                                              ReachMaximum;                                               // 0x0020   (0x0004)  
	EControlRigAnimEasingType                          ReachEase;                                                  // 0x0024   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0025   (0x0003)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_ChainHarmonics
/// Size: 0x0208 (0x000068 - 0x000270)
struct FRigUnit_ChainHarmonics : FRigUnit_HighlevelBaseMutable
{ 
	FName                                              ChainRoot;                                                  // 0x0068   (0x0008)  
	FVector                                            Speed;                                                      // 0x0070   (0x000C)  
	FRigUnit_ChainHarmonics_Reach                      Reach;                                                      // 0x007C   (0x0028)  
	FRigUnit_ChainHarmonics_Wave                       Wave;                                                       // 0x00A4   (0x0040)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x00E4   (0x0004)  MISSED
	FRuntimeFloatCurve                                 WaveCurve;                                                  // 0x00E8   (0x0088)  
	FRigUnit_ChainHarmonics_Pendulum                   Pendulum;                                                   // 0x0170   (0x003C)  
	bool                                               bDrawDebug;                                                 // 0x01AC   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x01AD   (0x0003)  MISSED
	FTransform                                         DrawWorldOffset;                                            // 0x01B0   (0x0030)  
	FRigUnit_ChainHarmonics_WorkData                   WorkData;                                                   // 0x01E0   (0x0090)  
};

/// Struct /Script/ControlRig.RigUnit_CollectionBaseMutable
/// Size: 0x0000 (0x000068 - 0x000068)
struct FRigUnit_CollectionBaseMutable : FRigUnitMutable
{ 
};

/// Struct /Script/ControlRig.RigUnit_CollectionLoop
/// Size: 0x0090 (0x000068 - 0x0000F8)
struct FRigUnit_CollectionLoop : FRigUnit_CollectionBaseMutable
{ 
	FRigElementKeyCollection                           Collection;                                                 // 0x0068   (0x0010)  
	FRigElementKey                                     Item;                                                       // 0x0078   (0x000C)  
	int32_t                                            Index;                                                      // 0x0084   (0x0004)  
	int32_t                                            Count;                                                      // 0x0088   (0x0004)  
	float                                              Ratio;                                                      // 0x008C   (0x0004)  
	bool                                               Continue;                                                   // 0x0090   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0091   (0x0007)  MISSED
	FControlRigExecuteContext                          Completed;                                                  // 0x0098   (0x0060)  
};

/// Struct /Script/ControlRig.RigUnit_CollectionBase
/// Size: 0x0000 (0x000008 - 0x000008)
struct FRigUnit_CollectionBase : FRigUnit
{ 
};

/// Struct /Script/ControlRig.RigUnit_CollectionItemAtIndex
/// Size: 0x0020 (0x000008 - 0x000028)
struct FRigUnit_CollectionItemAtIndex : FRigUnit_CollectionBase
{ 
	FRigElementKeyCollection                           Collection;                                                 // 0x0008   (0x0010)  
	int32_t                                            Index;                                                      // 0x0018   (0x0004)  
	FRigElementKey                                     Item;                                                       // 0x001C   (0x000C)  
};

/// Struct /Script/ControlRig.RigUnit_CollectionCount
/// Size: 0x0018 (0x000008 - 0x000020)
struct FRigUnit_CollectionCount : FRigUnit_CollectionBase
{ 
	FRigElementKeyCollection                           Collection;                                                 // 0x0008   (0x0010)  
	int32_t                                            Count;                                                      // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_CollectionReverse
/// Size: 0x0020 (0x000008 - 0x000028)
struct FRigUnit_CollectionReverse : FRigUnit_CollectionBase
{ 
	FRigElementKeyCollection                           Collection;                                                 // 0x0008   (0x0010)  
	FRigElementKeyCollection                           Reversed;                                                   // 0x0018   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_CollectionDifference
/// Size: 0x0030 (0x000008 - 0x000038)
struct FRigUnit_CollectionDifference : FRigUnit_CollectionBase
{ 
	FRigElementKeyCollection                           A;                                                          // 0x0008   (0x0010)  
	FRigElementKeyCollection                           B;                                                          // 0x0018   (0x0010)  
	FRigElementKeyCollection                           Collection;                                                 // 0x0028   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_CollectionIntersection
/// Size: 0x0030 (0x000008 - 0x000038)
struct FRigUnit_CollectionIntersection : FRigUnit_CollectionBase
{ 
	FRigElementKeyCollection                           A;                                                          // 0x0008   (0x0010)  
	FRigElementKeyCollection                           B;                                                          // 0x0018   (0x0010)  
	FRigElementKeyCollection                           Collection;                                                 // 0x0028   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_CollectionUnion
/// Size: 0x0030 (0x000008 - 0x000038)
struct FRigUnit_CollectionUnion : FRigUnit_CollectionBase
{ 
	FRigElementKeyCollection                           A;                                                          // 0x0008   (0x0010)  
	FRigElementKeyCollection                           B;                                                          // 0x0018   (0x0010)  
	FRigElementKeyCollection                           Collection;                                                 // 0x0028   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_CollectionItems
/// Size: 0x0020 (0x000008 - 0x000028)
struct FRigUnit_CollectionItems : FRigUnit_CollectionBase
{ 
	TArray<FRigElementKey>                             Items;                                                      // 0x0008   (0x0010)  
	FRigElementKeyCollection                           Collection;                                                 // 0x0018   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_CollectionReplaceItems
/// Size: 0x0050 (0x000008 - 0x000058)
struct FRigUnit_CollectionReplaceItems : FRigUnit_CollectionBase
{ 
	FRigElementKeyCollection                           Items;                                                      // 0x0008   (0x0010)  
	FName                                              Old;                                                        // 0x0018   (0x0008)  
	FName                                              New;                                                        // 0x0020   (0x0008)  
	bool                                               RemoveInvalidItems;                                         // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0029   (0x0007)  MISSED
	FRigElementKeyCollection                           Collection;                                                 // 0x0030   (0x0010)  
	FRigElementKeyCollection                           CachedCollection;                                           // 0x0040   (0x0010)  
	int32_t                                            CachedHierarchyHash;                                        // 0x0050   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0054   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_CollectionChildren
/// Size: 0x0038 (0x000008 - 0x000040)
struct FRigUnit_CollectionChildren : FRigUnit_CollectionBase
{ 
	FRigElementKey                                     Parent;                                                     // 0x0008   (0x000C)  
	bool                                               bIncludeParent;                                             // 0x0014   (0x0001)  
	bool                                               bRecursive;                                                 // 0x0015   (0x0001)  
	ERigElementType                                    TypeToSearch;                                               // 0x0016   (0x0001)  
	unsigned char                                      UnknownData00_5[0x1];                                       // 0x0017   (0x0001)  MISSED
	FRigElementKeyCollection                           Collection;                                                 // 0x0018   (0x0010)  
	FRigElementKeyCollection                           CachedCollection;                                           // 0x0028   (0x0010)  
	int32_t                                            CachedHierarchyHash;                                        // 0x0038   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x003C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_CollectionNameSearch
/// Size: 0x0038 (0x000008 - 0x000040)
struct FRigUnit_CollectionNameSearch : FRigUnit_CollectionBase
{ 
	FName                                              PartialName;                                                // 0x0008   (0x0008)  
	ERigElementType                                    TypeToSearch;                                               // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0011   (0x0007)  MISSED
	FRigElementKeyCollection                           Collection;                                                 // 0x0018   (0x0010)  
	FRigElementKeyCollection                           CachedCollection;                                           // 0x0028   (0x0010)  
	int32_t                                            CachedHierarchyHash;                                        // 0x0038   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x003C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_CollectionChain
/// Size: 0x0048 (0x000008 - 0x000050)
struct FRigUnit_CollectionChain : FRigUnit_CollectionBase
{ 
	FRigElementKey                                     FirstItem;                                                  // 0x0008   (0x000C)  
	FRigElementKey                                     LastItem;                                                   // 0x0014   (0x000C)  
	bool                                               Reverse;                                                    // 0x0020   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0021   (0x0007)  MISSED
	FRigElementKeyCollection                           Collection;                                                 // 0x0028   (0x0010)  
	FRigElementKeyCollection                           CachedCollection;                                           // 0x0038   (0x0010)  
	int32_t                                            CachedHierarchyHash;                                        // 0x0048   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x004C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_Control
/// Size: 0x00C8 (0x000008 - 0x0000D0)
struct FRigUnit_Control : FRigUnit
{ 
	FEulerTransform                                    Transform;                                                  // 0x0008   (0x0024)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x002C   (0x0004)  MISSED
	FTransform                                         Base;                                                       // 0x0030   (0x0030)  
	FTransform                                         InitTransform;                                              // 0x0060   (0x0030)  
	FTransform                                         Result;                                                     // 0x0090   (0x0030)  
	FTransformFilter                                   Filter;                                                     // 0x00C0   (0x0009)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x00C9   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_Control_StaticMesh
/// Size: 0x0030 (0x0000D0 - 0x000100)
struct FRigUnit_Control_StaticMesh : FRigUnit_Control
{ 
	FTransform                                         MeshTransform;                                              // 0x00D0   (0x0030)  
};

/// Struct /Script/ControlRig.RigUnit_ToSwingAndTwist
/// Size: 0x0048 (0x000008 - 0x000050)
struct FRigUnit_ToSwingAndTwist : FRigUnit
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              Input;                                                      // 0x0010   (0x0010)  
	FVector                                            TwistAxis;                                                  // 0x0020   (0x000C)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x002C   (0x0004)  MISSED
	FQuat                                              Swing;                                                      // 0x0030   (0x0010)  
	FQuat                                              Twist;                                                      // 0x0040   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_ConvertQuaternionToVector
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_ConvertQuaternionToVector : FRigUnit
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              Input;                                                      // 0x0010   (0x0010)  
	FVector                                            Result;                                                     // 0x0020   (0x000C)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_ConvertRotationToVector
/// Size: 0x0018 (0x000008 - 0x000020)
struct FRigUnit_ConvertRotationToVector : FRigUnit
{ 
	FRotator                                           Input;                                                      // 0x0008   (0x000C)  
	FVector                                            Result;                                                     // 0x0014   (0x000C)  
};

/// Struct /Script/ControlRig.RigUnit_ConvertVectorToQuaternion
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_ConvertVectorToQuaternion : FRigUnit
{ 
	FVector                                            Input;                                                      // 0x0008   (0x000C)  
	unsigned char                                      UnknownData00_5[0xC];                                       // 0x0014   (0x000C)  MISSED
	FQuat                                              Result;                                                     // 0x0020   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_ConvertVectorToRotation
/// Size: 0x0018 (0x000008 - 0x000020)
struct FRigUnit_ConvertVectorToRotation : FRigUnit
{ 
	FVector                                            Input;                                                      // 0x0008   (0x000C)  
	FRotator                                           Result;                                                     // 0x0014   (0x000C)  
};

/// Struct /Script/ControlRig.RigUnit_ConvertQuaternion
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_ConvertQuaternion : FRigUnit
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              Input;                                                      // 0x0010   (0x0010)  
	FRotator                                           Result;                                                     // 0x0020   (0x000C)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_ConvertRotation
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_ConvertRotation : FRigUnit
{ 
	FRotator                                           Input;                                                      // 0x0008   (0x000C)  
	unsigned char                                      UnknownData00_5[0xC];                                       // 0x0014   (0x000C)  MISSED
	FQuat                                              Result;                                                     // 0x0020   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_ConvertVectorRotation
/// Size: 0x0000 (0x000030 - 0x000030)
struct FRigUnit_ConvertVectorRotation : FRigUnit_ConvertRotation
{ 
};

/// Struct /Script/ControlRig.RigUnit_ConvertEulerTransform
/// Size: 0x0058 (0x000008 - 0x000060)
struct FRigUnit_ConvertEulerTransform : FRigUnit
{ 
	FEulerTransform                                    Input;                                                      // 0x0008   (0x0024)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x002C   (0x0004)  MISSED
	FTransform                                         Result;                                                     // 0x0030   (0x0030)  
};

/// Struct /Script/ControlRig.RigUnit_ConvertTransform
/// Size: 0x0068 (0x000008 - 0x000070)
struct FRigUnit_ConvertTransform : FRigUnit
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FTransform                                         Input;                                                      // 0x0010   (0x0030)  
	FEulerTransform                                    Result;                                                     // 0x0040   (0x0024)  
	unsigned char                                      UnknownData01_6[0xC];                                       // 0x0064   (0x000C)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DebugBaseMutable
/// Size: 0x0000 (0x000068 - 0x000068)
struct FRigUnit_DebugBaseMutable : FRigUnitMutable
{ 
};

/// Struct /Script/ControlRig.RigUnit_DebugBase
/// Size: 0x0000 (0x000008 - 0x000008)
struct FRigUnit_DebugBase : FRigUnit
{ 
};

/// Struct /Script/ControlRig.RigUnit_DebugBezierItemSpace
/// Size: 0x00A8 (0x000068 - 0x000110)
struct FRigUnit_DebugBezierItemSpace : FRigUnit_DebugBaseMutable
{ 
	FCRFourPointBezier                                 Bezier;                                                     // 0x0068   (0x0030)  
	float                                              MinimumU;                                                   // 0x0098   (0x0004)  
	float                                              MaximumU;                                                   // 0x009C   (0x0004)  
	FLinearColor                                       Color;                                                      // 0x00A0   (0x0010)  
	float                                              Thickness;                                                  // 0x00B0   (0x0004)  
	int32_t                                            Detail;                                                     // 0x00B4   (0x0004)  
	FRigElementKey                                     Space;                                                      // 0x00B8   (0x000C)  
	unsigned char                                      UnknownData00_5[0xC];                                       // 0x00C4   (0x000C)  MISSED
	FTransform                                         WorldOffset;                                                // 0x00D0   (0x0030)  
	bool                                               bEnabled;                                                   // 0x0100   (0x0001)  
	unsigned char                                      UnknownData01_6[0xF];                                       // 0x0101   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DebugBezier
/// Size: 0x0098 (0x000068 - 0x000100)
struct FRigUnit_DebugBezier : FRigUnit_DebugBaseMutable
{ 
	FCRFourPointBezier                                 Bezier;                                                     // 0x0068   (0x0030)  
	float                                              MinimumU;                                                   // 0x0098   (0x0004)  
	float                                              MaximumU;                                                   // 0x009C   (0x0004)  
	FLinearColor                                       Color;                                                      // 0x00A0   (0x0010)  
	float                                              Thickness;                                                  // 0x00B0   (0x0004)  
	int32_t                                            Detail;                                                     // 0x00B4   (0x0004)  
	FName                                              Space;                                                      // 0x00B8   (0x0008)  
	FTransform                                         WorldOffset;                                                // 0x00C0   (0x0030)  
	bool                                               bEnabled;                                                   // 0x00F0   (0x0001)  
	unsigned char                                      UnknownData00_6[0xF];                                       // 0x00F1   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DebugHierarchy
/// Size: 0x0058 (0x000068 - 0x0000C0)
struct FRigUnit_DebugHierarchy : FRigUnit_DebugBaseMutable
{ 
	float                                              Scale;                                                      // 0x0068   (0x0004)  
	FLinearColor                                       Color;                                                      // 0x006C   (0x0010)  
	float                                              Thickness;                                                  // 0x007C   (0x0004)  
	FTransform                                         WorldOffset;                                                // 0x0080   (0x0030)  
	bool                                               bEnabled;                                                   // 0x00B0   (0x0001)  
	unsigned char                                      UnknownData00_6[0xF];                                       // 0x00B1   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DebugLineItemSpace
/// Size: 0x0078 (0x000068 - 0x0000E0)
struct FRigUnit_DebugLineItemSpace : FRigUnit_DebugBaseMutable
{ 
	FVector                                            A;                                                          // 0x0068   (0x000C)  
	FVector                                            B;                                                          // 0x0074   (0x000C)  
	FLinearColor                                       Color;                                                      // 0x0080   (0x0010)  
	float                                              Thickness;                                                  // 0x0090   (0x0004)  
	FRigElementKey                                     Space;                                                      // 0x0094   (0x000C)  
	FTransform                                         WorldOffset;                                                // 0x00A0   (0x0030)  
	bool                                               bEnabled;                                                   // 0x00D0   (0x0001)  
	unsigned char                                      UnknownData00_6[0xF];                                       // 0x00D1   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DebugLine
/// Size: 0x0078 (0x000068 - 0x0000E0)
struct FRigUnit_DebugLine : FRigUnit_DebugBaseMutable
{ 
	FVector                                            A;                                                          // 0x0068   (0x000C)  
	FVector                                            B;                                                          // 0x0074   (0x000C)  
	FLinearColor                                       Color;                                                      // 0x0080   (0x0010)  
	float                                              Thickness;                                                  // 0x0090   (0x0004)  
	FName                                              Space;                                                      // 0x0094   (0x0008)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x009C   (0x0004)  MISSED
	FTransform                                         WorldOffset;                                                // 0x00A0   (0x0030)  
	bool                                               bEnabled;                                                   // 0x00D0   (0x0001)  
	unsigned char                                      UnknownData01_6[0xF];                                       // 0x00D1   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DebugLineStripItemSpace
/// Size: 0x0078 (0x000068 - 0x0000E0)
struct FRigUnit_DebugLineStripItemSpace : FRigUnit_DebugBaseMutable
{ 
	TArray<FVector>                                    Points;                                                     // 0x0068   (0x0010)  
	FLinearColor                                       Color;                                                      // 0x0078   (0x0010)  
	float                                              Thickness;                                                  // 0x0088   (0x0004)  
	FRigElementKey                                     Space;                                                      // 0x008C   (0x000C)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0098   (0x0008)  MISSED
	FTransform                                         WorldOffset;                                                // 0x00A0   (0x0030)  
	bool                                               bEnabled;                                                   // 0x00D0   (0x0001)  
	unsigned char                                      UnknownData01_6[0xF];                                       // 0x00D1   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DebugLineStrip
/// Size: 0x0078 (0x000068 - 0x0000E0)
struct FRigUnit_DebugLineStrip : FRigUnit_DebugBaseMutable
{ 
	TArray<FVector>                                    Points;                                                     // 0x0068   (0x0010)  
	FLinearColor                                       Color;                                                      // 0x0078   (0x0010)  
	float                                              Thickness;                                                  // 0x0088   (0x0004)  
	FName                                              Space;                                                      // 0x008C   (0x0008)  
	unsigned char                                      UnknownData00_5[0xC];                                       // 0x0094   (0x000C)  MISSED
	FTransform                                         WorldOffset;                                                // 0x00A0   (0x0030)  
	bool                                               bEnabled;                                                   // 0x00D0   (0x0001)  
	unsigned char                                      UnknownData01_6[0xF];                                       // 0x00D1   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DebugPointMutable
/// Size: 0x0078 (0x000068 - 0x0000E0)
struct FRigUnit_DebugPointMutable : FRigUnit_DebugBaseMutable
{ 
	FVector                                            Vector;                                                     // 0x0068   (0x000C)  
	ERigUnitDebugPointMode                             Mode;                                                       // 0x0074   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0075   (0x0003)  MISSED
	FLinearColor                                       Color;                                                      // 0x0078   (0x0010)  
	float                                              Scale;                                                      // 0x0088   (0x0004)  
	float                                              Thickness;                                                  // 0x008C   (0x0004)  
	FName                                              Space;                                                      // 0x0090   (0x0008)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x0098   (0x0008)  MISSED
	FTransform                                         WorldOffset;                                                // 0x00A0   (0x0030)  
	bool                                               bEnabled;                                                   // 0x00D0   (0x0001)  
	unsigned char                                      UnknownData02_6[0xF];                                       // 0x00D1   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DebugPoint
/// Size: 0x0078 (0x000008 - 0x000080)
struct FRigUnit_DebugPoint : FRigUnit_DebugBase
{ 
	FVector                                            Vector;                                                     // 0x0008   (0x000C)  
	ERigUnitDebugPointMode                             Mode;                                                       // 0x0014   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0015   (0x0003)  MISSED
	FLinearColor                                       Color;                                                      // 0x0018   (0x0010)  
	float                                              Scale;                                                      // 0x0028   (0x0004)  
	float                                              Thickness;                                                  // 0x002C   (0x0004)  
	FName                                              Space;                                                      // 0x0030   (0x0008)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x0038   (0x0008)  MISSED
	FTransform                                         WorldOffset;                                                // 0x0040   (0x0030)  
	bool                                               bEnabled;                                                   // 0x0070   (0x0001)  
	unsigned char                                      UnknownData02_6[0xF];                                       // 0x0071   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DebugArcItemSpace
/// Size: 0x00A8 (0x000068 - 0x000110)
struct FRigUnit_DebugArcItemSpace : FRigUnit_DebugBaseMutable
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0068   (0x0008)  MISSED
	FTransform                                         Transform;                                                  // 0x0070   (0x0030)  
	FLinearColor                                       Color;                                                      // 0x00A0   (0x0010)  
	float                                              Radius;                                                     // 0x00B0   (0x0004)  
	float                                              MinimumDegrees;                                             // 0x00B4   (0x0004)  
	float                                              MaximumDegrees;                                             // 0x00B8   (0x0004)  
	float                                              Thickness;                                                  // 0x00BC   (0x0004)  
	int32_t                                            Detail;                                                     // 0x00C0   (0x0004)  
	FRigElementKey                                     Space;                                                      // 0x00C4   (0x000C)  
	FTransform                                         WorldOffset;                                                // 0x00D0   (0x0030)  
	bool                                               bEnabled;                                                   // 0x0100   (0x0001)  
	unsigned char                                      UnknownData01_6[0xF];                                       // 0x0101   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DebugArc
/// Size: 0x00A8 (0x000068 - 0x000110)
struct FRigUnit_DebugArc : FRigUnit_DebugBaseMutable
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0068   (0x0008)  MISSED
	FTransform                                         Transform;                                                  // 0x0070   (0x0030)  
	FLinearColor                                       Color;                                                      // 0x00A0   (0x0010)  
	float                                              Radius;                                                     // 0x00B0   (0x0004)  
	float                                              MinimumDegrees;                                             // 0x00B4   (0x0004)  
	float                                              MaximumDegrees;                                             // 0x00B8   (0x0004)  
	float                                              Thickness;                                                  // 0x00BC   (0x0004)  
	int32_t                                            Detail;                                                     // 0x00C0   (0x0004)  
	FName                                              Space;                                                      // 0x00C4   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x00CC   (0x0004)  MISSED
	FTransform                                         WorldOffset;                                                // 0x00D0   (0x0030)  
	bool                                               bEnabled;                                                   // 0x0100   (0x0001)  
	unsigned char                                      UnknownData02_6[0xF];                                       // 0x0101   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DebugRectangleItemSpace
/// Size: 0x00A8 (0x000068 - 0x000110)
struct FRigUnit_DebugRectangleItemSpace : FRigUnit_DebugBaseMutable
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0068   (0x0008)  MISSED
	FTransform                                         Transform;                                                  // 0x0070   (0x0030)  
	FLinearColor                                       Color;                                                      // 0x00A0   (0x0010)  
	float                                              Scale;                                                      // 0x00B0   (0x0004)  
	float                                              Thickness;                                                  // 0x00B4   (0x0004)  
	FRigElementKey                                     Space;                                                      // 0x00B8   (0x000C)  
	unsigned char                                      UnknownData01_5[0xC];                                       // 0x00C4   (0x000C)  MISSED
	FTransform                                         WorldOffset;                                                // 0x00D0   (0x0030)  
	bool                                               bEnabled;                                                   // 0x0100   (0x0001)  
	unsigned char                                      UnknownData02_6[0xF];                                       // 0x0101   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DebugRectangle
/// Size: 0x0098 (0x000068 - 0x000100)
struct FRigUnit_DebugRectangle : FRigUnit_DebugBaseMutable
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0068   (0x0008)  MISSED
	FTransform                                         Transform;                                                  // 0x0070   (0x0030)  
	FLinearColor                                       Color;                                                      // 0x00A0   (0x0010)  
	float                                              Scale;                                                      // 0x00B0   (0x0004)  
	float                                              Thickness;                                                  // 0x00B4   (0x0004)  
	FName                                              Space;                                                      // 0x00B8   (0x0008)  
	FTransform                                         WorldOffset;                                                // 0x00C0   (0x0030)  
	bool                                               bEnabled;                                                   // 0x00F0   (0x0001)  
	unsigned char                                      UnknownData01_6[0xF];                                       // 0x00F1   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DebugTransformArrayMutable
/// Size: 0x0088 (0x000068 - 0x0000F0)
struct FRigUnit_DebugTransformArrayMutable : FRigUnit_DebugBaseMutable
{ 
	TArray<FTransform>                                 Transforms;                                                 // 0x0068   (0x0010)  
	ERigUnitDebugTransformMode                         Mode;                                                       // 0x0078   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0079   (0x0003)  MISSED
	FLinearColor                                       Color;                                                      // 0x007C   (0x0010)  
	float                                              Thickness;                                                  // 0x008C   (0x0004)  
	float                                              Scale;                                                      // 0x0090   (0x0004)  
	FName                                              Space;                                                      // 0x0094   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x009C   (0x0004)  MISSED
	FTransform                                         WorldOffset;                                                // 0x00A0   (0x0030)  
	bool                                               bEnabled;                                                   // 0x00D0   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x00D1   (0x0007)  MISSED
	FRigUnit_DebugTransformArrayMutable_WorkData       WorkData;                                                   // 0x00D8   (0x0010)  
	unsigned char                                      UnknownData03_6[0x8];                                       // 0x00E8   (0x0008)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DebugTransformArrayMutable_WorkData
/// Size: 0x0010 (0x000000 - 0x000010)
struct FRigUnit_DebugTransformArrayMutable_WorkData
{ 
	TArray<FTransform>                                 DrawTransforms;                                             // 0x0000   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_DebugTransformMutableItemSpace
/// Size: 0x00A8 (0x000068 - 0x000110)
struct FRigUnit_DebugTransformMutableItemSpace : FRigUnit_DebugBaseMutable
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0068   (0x0008)  MISSED
	FTransform                                         Transform;                                                  // 0x0070   (0x0030)  
	ERigUnitDebugTransformMode                         Mode;                                                       // 0x00A0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x00A1   (0x0003)  MISSED
	FLinearColor                                       Color;                                                      // 0x00A4   (0x0010)  
	float                                              Thickness;                                                  // 0x00B4   (0x0004)  
	float                                              Scale;                                                      // 0x00B8   (0x0004)  
	FRigElementKey                                     Space;                                                      // 0x00BC   (0x000C)  
	unsigned char                                      UnknownData02_5[0x8];                                       // 0x00C8   (0x0008)  MISSED
	FTransform                                         WorldOffset;                                                // 0x00D0   (0x0030)  
	bool                                               bEnabled;                                                   // 0x0100   (0x0001)  
	unsigned char                                      UnknownData03_6[0xF];                                       // 0x0101   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DebugTransformMutable
/// Size: 0x00A8 (0x000068 - 0x000110)
struct FRigUnit_DebugTransformMutable : FRigUnit_DebugBaseMutable
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0068   (0x0008)  MISSED
	FTransform                                         Transform;                                                  // 0x0070   (0x0030)  
	ERigUnitDebugTransformMode                         Mode;                                                       // 0x00A0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x00A1   (0x0003)  MISSED
	FLinearColor                                       Color;                                                      // 0x00A4   (0x0010)  
	float                                              Thickness;                                                  // 0x00B4   (0x0004)  
	float                                              Scale;                                                      // 0x00B8   (0x0004)  
	FName                                              Space;                                                      // 0x00BC   (0x0008)  
	unsigned char                                      UnknownData02_5[0xC];                                       // 0x00C4   (0x000C)  MISSED
	FTransform                                         WorldOffset;                                                // 0x00D0   (0x0030)  
	bool                                               bEnabled;                                                   // 0x0100   (0x0001)  
	unsigned char                                      UnknownData03_6[0xF];                                       // 0x0101   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DebugTransform
/// Size: 0x00A8 (0x000008 - 0x0000B0)
struct FRigUnit_DebugTransform : FRigUnit_DebugBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FTransform                                         Transform;                                                  // 0x0010   (0x0030)  
	ERigUnitDebugTransformMode                         Mode;                                                       // 0x0040   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0041   (0x0003)  MISSED
	FLinearColor                                       Color;                                                      // 0x0044   (0x0010)  
	float                                              Thickness;                                                  // 0x0054   (0x0004)  
	float                                              Scale;                                                      // 0x0058   (0x0004)  
	FName                                              Space;                                                      // 0x005C   (0x0008)  
	unsigned char                                      UnknownData02_5[0xC];                                       // 0x0064   (0x000C)  MISSED
	FTransform                                         WorldOffset;                                                // 0x0070   (0x0030)  
	bool                                               bEnabled;                                                   // 0x00A0   (0x0001)  
	unsigned char                                      UnknownData03_6[0xF];                                       // 0x00A1   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DeltaFromPreviousTransform
/// Size: 0x00C8 (0x000008 - 0x0000D0)
struct FRigUnit_DeltaFromPreviousTransform : FRigUnit_SimBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FTransform                                         Value;                                                      // 0x0010   (0x0030)  
	FTransform                                         Delta;                                                      // 0x0040   (0x0030)  
	FTransform                                         PreviousValue;                                              // 0x0070   (0x0030)  
	FTransform                                         Cache;                                                      // 0x00A0   (0x0030)  
};

/// Struct /Script/ControlRig.RigUnit_DeltaFromPreviousQuat
/// Size: 0x0048 (0x000008 - 0x000050)
struct FRigUnit_DeltaFromPreviousQuat : FRigUnit_SimBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              Value;                                                      // 0x0010   (0x0010)  
	FQuat                                              Delta;                                                      // 0x0020   (0x0010)  
	FQuat                                              PreviousValue;                                              // 0x0030   (0x0010)  
	FQuat                                              Cache;                                                      // 0x0040   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_DeltaFromPreviousVector
/// Size: 0x0030 (0x000008 - 0x000038)
struct FRigUnit_DeltaFromPreviousVector : FRigUnit_SimBase
{ 
	FVector                                            Value;                                                      // 0x0008   (0x000C)  
	FVector                                            Delta;                                                      // 0x0014   (0x000C)  
	FVector                                            PreviousValue;                                              // 0x0020   (0x000C)  
	FVector                                            Cache;                                                      // 0x002C   (0x000C)  
};

/// Struct /Script/ControlRig.RigUnit_DeltaFromPreviousFloat
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_DeltaFromPreviousFloat : FRigUnit_SimBase
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	float                                              Delta;                                                      // 0x000C   (0x0004)  
	float                                              PreviousValue;                                              // 0x0010   (0x0004)  
	float                                              Cache;                                                      // 0x0014   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_DistributeRotationForCollection
/// Size: 0x0078 (0x000068 - 0x0000E0)
struct FRigUnit_DistributeRotationForCollection : FRigUnit_HighlevelBaseMutable
{ 
	FRigElementKeyCollection                           Items;                                                      // 0x0068   (0x0010)  
	TArray<FRigUnit_DistributeRotation_Rotation>       Rotations;                                                  // 0x0078   (0x0010)  
	EControlRigAnimEasingType                          RotationEaseType;                                           // 0x0088   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0089   (0x0003)  MISSED
	float                                              Weight;                                                     // 0x008C   (0x0004)  
	FRigUnit_DistributeRotation_WorkData               WorkData;                                                   // 0x0090   (0x0050)  
};

/// Struct /Script/ControlRig.RigUnit_DistributeRotation_WorkData
/// Size: 0x0050 (0x000000 - 0x000050)
struct FRigUnit_DistributeRotation_WorkData
{ 
	TArray<FCachedRigElement>                          CachedItems;                                                // 0x0000   (0x0010)  
	TArray<int32_t>                                    ItemRotationA;                                              // 0x0010   (0x0010)  
	TArray<int32_t>                                    ItemRotationB;                                              // 0x0020   (0x0010)  
	TArray<float>                                      ItemRotationT;                                              // 0x0030   (0x0010)  
	TArray<FTransform>                                 ItemLocalTransforms;                                        // 0x0040   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_DistributeRotation_Rotation
/// Size: 0x0020 (0x000000 - 0x000020)
struct FRigUnit_DistributeRotation_Rotation
{ 
	FQuat                                              Rotation;                                                   // 0x0000   (0x0010)  
	float                                              Ratio;                                                      // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0xC];                                       // 0x0014   (0x000C)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DistributeRotation
/// Size: 0x0080 (0x000068 - 0x0000E8)
struct FRigUnit_DistributeRotation : FRigUnit_HighlevelBaseMutable
{ 
	FName                                              StartBone;                                                  // 0x0068   (0x0008)  
	FName                                              EndBone;                                                    // 0x0070   (0x0008)  
	TArray<FRigUnit_DistributeRotation_Rotation>       Rotations;                                                  // 0x0078   (0x0010)  
	EControlRigAnimEasingType                          RotationEaseType;                                           // 0x0088   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0089   (0x0003)  MISSED
	float                                              Weight;                                                     // 0x008C   (0x0004)  
	bool                                               bPropagateToChildren;                                       // 0x0090   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0091   (0x0007)  MISSED
	FRigUnit_DistributeRotation_WorkData               WorkData;                                                   // 0x0098   (0x0050)  
};

/// Struct /Script/ControlRig.RigUnit_DrawContainerSetTransform
/// Size: 0x0038 (0x000068 - 0x0000A0)
struct FRigUnit_DrawContainerSetTransform : FRigUnitMutable
{ 
	FName                                              InstructionName;                                            // 0x0068   (0x0008)  
	FTransform                                         Transform;                                                  // 0x0070   (0x0030)  
};

/// Struct /Script/ControlRig.RigUnit_DrawContainerSetThickness
/// Size: 0x0010 (0x000068 - 0x000078)
struct FRigUnit_DrawContainerSetThickness : FRigUnitMutable
{ 
	FName                                              InstructionName;                                            // 0x0068   (0x0008)  
	float                                              Thickness;                                                  // 0x0070   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0074   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_DrawContainerSetColor
/// Size: 0x0018 (0x000068 - 0x000080)
struct FRigUnit_DrawContainerSetColor : FRigUnitMutable
{ 
	FName                                              InstructionName;                                            // 0x0068   (0x0008)  
	FLinearColor                                       Color;                                                      // 0x0070   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_DrawContainerGetInstruction
/// Size: 0x0048 (0x000008 - 0x000050)
struct FRigUnit_DrawContainerGetInstruction : FRigUnit
{ 
	FName                                              InstructionName;                                            // 0x0008   (0x0008)  
	FLinearColor                                       Color;                                                      // 0x0010   (0x0010)  
	FTransform                                         Transform;                                                  // 0x0020   (0x0030)  
};

/// Struct /Script/ControlRig.RigUnit_FABRIKPerItem
/// Size: 0x0098 (0x000068 - 0x000100)
struct FRigUnit_FABRIKPerItem : FRigUnit_HighlevelBaseMutable
{ 
	FRigElementKeyCollection                           Items;                                                      // 0x0068   (0x0010)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0078   (0x0008)  MISSED
	FTransform                                         EffectorTransform;                                          // 0x0080   (0x0030)  
	float                                              Precision;                                                  // 0x00B0   (0x0004)  
	float                                              Weight;                                                     // 0x00B4   (0x0004)  
	bool                                               bPropagateToChildren;                                       // 0x00B8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x00B9   (0x0003)  MISSED
	int32_t                                            MaxIterations;                                              // 0x00BC   (0x0004)  
	FRigUnit_FABRIK_WorkData                           WorkData;                                                   // 0x00C0   (0x0038)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x00F8   (0x0008)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_FABRIK_WorkData
/// Size: 0x0038 (0x000000 - 0x000038)
struct FRigUnit_FABRIK_WorkData
{ 
	TArray<FFABRIKChainLink>                           Chain;                                                      // 0x0000   (0x0010)  
	TArray<FCachedRigElement>                          CachedItems;                                                // 0x0010   (0x0010)  
	FCachedRigElement                                  CachedEffector;                                             // 0x0020   (0x0014)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0034   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_FABRIK
/// Size: 0x0098 (0x000068 - 0x000100)
struct FRigUnit_FABRIK : FRigUnit_HighlevelBaseMutable
{ 
	FName                                              StartBone;                                                  // 0x0068   (0x0008)  
	FName                                              EffectorBone;                                               // 0x0070   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0078   (0x0008)  MISSED
	FTransform                                         EffectorTransform;                                          // 0x0080   (0x0030)  
	float                                              Precision;                                                  // 0x00B0   (0x0004)  
	float                                              Weight;                                                     // 0x00B4   (0x0004)  
	bool                                               bPropagateToChildren;                                       // 0x00B8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x00B9   (0x0003)  MISSED
	int32_t                                            MaxIterations;                                              // 0x00BC   (0x0004)  
	FRigUnit_FABRIK_WorkData                           WorkData;                                                   // 0x00C0   (0x0038)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x00F8   (0x0008)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_FitChainToCurvePerItem
/// Size: 0x0198 (0x000068 - 0x000200)
struct FRigUnit_FitChainToCurvePerItem : FRigUnit_HighlevelBaseMutable
{ 
	FRigElementKeyCollection                           Items;                                                      // 0x0068   (0x0010)  
	FCRFourPointBezier                                 Bezier;                                                     // 0x0078   (0x0030)  
	EControlRigCurveAlignment                          Alignment;                                                  // 0x00A8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x00A9   (0x0003)  MISSED
	float                                              Minimum;                                                    // 0x00AC   (0x0004)  
	float                                              Maximum;                                                    // 0x00B0   (0x0004)  
	int32_t                                            SamplingPrecision;                                          // 0x00B4   (0x0004)  
	FVector                                            PrimaryAxis;                                                // 0x00B8   (0x000C)  
	FVector                                            SecondaryAxis;                                              // 0x00C4   (0x000C)  
	FVector                                            PoleVectorPosition;                                         // 0x00D0   (0x000C)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x00DC   (0x0004)  MISSED
	TArray<FRigUnit_FitChainToCurve_Rotation>          Rotations;                                                  // 0x00E0   (0x0010)  
	EControlRigAnimEasingType                          RotationEaseType;                                           // 0x00F0   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x00F1   (0x0003)  MISSED
	float                                              Weight;                                                     // 0x00F4   (0x0004)  
	bool                                               bPropagateToChildren;                                       // 0x00F8   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x00F9   (0x0007)  MISSED
	FRigUnit_FitChainToCurve_DebugSettings             DebugSettings;                                              // 0x0100   (0x0060)  
	FRigUnit_FitChainToCurve_WorkData                  WorkData;                                                   // 0x0160   (0x0098)  
	unsigned char                                      UnknownData04_6[0x8];                                       // 0x01F8   (0x0008)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_FitChainToCurve_WorkData
/// Size: 0x0098 (0x000000 - 0x000098)
struct FRigUnit_FitChainToCurve_WorkData
{ 
	float                                              ChainLength;                                                // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	TArray<FVector>                                    ItemPositions;                                              // 0x0008   (0x0010)  
	TArray<float>                                      ItemSegments;                                               // 0x0018   (0x0010)  
	TArray<FVector>                                    CurvePositions;                                             // 0x0028   (0x0010)  
	TArray<float>                                      CurveSegments;                                              // 0x0038   (0x0010)  
	TArray<FCachedRigElement>                          CachedItems;                                                // 0x0048   (0x0010)  
	TArray<int32_t>                                    ItemRotationA;                                              // 0x0058   (0x0010)  
	TArray<int32_t>                                    ItemRotationB;                                              // 0x0068   (0x0010)  
	TArray<float>                                      ItemRotationT;                                              // 0x0078   (0x0010)  
	TArray<FTransform>                                 ItemLocalTransforms;                                        // 0x0088   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_FitChainToCurve_DebugSettings
/// Size: 0x0060 (0x000000 - 0x000060)
struct FRigUnit_FitChainToCurve_DebugSettings
{ 
	bool                                               bEnabled;                                                   // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	float                                              Scale;                                                      // 0x0004   (0x0004)  
	FLinearColor                                       CurveColor;                                                 // 0x0008   (0x0010)  
	FLinearColor                                       SegmentsColor;                                              // 0x0018   (0x0010)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x0028   (0x0008)  MISSED
	FTransform                                         WorldOffset;                                                // 0x0030   (0x0030)  
};

/// Struct /Script/ControlRig.RigUnit_FitChainToCurve_Rotation
/// Size: 0x0020 (0x000000 - 0x000020)
struct FRigUnit_FitChainToCurve_Rotation
{ 
	FQuat                                              Rotation;                                                   // 0x0000   (0x0010)  
	float                                              Ratio;                                                      // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0xC];                                       // 0x0014   (0x000C)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_FitChainToCurve
/// Size: 0x0198 (0x000068 - 0x000200)
struct FRigUnit_FitChainToCurve : FRigUnit_HighlevelBaseMutable
{ 
	FName                                              StartBone;                                                  // 0x0068   (0x0008)  
	FName                                              EndBone;                                                    // 0x0070   (0x0008)  
	FCRFourPointBezier                                 Bezier;                                                     // 0x0078   (0x0030)  
	EControlRigCurveAlignment                          Alignment;                                                  // 0x00A8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x00A9   (0x0003)  MISSED
	float                                              Minimum;                                                    // 0x00AC   (0x0004)  
	float                                              Maximum;                                                    // 0x00B0   (0x0004)  
	int32_t                                            SamplingPrecision;                                          // 0x00B4   (0x0004)  
	FVector                                            PrimaryAxis;                                                // 0x00B8   (0x000C)  
	FVector                                            SecondaryAxis;                                              // 0x00C4   (0x000C)  
	FVector                                            PoleVectorPosition;                                         // 0x00D0   (0x000C)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x00DC   (0x0004)  MISSED
	TArray<FRigUnit_FitChainToCurve_Rotation>          Rotations;                                                  // 0x00E0   (0x0010)  
	EControlRigAnimEasingType                          RotationEaseType;                                           // 0x00F0   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x00F1   (0x0003)  MISSED
	float                                              Weight;                                                     // 0x00F4   (0x0004)  
	bool                                               bPropagateToChildren;                                       // 0x00F8   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x00F9   (0x0007)  MISSED
	FRigUnit_FitChainToCurve_DebugSettings             DebugSettings;                                              // 0x0100   (0x0060)  
	FRigUnit_FitChainToCurve_WorkData                  WorkData;                                                   // 0x0160   (0x0098)  
	unsigned char                                      UnknownData04_6[0x8];                                       // 0x01F8   (0x0008)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MapRange_Float
/// Size: 0x0018 (0x000008 - 0x000020)
struct FRigUnit_MapRange_Float : FRigUnit
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	float                                              MinIn;                                                      // 0x000C   (0x0004)  
	float                                              MaxIn;                                                      // 0x0010   (0x0004)  
	float                                              MinOut;                                                     // 0x0014   (0x0004)  
	float                                              MaxOut;                                                     // 0x0018   (0x0004)  
	float                                              Result;                                                     // 0x001C   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_Clamp_Float
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_Clamp_Float : FRigUnit
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	float                                              Min;                                                        // 0x000C   (0x0004)  
	float                                              Max;                                                        // 0x0010   (0x0004)  
	float                                              Result;                                                     // 0x0014   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_BinaryFloatOp
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_BinaryFloatOp : FRigUnit
{ 
	float                                              Argument0;                                                  // 0x0008   (0x0004)  
	float                                              Argument1;                                                  // 0x000C   (0x0004)  
	float                                              Result;                                                     // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_Divide_FloatFloat
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_Divide_FloatFloat : FRigUnit_BinaryFloatOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_Subtract_FloatFloat
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_Subtract_FloatFloat : FRigUnit_BinaryFloatOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_Add_FloatFloat
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_Add_FloatFloat : FRigUnit_BinaryFloatOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_Multiply_FloatFloat
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_Multiply_FloatFloat : FRigUnit_BinaryFloatOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_ForLoopCount
/// Size: 0x0070 (0x000068 - 0x0000D8)
struct FRigUnit_ForLoopCount : FRigUnitMutable
{ 
	int32_t                                            Count;                                                      // 0x0068   (0x0004)  
	int32_t                                            Index;                                                      // 0x006C   (0x0004)  
	float                                              Ratio;                                                      // 0x0070   (0x0004)  
	bool                                               Continue;                                                   // 0x0074   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0075   (0x0003)  MISSED
	FControlRigExecuteContext                          Completed;                                                  // 0x0078   (0x0060)  
};

/// Struct /Script/ControlRig.RigUnit_GetBoneTransform
/// Size: 0x0068 (0x000008 - 0x000070)
struct FRigUnit_GetBoneTransform : FRigUnit
{ 
	FName                                              Bone;                                                       // 0x0008   (0x0008)  
	EBoneGetterSetterMode                              Space;                                                      // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_5[0xF];                                       // 0x0011   (0x000F)  MISSED
	FTransform                                         Transform;                                                  // 0x0020   (0x0030)  
	FCachedRigElement                                  CachedBone;                                                 // 0x0050   (0x0014)  
	unsigned char                                      UnknownData01_6[0xC];                                       // 0x0064   (0x000C)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_GetControlInitialTransform
/// Size: 0x0068 (0x000008 - 0x000070)
struct FRigUnit_GetControlInitialTransform : FRigUnit
{ 
	FName                                              Control;                                                    // 0x0008   (0x0008)  
	EBoneGetterSetterMode                              Space;                                                      // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_5[0xF];                                       // 0x0011   (0x000F)  MISSED
	FTransform                                         Transform;                                                  // 0x0020   (0x0030)  
	FCachedRigElement                                  CachedControlIndex;                                         // 0x0050   (0x0014)  
	unsigned char                                      UnknownData01_6[0xC];                                       // 0x0064   (0x000C)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_GetControlTransform
/// Size: 0x00C8 (0x000008 - 0x0000D0)
struct FRigUnit_GetControlTransform : FRigUnit
{ 
	FName                                              Control;                                                    // 0x0008   (0x0008)  
	EBoneGetterSetterMode                              Space;                                                      // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_5[0xF];                                       // 0x0011   (0x000F)  MISSED
	FTransform                                         Transform;                                                  // 0x0020   (0x0030)  
	FTransform                                         Minimum;                                                    // 0x0050   (0x0030)  
	FTransform                                         Maximum;                                                    // 0x0080   (0x0030)  
	FCachedRigElement                                  CachedControlIndex;                                         // 0x00B0   (0x0014)  
	unsigned char                                      UnknownData01_6[0xC];                                       // 0x00C4   (0x000C)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_GetControlRotator
/// Size: 0x0048 (0x000008 - 0x000050)
struct FRigUnit_GetControlRotator : FRigUnit
{ 
	FName                                              Control;                                                    // 0x0008   (0x0008)  
	EBoneGetterSetterMode                              Space;                                                      // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0011   (0x0003)  MISSED
	FRotator                                           Rotator;                                                    // 0x0014   (0x000C)  
	FRotator                                           Minimum;                                                    // 0x0020   (0x000C)  
	FRotator                                           Maximum;                                                    // 0x002C   (0x000C)  
	FCachedRigElement                                  CachedControlIndex;                                         // 0x0038   (0x0014)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x004C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_GetControlVector
/// Size: 0x0048 (0x000008 - 0x000050)
struct FRigUnit_GetControlVector : FRigUnit
{ 
	FName                                              Control;                                                    // 0x0008   (0x0008)  
	EBoneGetterSetterMode                              Space;                                                      // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0011   (0x0003)  MISSED
	FVector                                            Vector;                                                     // 0x0014   (0x000C)  
	FVector                                            Minimum;                                                    // 0x0020   (0x000C)  
	FVector                                            Maximum;                                                    // 0x002C   (0x000C)  
	FCachedRigElement                                  CachedControlIndex;                                         // 0x0038   (0x0014)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x004C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_GetControlVector2D
/// Size: 0x0038 (0x000008 - 0x000040)
struct FRigUnit_GetControlVector2D : FRigUnit
{ 
	FName                                              Control;                                                    // 0x0008   (0x0008)  
	FVector2D                                          Vector;                                                     // 0x0010   (0x0008)  
	FVector2D                                          Minimum;                                                    // 0x0018   (0x0008)  
	FVector2D                                          Maximum;                                                    // 0x0020   (0x0008)  
	FCachedRigElement                                  CachedControlIndex;                                         // 0x0028   (0x0014)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x003C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_GetControlInteger
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_GetControlInteger : FRigUnit
{ 
	FName                                              Control;                                                    // 0x0008   (0x0008)  
	int32_t                                            IntegerValue;                                               // 0x0010   (0x0004)  
	int32_t                                            Minimum;                                                    // 0x0014   (0x0004)  
	int32_t                                            Maximum;                                                    // 0x0018   (0x0004)  
	FCachedRigElement                                  CachedControlIndex;                                         // 0x001C   (0x0014)  
};

/// Struct /Script/ControlRig.RigUnit_GetControlFloat
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_GetControlFloat : FRigUnit
{ 
	FName                                              Control;                                                    // 0x0008   (0x0008)  
	float                                              FloatValue;                                                 // 0x0010   (0x0004)  
	float                                              Minimum;                                                    // 0x0014   (0x0004)  
	float                                              Maximum;                                                    // 0x0018   (0x0004)  
	FCachedRigElement                                  CachedControlIndex;                                         // 0x001C   (0x0014)  
};

/// Struct /Script/ControlRig.RigUnit_GetControlBool
/// Size: 0x0020 (0x000008 - 0x000028)
struct FRigUnit_GetControlBool : FRigUnit
{ 
	FName                                              Control;                                                    // 0x0008   (0x0008)  
	bool                                               BoolValue;                                                  // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0011   (0x0003)  MISSED
	FCachedRigElement                                  CachedControlIndex;                                         // 0x0014   (0x0014)  
};

/// Struct /Script/ControlRig.RigUnit_GetCurveValue
/// Size: 0x0020 (0x000008 - 0x000028)
struct FRigUnit_GetCurveValue : FRigUnit
{ 
	FName                                              Curve;                                                      // 0x0008   (0x0008)  
	float                                              Value;                                                      // 0x0010   (0x0004)  
	FCachedRigElement                                  CachedCurveIndex;                                           // 0x0014   (0x0014)  
};

/// Struct /Script/ControlRig.RigUnit_GetDeltaTime
/// Size: 0x0008 (0x000008 - 0x000010)
struct FRigUnit_GetDeltaTime : FRigUnit_AnimBase
{ 
	float                                              Result;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_GetInitialBoneTransform
/// Size: 0x0068 (0x000008 - 0x000070)
struct FRigUnit_GetInitialBoneTransform : FRigUnit
{ 
	FName                                              Bone;                                                       // 0x0008   (0x0008)  
	EBoneGetterSetterMode                              Space;                                                      // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_5[0xF];                                       // 0x0011   (0x000F)  MISSED
	FTransform                                         Transform;                                                  // 0x0020   (0x0030)  
	FCachedRigElement                                  CachedBone;                                                 // 0x0050   (0x0014)  
	unsigned char                                      UnknownData01_6[0xC];                                       // 0x0064   (0x000C)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_GetJointTransform
/// Size: 0x0088 (0x000068 - 0x0000F0)
struct FRigUnit_GetJointTransform : FRigUnitMutable
{ 
	FName                                              Joint;                                                      // 0x0068   (0x0008)  
	ETransformGetterType                               Type;                                                       // 0x0070   (0x0001)  
	ETransformSpaceMode                                TransformSpace;                                             // 0x0071   (0x0001)  
	unsigned char                                      UnknownData00_5[0xE];                                       // 0x0072   (0x000E)  MISSED
	FTransform                                         BaseTransform;                                              // 0x0080   (0x0030)  
	FName                                              BaseJoint;                                                  // 0x00B0   (0x0008)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x00B8   (0x0008)  MISSED
	FTransform                                         Output;                                                     // 0x00C0   (0x0030)  
};

/// Struct /Script/ControlRig.RigUnit_GetRelativeBoneTransform
/// Size: 0x0078 (0x000008 - 0x000080)
struct FRigUnit_GetRelativeBoneTransform : FRigUnit
{ 
	FName                                              Bone;                                                       // 0x0008   (0x0008)  
	FName                                              Space;                                                      // 0x0010   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0018   (0x0008)  MISSED
	FTransform                                         Transform;                                                  // 0x0020   (0x0030)  
	FCachedRigElement                                  CachedBone;                                                 // 0x0050   (0x0014)  
	FCachedRigElement                                  CachedSpace;                                                // 0x0064   (0x0014)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0078   (0x0008)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_GetRelativeTransformForItem
/// Size: 0x0088 (0x000008 - 0x000090)
struct FRigUnit_GetRelativeTransformForItem : FRigUnit
{ 
	FRigElementKey                                     Child;                                                      // 0x0008   (0x000C)  
	bool                                               bChildInitial;                                              // 0x0014   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0015   (0x0003)  MISSED
	FRigElementKey                                     Parent;                                                     // 0x0018   (0x000C)  
	bool                                               bParentInitial;                                             // 0x0024   (0x0001)  
	unsigned char                                      UnknownData01_5[0xB];                                       // 0x0025   (0x000B)  MISSED
	FTransform                                         RelativeTransform;                                          // 0x0030   (0x0030)  
	FCachedRigElement                                  CachedChild;                                                // 0x0060   (0x0014)  
	FCachedRigElement                                  CachedParent;                                               // 0x0074   (0x0014)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x0088   (0x0008)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_GetSpaceTransform
/// Size: 0x0068 (0x000008 - 0x000070)
struct FRigUnit_GetSpaceTransform : FRigUnit
{ 
	FName                                              Space;                                                      // 0x0008   (0x0008)  
	EBoneGetterSetterMode                              SpaceType;                                                  // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_5[0xF];                                       // 0x0011   (0x000F)  MISSED
	FTransform                                         Transform;                                                  // 0x0020   (0x0030)  
	FCachedRigElement                                  CachedSpaceIndex;                                           // 0x0050   (0x0014)  
	unsigned char                                      UnknownData01_6[0xC];                                       // 0x0064   (0x000C)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_GetTransform
/// Size: 0x0068 (0x000008 - 0x000070)
struct FRigUnit_GetTransform : FRigUnit
{ 
	FRigElementKey                                     Item;                                                       // 0x0008   (0x000C)  
	EBoneGetterSetterMode                              Space;                                                      // 0x0014   (0x0001)  
	bool                                               bInitial;                                                   // 0x0015   (0x0001)  
	unsigned char                                      UnknownData00_5[0xA];                                       // 0x0016   (0x000A)  MISSED
	FTransform                                         Transform;                                                  // 0x0020   (0x0030)  
	FCachedRigElement                                  CachedIndex;                                                // 0x0050   (0x0014)  
	unsigned char                                      UnknownData01_6[0xC];                                       // 0x0064   (0x000C)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_GetWorldTime
/// Size: 0x0020 (0x000008 - 0x000028)
struct FRigUnit_GetWorldTime : FRigUnit_AnimBase
{ 
	float                                              Year;                                                       // 0x0008   (0x0004)  
	float                                              Month;                                                      // 0x000C   (0x0004)  
	float                                              Day;                                                        // 0x0010   (0x0004)  
	float                                              WeekDay;                                                    // 0x0014   (0x0004)  
	float                                              Hours;                                                      // 0x0018   (0x0004)  
	float                                              Minutes;                                                    // 0x001C   (0x0004)  
	float                                              Seconds;                                                    // 0x0020   (0x0004)  
	float                                              OverallSeconds;                                             // 0x0024   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_HierarchyBase
/// Size: 0x0000 (0x000008 - 0x000008)
struct FRigUnit_HierarchyBase : FRigUnit
{ 
};

/// Struct /Script/ControlRig.RigUnit_HierarchyGetSiblings
/// Size: 0x0048 (0x000008 - 0x000050)
struct FRigUnit_HierarchyGetSiblings : FRigUnit_HierarchyBase
{ 
	FRigElementKey                                     Item;                                                       // 0x0008   (0x000C)  
	bool                                               bIncludeItem;                                               // 0x0014   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0015   (0x0003)  MISSED
	FRigElementKeyCollection                           Siblings;                                                   // 0x0018   (0x0010)  
	FCachedRigElement                                  CachedItem;                                                 // 0x0028   (0x0014)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x003C   (0x0004)  MISSED
	FRigElementKeyCollection                           CachedSiblings;                                             // 0x0040   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_HierarchyGetChildren
/// Size: 0x0048 (0x000008 - 0x000050)
struct FRigUnit_HierarchyGetChildren : FRigUnit_HierarchyBase
{ 
	FRigElementKey                                     Parent;                                                     // 0x0008   (0x000C)  
	bool                                               bIncludeParent;                                             // 0x0014   (0x0001)  
	bool                                               bRecursive;                                                 // 0x0015   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0016   (0x0002)  MISSED
	FRigElementKeyCollection                           Children;                                                   // 0x0018   (0x0010)  
	FCachedRigElement                                  CachedParent;                                               // 0x0028   (0x0014)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x003C   (0x0004)  MISSED
	FRigElementKeyCollection                           CachedChildren;                                             // 0x0040   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_HierarchyGetParents
/// Size: 0x0048 (0x000008 - 0x000050)
struct FRigUnit_HierarchyGetParents : FRigUnit_HierarchyBase
{ 
	FRigElementKey                                     Child;                                                      // 0x0008   (0x000C)  
	bool                                               bIncludeChild;                                              // 0x0014   (0x0001)  
	bool                                               bReverse;                                                   // 0x0015   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0016   (0x0002)  MISSED
	FRigElementKeyCollection                           Parents;                                                    // 0x0018   (0x0010)  
	FCachedRigElement                                  CachedChild;                                                // 0x0028   (0x0014)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x003C   (0x0004)  MISSED
	FRigElementKeyCollection                           CachedParents;                                              // 0x0040   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_HierarchyGetParent
/// Size: 0x0040 (0x000008 - 0x000048)
struct FRigUnit_HierarchyGetParent : FRigUnit_HierarchyBase
{ 
	FRigElementKey                                     Child;                                                      // 0x0008   (0x000C)  
	FRigElementKey                                     Parent;                                                     // 0x0014   (0x000C)  
	FCachedRigElement                                  CachedChild;                                                // 0x0020   (0x0014)  
	FCachedRigElement                                  CachedParent;                                               // 0x0034   (0x0014)  
};

/// Struct /Script/ControlRig.RigUnit_InverseExecution
/// Size: 0x0060 (0x000008 - 0x000068)
struct FRigUnit_InverseExecution : FRigUnit
{ 
	FControlRigExecuteContext                          ExecuteContext;                                             // 0x0008   (0x0060)  
};

/// Struct /Script/ControlRig.RigUnit_IsInteracting
/// Size: 0x0008 (0x000008 - 0x000010)
struct FRigUnit_IsInteracting : FRigUnit
{ 
	bool                                               bIsInteracting;                                             // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_ItemBase
/// Size: 0x0000 (0x000008 - 0x000008)
struct FRigUnit_ItemBase : FRigUnit
{ 
};

/// Struct /Script/ControlRig.RigUnit_ItemReplace
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_ItemReplace : FRigUnit_ItemBase
{ 
	FRigElementKey                                     Item;                                                       // 0x0008   (0x000C)  
	FName                                              Old;                                                        // 0x0014   (0x0008)  
	FName                                              New;                                                        // 0x001C   (0x0008)  
	FRigElementKey                                     Result;                                                     // 0x0024   (0x000C)  
};

/// Struct /Script/ControlRig.RigUnit_ItemExists
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_ItemExists : FRigUnit_ItemBase
{ 
	FRigElementKey                                     Item;                                                       // 0x0008   (0x000C)  
	bool                                               Exists;                                                     // 0x0014   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0015   (0x0003)  MISSED
	FCachedRigElement                                  CachedIndex;                                                // 0x0018   (0x0014)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_ItemBaseMutable
/// Size: 0x0000 (0x000068 - 0x000068)
struct FRigUnit_ItemBaseMutable : FRigUnitMutable
{ 
};

/// Struct /Script/ControlRig.RigUnit_KalmanTransform
/// Size: 0x0098 (0x000008 - 0x0000A0)
struct FRigUnit_KalmanTransform : FRigUnit_SimBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FTransform                                         Value;                                                      // 0x0010   (0x0030)  
	int32_t                                            BufferSize;                                                 // 0x0040   (0x0004)  
	unsigned char                                      UnknownData01_5[0xC];                                       // 0x0044   (0x000C)  MISSED
	FTransform                                         Result;                                                     // 0x0050   (0x0030)  
	TArray<FTransform>                                 Buffer;                                                     // 0x0080   (0x0010)  
	int32_t                                            LastInsertIndex;                                            // 0x0090   (0x0004)  
	unsigned char                                      UnknownData02_6[0xC];                                       // 0x0094   (0x000C)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_KalmanVector
/// Size: 0x0038 (0x000008 - 0x000040)
struct FRigUnit_KalmanVector : FRigUnit_SimBase
{ 
	FVector                                            Value;                                                      // 0x0008   (0x000C)  
	int32_t                                            BufferSize;                                                 // 0x0014   (0x0004)  
	FVector                                            Result;                                                     // 0x0018   (0x000C)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0024   (0x0004)  MISSED
	TArray<FVector>                                    Buffer;                                                     // 0x0028   (0x0010)  
	int32_t                                            LastInsertIndex;                                            // 0x0038   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x003C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_KalmanFloat
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_KalmanFloat : FRigUnit_SimBase
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	int32_t                                            BufferSize;                                                 // 0x000C   (0x0004)  
	float                                              Result;                                                     // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	TArray<float>                                      Buffer;                                                     // 0x0018   (0x0010)  
	int32_t                                            LastInsertIndex;                                            // 0x0028   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathBase
/// Size: 0x0000 (0x000008 - 0x000008)
struct FRigUnit_MathBase : FRigUnit
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathBoolBase
/// Size: 0x0000 (0x000008 - 0x000008)
struct FRigUnit_MathBoolBase : FRigUnit_MathBase
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathBoolNotEquals
/// Size: 0x0008 (0x000008 - 0x000010)
struct FRigUnit_MathBoolNotEquals : FRigUnit_MathBoolBase
{ 
	bool                                               A;                                                          // 0x0008   (0x0001)  
	bool                                               B;                                                          // 0x0009   (0x0001)  
	bool                                               Result;                                                     // 0x000A   (0x0001)  
	unsigned char                                      UnknownData00_6[0x5];                                       // 0x000B   (0x0005)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathBoolEquals
/// Size: 0x0008 (0x000008 - 0x000010)
struct FRigUnit_MathBoolEquals : FRigUnit_MathBoolBase
{ 
	bool                                               A;                                                          // 0x0008   (0x0001)  
	bool                                               B;                                                          // 0x0009   (0x0001)  
	bool                                               Result;                                                     // 0x000A   (0x0001)  
	unsigned char                                      UnknownData00_6[0x5];                                       // 0x000B   (0x0005)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathBoolBinaryOp
/// Size: 0x0008 (0x000008 - 0x000010)
struct FRigUnit_MathBoolBinaryOp : FRigUnit_MathBoolBase
{ 
	bool                                               A;                                                          // 0x0008   (0x0001)  
	bool                                               B;                                                          // 0x0009   (0x0001)  
	bool                                               Result;                                                     // 0x000A   (0x0001)  
	unsigned char                                      UnknownData00_6[0x5];                                       // 0x000B   (0x0005)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathBoolOr
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathBoolOr : FRigUnit_MathBoolBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathBoolNand
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathBoolNand : FRigUnit_MathBoolBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathBoolAnd
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathBoolAnd : FRigUnit_MathBoolBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathBoolUnaryOp
/// Size: 0x0008 (0x000008 - 0x000010)
struct FRigUnit_MathBoolUnaryOp : FRigUnit_MathBoolBase
{ 
	bool                                               Value;                                                      // 0x0008   (0x0001)  
	bool                                               Result;                                                     // 0x0009   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x000A   (0x0006)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathBoolNot
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathBoolNot : FRigUnit_MathBoolUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathBoolConstant
/// Size: 0x0008 (0x000008 - 0x000010)
struct FRigUnit_MathBoolConstant : FRigUnit_MathBoolBase
{ 
	bool                                               Value;                                                      // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathBoolConstFalse
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathBoolConstFalse : FRigUnit_MathBoolConstant
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathBoolConstTrue
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathBoolConstTrue : FRigUnit_MathBoolConstant
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathColorBase
/// Size: 0x0000 (0x000008 - 0x000008)
struct FRigUnit_MathColorBase : FRigUnit_MathBase
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathColorLerp
/// Size: 0x0038 (0x000008 - 0x000040)
struct FRigUnit_MathColorLerp : FRigUnit_MathColorBase
{ 
	FLinearColor                                       A;                                                          // 0x0008   (0x0010)  
	FLinearColor                                       B;                                                          // 0x0018   (0x0010)  
	float                                              T;                                                          // 0x0028   (0x0004)  
	FLinearColor                                       Result;                                                     // 0x002C   (0x0010)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x003C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathColorBinaryOp
/// Size: 0x0030 (0x000008 - 0x000038)
struct FRigUnit_MathColorBinaryOp : FRigUnit_MathColorBase
{ 
	FLinearColor                                       A;                                                          // 0x0008   (0x0010)  
	FLinearColor                                       B;                                                          // 0x0018   (0x0010)  
	FLinearColor                                       Result;                                                     // 0x0028   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_MathColorMul
/// Size: 0x0000 (0x000038 - 0x000038)
struct FRigUnit_MathColorMul : FRigUnit_MathColorBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathColorSub
/// Size: 0x0000 (0x000038 - 0x000038)
struct FRigUnit_MathColorSub : FRigUnit_MathColorBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathColorAdd
/// Size: 0x0000 (0x000038 - 0x000038)
struct FRigUnit_MathColorAdd : FRigUnit_MathColorBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathColorFromFloat
/// Size: 0x0018 (0x000008 - 0x000020)
struct FRigUnit_MathColorFromFloat : FRigUnit_MathColorBase
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	FLinearColor                                       Result;                                                     // 0x000C   (0x0010)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathFloatBase
/// Size: 0x0000 (0x000008 - 0x000008)
struct FRigUnit_MathFloatBase : FRigUnit_MathBase
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatLawOfCosine
/// Size: 0x0020 (0x000008 - 0x000028)
struct FRigUnit_MathFloatLawOfCosine : FRigUnit_MathFloatBase
{ 
	float                                              A;                                                          // 0x0008   (0x0004)  
	float                                              B;                                                          // 0x000C   (0x0004)  
	float                                              C;                                                          // 0x0010   (0x0004)  
	float                                              AlphaAngle;                                                 // 0x0014   (0x0004)  
	float                                              BetaAngle;                                                  // 0x0018   (0x0004)  
	float                                              GammaAngle;                                                 // 0x001C   (0x0004)  
	bool                                               bValid;                                                     // 0x0020   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0021   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathFloatUnaryOp
/// Size: 0x0008 (0x000008 - 0x000010)
struct FRigUnit_MathFloatUnaryOp : FRigUnit_MathFloatBase
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	float                                              Result;                                                     // 0x000C   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_MathFloatAtan
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathFloatAtan : FRigUnit_MathFloatUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatAcos
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathFloatAcos : FRigUnit_MathFloatUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatAsin
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathFloatAsin : FRigUnit_MathFloatUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatTan
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathFloatTan : FRigUnit_MathFloatUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatCos
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathFloatCos : FRigUnit_MathFloatUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatSin
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathFloatSin : FRigUnit_MathFloatUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatRad
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathFloatRad : FRigUnit_MathFloatUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatDeg
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathFloatDeg : FRigUnit_MathFloatUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatSelectBool
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathFloatSelectBool : FRigUnit_MathFloatBase
{ 
	bool                                               Condition;                                                  // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0009   (0x0003)  MISSED
	float                                              IfTrue;                                                     // 0x000C   (0x0004)  
	float                                              IfFalse;                                                    // 0x0010   (0x0004)  
	float                                              Result;                                                     // 0x0014   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_MathFloatIsNearlyEqual
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathFloatIsNearlyEqual : FRigUnit_MathFloatBase
{ 
	float                                              A;                                                          // 0x0008   (0x0004)  
	float                                              B;                                                          // 0x000C   (0x0004)  
	float                                              Tolerance;                                                  // 0x0010   (0x0004)  
	bool                                               Result;                                                     // 0x0014   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0015   (0x0003)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathFloatIsNearlyZero
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathFloatIsNearlyZero : FRigUnit_MathFloatBase
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	float                                              Tolerance;                                                  // 0x000C   (0x0004)  
	bool                                               Result;                                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathFloatLessEqual
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathFloatLessEqual : FRigUnit_MathFloatBase
{ 
	float                                              A;                                                          // 0x0008   (0x0004)  
	float                                              B;                                                          // 0x000C   (0x0004)  
	bool                                               Result;                                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathFloatGreaterEqual
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathFloatGreaterEqual : FRigUnit_MathFloatBase
{ 
	float                                              A;                                                          // 0x0008   (0x0004)  
	float                                              B;                                                          // 0x000C   (0x0004)  
	bool                                               Result;                                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathFloatLess
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathFloatLess : FRigUnit_MathFloatBase
{ 
	float                                              A;                                                          // 0x0008   (0x0004)  
	float                                              B;                                                          // 0x000C   (0x0004)  
	bool                                               Result;                                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathFloatGreater
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathFloatGreater : FRigUnit_MathFloatBase
{ 
	float                                              A;                                                          // 0x0008   (0x0004)  
	float                                              B;                                                          // 0x000C   (0x0004)  
	bool                                               Result;                                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathFloatNotEquals
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathFloatNotEquals : FRigUnit_MathFloatBase
{ 
	float                                              A;                                                          // 0x0008   (0x0004)  
	float                                              B;                                                          // 0x000C   (0x0004)  
	bool                                               Result;                                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathFloatEquals
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathFloatEquals : FRigUnit_MathFloatBase
{ 
	float                                              A;                                                          // 0x0008   (0x0004)  
	float                                              B;                                                          // 0x000C   (0x0004)  
	bool                                               Result;                                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathFloatRemap
/// Size: 0x0020 (0x000008 - 0x000028)
struct FRigUnit_MathFloatRemap : FRigUnit_MathFloatBase
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	float                                              SourceMinimum;                                              // 0x000C   (0x0004)  
	float                                              SourceMaximum;                                              // 0x0010   (0x0004)  
	float                                              TargetMinimum;                                              // 0x0014   (0x0004)  
	float                                              TargetMaximum;                                              // 0x0018   (0x0004)  
	bool                                               bClamp;                                                     // 0x001C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x001D   (0x0003)  MISSED
	float                                              Result;                                                     // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathFloatLerp
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathFloatLerp : FRigUnit_MathFloatBase
{ 
	float                                              A;                                                          // 0x0008   (0x0004)  
	float                                              B;                                                          // 0x000C   (0x0004)  
	float                                              T;                                                          // 0x0010   (0x0004)  
	float                                              Result;                                                     // 0x0014   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_MathFloatClamp
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathFloatClamp : FRigUnit_MathFloatBase
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	float                                              Minimum;                                                    // 0x000C   (0x0004)  
	float                                              Maximum;                                                    // 0x0010   (0x0004)  
	float                                              Result;                                                     // 0x0014   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_MathFloatSign
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathFloatSign : FRigUnit_MathFloatUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatToInt
/// Size: 0x0008 (0x000008 - 0x000010)
struct FRigUnit_MathFloatToInt : FRigUnit_MathFloatBase
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	int32_t                                            Result;                                                     // 0x000C   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_MathFloatRound
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathFloatRound : FRigUnit_MathFloatBase
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	float                                              Result;                                                     // 0x000C   (0x0004)  
	int32_t                                            Int;                                                        // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathFloatCeil
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathFloatCeil : FRigUnit_MathFloatBase
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	float                                              Result;                                                     // 0x000C   (0x0004)  
	int32_t                                            Int;                                                        // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathFloatFloor
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathFloatFloor : FRigUnit_MathFloatBase
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	float                                              Result;                                                     // 0x000C   (0x0004)  
	int32_t                                            Int;                                                        // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathFloatAbs
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathFloatAbs : FRigUnit_MathFloatUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatNegate
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathFloatNegate : FRigUnit_MathFloatUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatSqrt
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathFloatSqrt : FRigUnit_MathFloatUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatBinaryOp
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathFloatBinaryOp : FRigUnit_MathFloatBase
{ 
	float                                              A;                                                          // 0x0008   (0x0004)  
	float                                              B;                                                          // 0x000C   (0x0004)  
	float                                              Result;                                                     // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathFloatPow
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_MathFloatPow : FRigUnit_MathFloatBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatMax
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_MathFloatMax : FRigUnit_MathFloatBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatMin
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_MathFloatMin : FRigUnit_MathFloatBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatMod
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_MathFloatMod : FRigUnit_MathFloatBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatDiv
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_MathFloatDiv : FRigUnit_MathFloatBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatMul
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_MathFloatMul : FRigUnit_MathFloatBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatSub
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_MathFloatSub : FRigUnit_MathFloatBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatAdd
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_MathFloatAdd : FRigUnit_MathFloatBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatConstant
/// Size: 0x0008 (0x000008 - 0x000010)
struct FRigUnit_MathFloatConstant : FRigUnit_MathFloatBase
{ 
	float                                              Value;                                                      // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathFloatConstTwoPi
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathFloatConstTwoPi : FRigUnit_MathFloatConstant
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatConstHalfPi
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathFloatConstHalfPi : FRigUnit_MathFloatConstant
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathFloatConstPi
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathFloatConstPi : FRigUnit_MathFloatConstant
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathIntBase
/// Size: 0x0000 (0x000008 - 0x000008)
struct FRigUnit_MathIntBase : FRigUnit_MathBase
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathIntLessEqual
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathIntLessEqual : FRigUnit_MathIntBase
{ 
	int32_t                                            A;                                                          // 0x0008   (0x0004)  
	int32_t                                            B;                                                          // 0x000C   (0x0004)  
	bool                                               Result;                                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathIntGreaterEqual
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathIntGreaterEqual : FRigUnit_MathIntBase
{ 
	int32_t                                            A;                                                          // 0x0008   (0x0004)  
	int32_t                                            B;                                                          // 0x000C   (0x0004)  
	bool                                               Result;                                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathIntLess
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathIntLess : FRigUnit_MathIntBase
{ 
	int32_t                                            A;                                                          // 0x0008   (0x0004)  
	int32_t                                            B;                                                          // 0x000C   (0x0004)  
	bool                                               Result;                                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathIntGreater
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathIntGreater : FRigUnit_MathIntBase
{ 
	int32_t                                            A;                                                          // 0x0008   (0x0004)  
	int32_t                                            B;                                                          // 0x000C   (0x0004)  
	bool                                               Result;                                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathIntNotEquals
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathIntNotEquals : FRigUnit_MathIntBase
{ 
	int32_t                                            A;                                                          // 0x0008   (0x0004)  
	int32_t                                            B;                                                          // 0x000C   (0x0004)  
	bool                                               Result;                                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathIntEquals
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathIntEquals : FRigUnit_MathIntBase
{ 
	int32_t                                            A;                                                          // 0x0008   (0x0004)  
	int32_t                                            B;                                                          // 0x000C   (0x0004)  
	bool                                               Result;                                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathIntClamp
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathIntClamp : FRigUnit_MathIntBase
{ 
	int32_t                                            Value;                                                      // 0x0008   (0x0004)  
	int32_t                                            Minimum;                                                    // 0x000C   (0x0004)  
	int32_t                                            Maximum;                                                    // 0x0010   (0x0004)  
	int32_t                                            Result;                                                     // 0x0014   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_MathIntUnaryOp
/// Size: 0x0008 (0x000008 - 0x000010)
struct FRigUnit_MathIntUnaryOp : FRigUnit_MathIntBase
{ 
	int32_t                                            Value;                                                      // 0x0008   (0x0004)  
	int32_t                                            Result;                                                     // 0x000C   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_MathIntSign
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathIntSign : FRigUnit_MathIntUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathIntToFloat
/// Size: 0x0008 (0x000008 - 0x000010)
struct FRigUnit_MathIntToFloat : FRigUnit_MathIntBase
{ 
	int32_t                                            Value;                                                      // 0x0008   (0x0004)  
	float                                              Result;                                                     // 0x000C   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_MathIntAbs
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathIntAbs : FRigUnit_MathIntUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathIntNegate
/// Size: 0x0000 (0x000010 - 0x000010)
struct FRigUnit_MathIntNegate : FRigUnit_MathIntUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathIntBinaryOp
/// Size: 0x0010 (0x000008 - 0x000018)
struct FRigUnit_MathIntBinaryOp : FRigUnit_MathIntBase
{ 
	int32_t                                            A;                                                          // 0x0008   (0x0004)  
	int32_t                                            B;                                                          // 0x000C   (0x0004)  
	int32_t                                            Result;                                                     // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathIntPow
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_MathIntPow : FRigUnit_MathIntBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathIntMax
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_MathIntMax : FRigUnit_MathIntBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathIntMin
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_MathIntMin : FRigUnit_MathIntBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathIntMod
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_MathIntMod : FRigUnit_MathIntBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathIntDiv
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_MathIntDiv : FRigUnit_MathIntBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathIntMul
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_MathIntMul : FRigUnit_MathIntBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathIntSub
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_MathIntSub : FRigUnit_MathIntBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathIntAdd
/// Size: 0x0000 (0x000018 - 0x000018)
struct FRigUnit_MathIntAdd : FRigUnit_MathIntBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionRotationOrder
/// Size: 0x0008 (0x000008 - 0x000010)
struct FRigUnit_MathQuaternionRotationOrder : FRigUnit_MathBase
{ 
	EControlRigRotationOrder                           RotationOrder;                                              // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionBase
/// Size: 0x0000 (0x000008 - 0x000008)
struct FRigUnit_MathQuaternionBase : FRigUnit_MathBase
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionSwingTwist
/// Size: 0x0048 (0x000008 - 0x000050)
struct FRigUnit_MathQuaternionSwingTwist : FRigUnit_MathQuaternionBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              Input;                                                      // 0x0010   (0x0010)  
	FVector                                            TwistAxis;                                                  // 0x0020   (0x000C)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x002C   (0x0004)  MISSED
	FQuat                                              Swing;                                                      // 0x0030   (0x0010)  
	FQuat                                              Twist;                                                      // 0x0040   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionGetAxis
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_MathQuaternionGetAxis : FRigUnit_MathQuaternionBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              Quaternion;                                                 // 0x0010   (0x0010)  
	TEnumAsByte<EAxis>                                 Axis;                                                       // 0x0020   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0021   (0x0003)  MISSED
	FVector                                            Result;                                                     // 0x0024   (0x000C)  
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionRotateVector
/// Size: 0x0038 (0x000008 - 0x000040)
struct FRigUnit_MathQuaternionRotateVector : FRigUnit_MathQuaternionBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              Quaternion;                                                 // 0x0010   (0x0010)  
	FVector                                            Vector;                                                     // 0x0020   (0x000C)  
	FVector                                            Result;                                                     // 0x002C   (0x000C)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0038   (0x0008)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionUnaryOp
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_MathQuaternionUnaryOp : FRigUnit_MathQuaternionBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              Value;                                                      // 0x0010   (0x0010)  
	FQuat                                              Result;                                                     // 0x0020   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionUnit
/// Size: 0x0000 (0x000030 - 0x000030)
struct FRigUnit_MathQuaternionUnit : FRigUnit_MathQuaternionUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionDot
/// Size: 0x0038 (0x000008 - 0x000040)
struct FRigUnit_MathQuaternionDot : FRigUnit_MathQuaternionBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              A;                                                          // 0x0010   (0x0010)  
	FQuat                                              B;                                                          // 0x0020   (0x0010)  
	float                                              Result;                                                     // 0x0030   (0x0004)  
	unsigned char                                      UnknownData01_6[0xC];                                       // 0x0034   (0x000C)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionSelectBool
/// Size: 0x0038 (0x000008 - 0x000040)
struct FRigUnit_MathQuaternionSelectBool : FRigUnit_MathQuaternionBase
{ 
	bool                                               Condition;                                                  // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0009   (0x0007)  MISSED
	FQuat                                              IfTrue;                                                     // 0x0010   (0x0010)  
	FQuat                                              IfFalse;                                                    // 0x0020   (0x0010)  
	FQuat                                              Result;                                                     // 0x0030   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionNotEquals
/// Size: 0x0038 (0x000008 - 0x000040)
struct FRigUnit_MathQuaternionNotEquals : FRigUnit_MathQuaternionBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              A;                                                          // 0x0010   (0x0010)  
	FQuat                                              B;                                                          // 0x0020   (0x0010)  
	bool                                               Result;                                                     // 0x0030   (0x0001)  
	unsigned char                                      UnknownData01_6[0xF];                                       // 0x0031   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionEquals
/// Size: 0x0038 (0x000008 - 0x000040)
struct FRigUnit_MathQuaternionEquals : FRigUnit_MathQuaternionBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              A;                                                          // 0x0010   (0x0010)  
	FQuat                                              B;                                                          // 0x0020   (0x0010)  
	bool                                               Result;                                                     // 0x0030   (0x0001)  
	unsigned char                                      UnknownData01_6[0xF];                                       // 0x0031   (0x000F)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionSlerp
/// Size: 0x0048 (0x000008 - 0x000050)
struct FRigUnit_MathQuaternionSlerp : FRigUnit_MathQuaternionBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              A;                                                          // 0x0010   (0x0010)  
	FQuat                                              B;                                                          // 0x0020   (0x0010)  
	float                                              T;                                                          // 0x0030   (0x0004)  
	unsigned char                                      UnknownData01_5[0xC];                                       // 0x0034   (0x000C)  MISSED
	FQuat                                              Result;                                                     // 0x0040   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionInverse
/// Size: 0x0000 (0x000030 - 0x000030)
struct FRigUnit_MathQuaternionInverse : FRigUnit_MathQuaternionUnaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionBinaryOp
/// Size: 0x0038 (0x000008 - 0x000040)
struct FRigUnit_MathQuaternionBinaryOp : FRigUnit_MathQuaternionBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              A;                                                          // 0x0010   (0x0010)  
	FQuat                                              B;                                                          // 0x0020   (0x0010)  
	FQuat                                              Result;                                                     // 0x0030   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionMul
/// Size: 0x0000 (0x000040 - 0x000040)
struct FRigUnit_MathQuaternionMul : FRigUnit_MathQuaternionBinaryOp
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionToRotator
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_MathQuaternionToRotator : FRigUnit_MathQuaternionBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              Value;                                                      // 0x0010   (0x0010)  
	FRotator                                           Result;                                                     // 0x0020   (0x000C)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionToEuler
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_MathQuaternionToEuler : FRigUnit_MathQuaternionBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              Value;                                                      // 0x0010   (0x0010)  
	EControlRigRotationOrder                           RotationOrder;                                              // 0x0020   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0021   (0x0003)  MISSED
	FVector                                            Result;                                                     // 0x0024   (0x000C)  
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionScale
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_MathQuaternionScale : FRigUnit_MathQuaternionBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              Value;                                                      // 0x0010   (0x0010)  
	float                                              Scale;                                                      // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_6[0xC];                                       // 0x0024   (0x000C)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionToAxisAndAngle
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_MathQuaternionToAxisAndAngle : FRigUnit_MathQuaternionBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              Value;                                                      // 0x0010   (0x0010)  
	FVector                                            Axis;                                                       // 0x0020   (0x000C)  
	float                                              Angle;                                                      // 0x002C   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionFromTwoVectors
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_MathQuaternionFromTwoVectors : FRigUnit_MathQuaternionBase
{ 
	FVector                                            A;                                                          // 0x0008   (0x000C)  
	FVector                                            B;                                                          // 0x0014   (0x000C)  
	FQuat                                              Result;                                                     // 0x0020   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionFromRotator
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_MathQuaternionFromRotator : FRigUnit_MathQuaternionBase
{ 
	FRotator                                           Rotator;                                                    // 0x0008   (0x000C)  
	unsigned char                                      UnknownData00_5[0xC];                                       // 0x0014   (0x000C)  MISSED
	FQuat                                              Result;                                                     // 0x0020   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionFromEuler
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_MathQuaternionFromEuler : FRigUnit_MathQuaternionBase
{ 
	FVector                                            Euler;                                                      // 0x0008   (0x000C)  
	EControlRigRotationOrder                           RotationOrder;                                              // 0x0014   (0x0001)  
	unsigned char                                      UnknownData00_5[0xB];                                       // 0x0015   (0x000B)  MISSED
	FQuat                                              Result;                                                     // 0x0020   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_MathQuaternionFromAxisAndAngle
/// Size: 0x0028 (0x000008 - 0x000030)
struct FRigUnit_MathQuaternionFromAxisAndAngle : FRigUnit_MathQuaternionBase
{ 
	FVector                                            Axis;                                                       // 0x0008   (0x000C)  
	float                                              Angle;                                                      // 0x0014   (0x0004)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0018   (0x0008)  MISSED
	FQuat                                              Result;                                                     // 0x0020   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_MathRBFInterpolateBase
/// Size: 0x0000 (0x000008 - 0x000008)
struct FRigUnit_MathRBFInterpolateBase : FRigUnit_MathBase
{ 
};

/// Struct /Script/ControlRig.RigUnit_MathRBFInterpolateVectorBase
/// Size: 0x00A8 (0x000008 - 0x0000B0)
struct FRigUnit_MathRBFInterpolateVectorBase : FRigUnit_MathRBFInterpolateBase
{ 
	FVector                                            Input;                                                      // 0x0008   (0x000C)  
	ERBFVectorDistanceType                             DistanceFunction;                                           // 0x0014   (0x0001)  
	ERBFKernelType                                     SmoothingFunction;                                          // 0x0015   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0016   (0x0002)  MISSED
	float                                              SmoothingRadius;                                            // 0x0018   (0x0004)  
	bool                                               bNormalizeOutput;                                           // 0x001C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x001D   (0x0003)  MISSED
	FRigUnit_MathRBFInterpolateVectorWorkData          WorkData;                                                   // 0x0020   (0x0090)  
};

/// Struct /Script/ControlRig.RigUnit_MathRBFInterpolateVectorWorkData
/// Size: 0x0090 (0x000000 - 0x000090)
struct FRigUnit_MathRBFInterpolateVectorWorkData
{ 
	unsigned char                                      UnknownData00_1[0x90];                                      // 0x0000   (0x0090)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathRBFInterpolateVectorXform
/// Size: 0x0040 (0x0000B0 - 0x0000F0)
struct FRigUnit_MathRBFInterpolateVectorXform : FRigUnit_MathRBFInterpolateVectorBase
{ 
	TArray<FMathRBFInterpolateVectorXform_Target>      Targets;                                                    // 0x00B0   (0x0010)  
	FTransform                                         Output;                                                     // 0x00C0   (0x0030)  
};

/// Struct /Script/ControlRig.MathRBFInterpolateVectorXform_Target
/// Size: 0x0040 (0x000000 - 0x000040)
struct FMathRBFInterpolateVectorXform_Target
{ 
	FVector                                            Target;                                                     // 0x0000   (0x000C)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	FTransform                                         Value;                                                      // 0x0010   (0x0030)  
};

/// Struct /Script/ControlRig.RigUnit_MathRBFInterpolateVectorQuat
/// Size: 0x0020 (0x0000B0 - 0x0000D0)
struct FRigUnit_MathRBFInterpolateVectorQuat : FRigUnit_MathRBFInterpolateVectorBase
{ 
	TArray<FMathRBFInterpolateVectorQuat_Target>       Targets;                                                    // 0x00B0   (0x0010)  
	FQuat                                              Output;                                                     // 0x00C0   (0x0010)  
};

/// Struct /Script/ControlRig.MathRBFInterpolateVectorQuat_Target
/// Size: 0x0020 (0x000000 - 0x000020)
struct FMathRBFInterpolateVectorQuat_Target
{ 
	FVector                                            Target;                                                     // 0x0000   (0x000C)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	FQuat                                              Value;                                                      // 0x0010   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_MathRBFInterpolateVectorColor
/// Size: 0x0020 (0x0000B0 - 0x0000D0)
struct FRigUnit_MathRBFInterpolateVectorColor : FRigUnit_MathRBFInterpolateVectorBase
{ 
	TArray<FMathRBFInterpolateVectorColor_Target>      Targets;                                                    // 0x00B0   (0x0010)  
	FLinearColor                                       Output;                                                     // 0x00C0   (0x0010)  
};

/// Struct /Script/ControlRig.MathRBFInterpolateVectorColor_Target
/// Size: 0x001C (0x000000 - 0x00001C)
struct FMathRBFInterpolateVectorColor_Target
{ 
	FVector                                            Target;                                                     // 0x0000   (0x000C)  
	FLinearColor                                       Value;                                                      // 0x000C   (0x0010)  
};

/// Struct /Script/ControlRig.RigUnit_MathRBFInterpolateVectorVector
/// Size: 0x0020 (0x0000B0 - 0x0000D0)
struct FRigUnit_MathRBFInterpolateVectorVector : FRigUnit_MathRBFInterpolateVectorBase
{ 
	TArray<FMathRBFInterpolateVectorVector_Target>     Targets;                                                    // 0x00B0   (0x0010)  
	FVector                                            Output;                                                     // 0x00C0   (0x000C)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x00CC   (0x0004)  MISSED
};

/// Struct /Script/ControlRig.MathRBFInterpolateVectorVector_Target
/// Size: 0x0018 (0x000000 - 0x000018)
struct FMathRBFInterpolateVectorVector_Target
{ 
	FVector                                            Target;                                                     // 0x0000   (0x000C)  
	FVector                                            Value;                                                      // 0x000C   (0x000C)  
};

/// Struct /Script/ControlRig.RigUnit_MathRBFInterpolateVectorFloat
/// Size: 0x0020 (0x0000B0 - 0x0000D0)
struct FRigUnit_MathRBFInterpolateVectorFloat : FRigUnit_MathRBFInterpolateVectorBase
{ 
	TArray<FMathRBFInterpolateVectorFloat_Target>      Targets;                                                    // 0x00B0   (0x0010)  
	float                                              Output;                                                     // 0x00C0   (0x0004)  
	unsigned char                                      UnknownData00_6[0xC];                                       // 0x00C4   (0x000C)  MISSED
};

/// Struct /Script/ControlRig.MathRBFInterpolateVectorFloat_Target
/// Size: 0x0010 (0x000000 - 0x000010)
struct FMathRBFInterpolateVectorFloat_Target
{ 
	FVector                                            Target;                                                     // 0x0000   (0x000C)  
	float                                              Value;                                                      // 0x000C   (0x0004)  
};

/// Struct /Script/ControlRig.RigUnit_MathRBFInterpolateQuatBase
/// Size: 0x00C8 (0x000008 - 0x0000D0)
struct FRigUnit_MathRBFInterpolateQuatBase : FRigUnit_MathRBFInterpolateBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FQuat                                              Input;                                                      // 0x0010   (0x0010)  
	ERBFQuatDistanceType                               DistanceFunction;                                           // 0x0020   (0x0001)  
	ERBFKernelType                                     SmoothingFunction;                                          // 0x0021   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x0022   (0x0002)  MISSED
	float                                              SmoothingAngle;                                             // 0x0024   (0x0004)  
	bool                                               bNormalizeOutput;                                           // 0x0028   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0029   (0x0003)  MISSED
	FVector                                            TwistAxis;                                                  // 0x002C   (0x000C)  
	unsigned char                                      UnknownData03_5[0x8];                                       // 0x0038   (0x0008)  MISSED
	FRigUnit_MathRBFInterpolateQuatWorkData            WorkData;                                                   // 0x0040   (0x0090)  
};

/// Struct /Script/ControlRig.RigUnit_MathRBFInterpolateQuatWorkData
/// Size: 0x0090 (0x000000 - 0x000090)
struct FRigUnit_MathRBFInterpolateQuatWorkData
{ 
	unsigned char                                      UnknownData00_1[0x90];                                      // 0x0000   (0x0090)  MISSED
};

/// Struct /Script/ControlRig.RigUnit_MathRBFInterpolateQuatXform
/// Size: 0x0040 (0x0000D0 - 0x000110)
struct FRigUnit_MathRBFInterpolateQuatXform : FRigUnit_MathRBFInterpolateQuatBase
{ 
	TArray<FMathRBFInterpolateQuatXform_Target>        Targets;                                                    // 0x00D0   (0x0010)  
	FTransform                                         Output;                                                     // 0x00E0   (0x0030)  
};

/// Struct /Script/ControlRig.MathRBFInterpolateQuatXform_Target
/// Size: 0x0040 (0x000000 - 0x000040)
struct FMathRBFInterpolateQuatXform_Target
{ 
	FQuat                                              Target;                                                     // 0x0000   (0x0010)  
	FTransform                                         Value;                                                      // 0x0010   (0x0030)  
};

/// Struct /Script/ControlRig.RigUnit_MathRBFInterpolateQuatQuat
/// Size: 0x0020 (0x0000D0 - 0x0000F0)
struct FRigUnit_MathRBFInterpolateQuatQuat : FRigUnit_MathRBFInterpolateQuatBase
{ 
	TArray<FMathRBFInterpolateQuatQuat_Target>         Targets;                                                    // 0x00D0   (0x0010)  
	FQuat                                              Output;                                                     // 0x00E0   (0x0010)  
};

/// Struct /Script/ControlRig.MathRBFInterpolateQuatQuat_Target
/// Size: 0x0020 (0x000000 - 0x000020)
struct FMathRBFInterpolateQuatQuat_Target
{ 
	FQuat                                              Target;                                                     // 0x0000   (0x0010)  
