/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package Engine.

/// Class /Script/Engine.Actor
/// Size: 0x01F8 (0x000028 - 0x000220)
class AActor : public UObject
{ 
public:
	FActorTickFunction                                 PrimaryActorTick;                                           // 0x0028   (0x0030)  
	bool                                               bNetTemporary;                                              // 0x0058:0 (0x0001)  
	bool                                               bNetStartup;                                                // 0x0058:1 (0x0001)  
	bool                                               bOnlyRelevantToOwner;                                       // 0x0058:2 (0x0001)  
	bool                                               bAlwaysRelevant;                                            // 0x0058:3 (0x0001)  
	bool                                               bReplicateMovement;                                         // 0x0058:4 (0x0001)  
	bool                                               bHidden;                                                    // 0x0058:5 (0x0001)  
	bool                                               bTearOff;                                                   // 0x0058:6 (0x0001)  
	bool                                               bExchangedRoles;                                            // 0x0058:7 (0x0001)  
	bool                                               bNetLoadOnClient;                                           // 0x0059:0 (0x0001)  
	bool                                               bNetUseOwnerRelevancy;                                      // 0x0059:1 (0x0001)  
	bool                                               bRelevantForNetworkReplays;                                 // 0x0059:2 (0x0001)  
	bool                                               bRelevantForLevelBounds;                                    // 0x0059:3 (0x0001)  
	bool                                               bReplayRewindable;                                          // 0x0059:4 (0x0001)  
	bool                                               bAllowTickBeforeBeginPlay;                                  // 0x0059:5 (0x0001)  
	bool                                               bAutoDestroyWhenFinished;                                   // 0x0059:6 (0x0001)  
	bool                                               bCanBeDamaged;                                              // 0x0059:7 (0x0001)  
	bool                                               bBlockInput;                                                // 0x005A:0 (0x0001)  
	bool                                               bCollideWhenPlacing;                                        // 0x005A:1 (0x0001)  
	bool                                               bFindCameraComponentWhenViewTarget;                         // 0x005A:2 (0x0001)  
	bool                                               bGenerateOverlapEventsDuringLevelStreaming;                 // 0x005A:3 (0x0001)  
	bool                                               bIgnoresOriginShifting;                                     // 0x005A:4 (0x0001)  
	bool                                               bEnableAutoLODGeneration;                                   // 0x005A:5 (0x0001)  
	bool                                               bIsEditorOnlyActor;                                         // 0x005A:6 (0x0001)  
	bool                                               bActorSeamlessTraveled;                                     // 0x005A:7 (0x0001)  
	bool                                               bReplicates;                                                // 0x005B:0 (0x0001)  
	bool                                               bCanBeInCluster;                                            // 0x005B:1 (0x0001)  
	bool                                               bAllowReceiveTickEventOnDedicatedServer;                    // 0x005B:2 (0x0001)  
	unsigned char                                      UnknownBit00 : 1;                                           // 0x005B:3 (0x0001)  MISSED
	unsigned char                                      UnknownBit01 : 1;                                           // 0x005B:4 (0x0001)  MISSED
	unsigned char                                      UnknownBit02 : 1;                                           // 0x005B:5 (0x0001)  MISSED
	unsigned char                                      UnknownBit03 : 1;                                           // 0x005B:6 (0x0001)  MISSED
	unsigned char                                      UnknownBit04 : 1;                                           // 0x005B:7 (0x0001)  MISSED
	unsigned char                                      UnknownBit05 : 1;                                           // 0x005C:0 (0x0001)  MISSED
	unsigned char                                      UnknownBit06 : 1;                                           // 0x005C:1 (0x0001)  MISSED
	bool                                               bActorEnableCollision;                                      // 0x005C:2 (0x0001)  
	bool                                               bActorIsBeingDestroyed;                                     // 0x005C:3 (0x0001)  
	EActorUpdateOverlapsMethod                         UpdateOverlapsMethodDuringLevelStreaming;                   // 0x005D   (0x0001)  
	EActorUpdateOverlapsMethod                         DefaultUpdateOverlapsMethodDuringLevelStreaming;            // 0x005E   (0x0001)  
	TEnumAsByte<ENetRole>                              RemoteRole;                                                 // 0x005F   (0x0001)  
	FRepMovement                                       ReplicatedMovement;                                         // 0x0060   (0x0034)  
	float                                              InitialLifeSpan;                                            // 0x0094   (0x0004)  
	float                                              CustomTimeDilation;                                         // 0x0098   (0x0004)  
	unsigned char                                      UnknownData07_5[0x4];                                       // 0x009C   (0x0004)  MISSED
	FRepAttachment                                     AttachmentReplication;                                      // 0x00A0   (0x0040)  
	AActor*                                            Owner;                                                      // 0x00E0   (0x0008)  
	FName                                              NetDriverName;                                              // 0x00E8   (0x0008)  
	TEnumAsByte<ENetRole>                              Role;                                                       // 0x00F0   (0x0001)  
	TEnumAsByte<ENetDormancy>                          NetDormancy;                                                // 0x00F1   (0x0001)  
	ESpawnActorCollisionHandlingMethod                 SpawnCollisionHandlingMethod;                               // 0x00F2   (0x0001)  
	TEnumAsByte<EAutoReceiveInput>                     AutoReceiveInput;                                           // 0x00F3   (0x0001)  
	int32_t                                            InputPriority;                                              // 0x00F4   (0x0004)  
	UInputComponent*                                   InputComponent;                                             // 0x00F8   (0x0008)  
	float                                              NetCullDistanceSquared;                                     // 0x0100   (0x0004)  
	int32_t                                            NetTag;                                                     // 0x0104   (0x0004)  
	float                                              NetUpdateFrequency;                                         // 0x0108   (0x0004)  
	float                                              MinNetUpdateFrequency;                                      // 0x010C   (0x0004)  
	float                                              NetPriority;                                                // 0x0110   (0x0004)  
	unsigned char                                      UnknownData08_5[0x4];                                       // 0x0114   (0x0004)  MISSED
	APawn*                                             Instigator;                                                 // 0x0118   (0x0008)  
	TArray<AActor*>                                    Children;                                                   // 0x0120   (0x0010)  
	USceneComponent*                                   RootComponent;                                              // 0x0130   (0x0008)  
	TArray<AMatineeActor*>                             ControllingMatineeActors;                                   // 0x0138   (0x0010)  
	unsigned char                                      UnknownData09_5[0x8];                                       // 0x0148   (0x0008)  MISSED
	TArray<FName>                                      Layers;                                                     // 0x0150   (0x0010)  
	TWeakObjectPtr<UChildActorComponent*>              ParentComponent;                                            // 0x0160   (0x0008)  
	unsigned char                                      UnknownData10_5[0x8];                                       // 0x0168   (0x0008)  MISSED
	TArray<FName>                                      Tags;                                                       // 0x0170   (0x0010)  
	FMulticastSparseDelegate                           OnTakeAnyDamage;                                            // 0x0180   (0x0001)  
	FMulticastSparseDelegate                           OnTakePointDamage;                                          // 0x0181   (0x0001)  
	FMulticastSparseDelegate                           OnTakeRadialDamage;                                         // 0x0182   (0x0001)  
	FMulticastSparseDelegate                           OnActorBeginOverlap;                                        // 0x0183   (0x0001)  
	FMulticastSparseDelegate                           OnActorEndOverlap;                                          // 0x0184   (0x0001)  
	FMulticastSparseDelegate                           OnBeginCursorOver;                                          // 0x0185   (0x0001)  
	FMulticastSparseDelegate                           OnEndCursorOver;                                            // 0x0186   (0x0001)  
	FMulticastSparseDelegate                           OnClicked;                                                  // 0x0187   (0x0001)  
	FMulticastSparseDelegate                           OnReleased;                                                 // 0x0188   (0x0001)  
	FMulticastSparseDelegate                           OnInputTouchBegin;                                          // 0x0189   (0x0001)  
	FMulticastSparseDelegate                           OnInputTouchEnd;                                            // 0x018A   (0x0001)  
	FMulticastSparseDelegate                           OnInputTouchEnter;                                          // 0x018B   (0x0001)  
	FMulticastSparseDelegate                           OnInputTouchLeave;                                          // 0x018C   (0x0001)  
	FMulticastSparseDelegate                           OnActorHit;                                                 // 0x018D   (0x0001)  
	FMulticastSparseDelegate                           OnDestroyed;                                                // 0x018E   (0x0001)  
	FMulticastSparseDelegate                           OnEndPlay;                                                  // 0x018F   (0x0001)  
	unsigned char                                      UnknownData11_5[0x60];                                      // 0x0190   (0x0060)  MISSED
	TArray<UActorComponent*>                           InstanceComponents;                                         // 0x01F0   (0x0010)  
	TArray<UActorComponent*>                           BlueprintCreatedComponents;                                 // 0x0200   (0x0010)  
	unsigned char                                      UnknownData12_6[0x10];                                      // 0x0210   (0x0010)  MISSED


	/// Functions
	// Function /Script/Engine.Actor.WasRecentlyRendered
	bool WasRecentlyRendered(float Tolerance);                                                                               // [0x3864b90] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.UserConstructionScript
	void UserConstructionScript();                                                                                           // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Actor.TearOff
	void TearOff();                                                                                                          // [0x2925aa0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.SnapRootComponentTo
	void SnapRootComponentTo(AActor* InParentActor, FName InSocketName);                                                     // [0x38666e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.SetTickGroup
	void SetTickGroup(TEnumAsByte<ETickingGroup> NewTickGroup);                                                              // [0x3864c70] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.SetTickableWhenPaused
	void SetTickableWhenPaused(bool bTickableWhenPaused);                                                                    // [0x3865d70] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.SetReplicates
	void SetReplicates(bool bInReplicates);                                                                                  // [0x386cd60] Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.SetReplicateMovement
	void SetReplicateMovement(bool bInReplicateMovement);                                                                    // [0x386cc80] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.SetOwner
	void SetOwner(AActor* NewOwner);                                                                                         // [0x3865640] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.SetNetDormancy
	void SetNetDormancy(TEnumAsByte<ENetDormancy> NewDormancy);                                                              // [0x3865350] Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.SetLifeSpan
	void SetLifeSpan(float InLifespan);                                                                                      // [0x3865980] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.SetAutoDestroyWhenFinished
	void SetAutoDestroyWhenFinished(bool bVal);                                                                              // [0x386ce40] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.SetActorTickInterval
	void SetActorTickInterval(float TickInterval);                                                                           // [0x3865760] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.SetActorTickEnabled
	void SetActorTickEnabled(bool bEnabled);                                                                                 // [0x3865850] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.SetActorScale3D
	void SetActorScale3D(FVector NewScale3D);                                                                                // [0x386b650] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.SetActorRelativeScale3D
	void SetActorRelativeScale3D(FVector NewRelativeScale);                                                                  // [0x3868410] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.SetActorHiddenInGame
	void SetActorHiddenInGame(bool bNewHidden);                                                                              // [0x38682c0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.SetActorEnableCollision
	void SetActorEnableCollision(bool bNewActorEnableCollision);                                                             // [0x38681e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.RemoveTickPrerequisiteComponent
	void RemoveTickPrerequisiteComponent(UActorComponent* PrerequisiteComponent);                                            // [0x3865e70] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.RemoveTickPrerequisiteActor
	void RemoveTickPrerequisiteActor(AActor* PrerequisiteActor);                                                             // [0x3865f50] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Actor.ReceiveRadialDamage
	void ReceiveRadialDamage(float DamageReceived, UDamageType* DamageType, FVector Origin, FHitResult& HitInfo, AController* InstigatedBy, AActor* DamageCauser); // [0x1ad0090] BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent 
	// Function /Script/Engine.Actor.ReceivePointDamage
	void ReceivePointDamage(float Damage, UDamageType* DamageType, FVector HitLocation, FVector HitNormal, UPrimitiveComponent* HitComponent, FName BoneName, FVector ShotFromDirection, AController* InstigatedBy, AActor* DamageCauser, FHitResult& HitInfo); // [0x1ad0090] BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent 
	// Function /Script/Engine.Actor.ReceiveHit
	void ReceiveHit(UPrimitiveComponent* MyComp, AActor* Other, UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult& Hit); // [0x1ad0090] Event|Public|HasOutParms|HasDefaults|BlueprintEvent 
	// Function /Script/Engine.Actor.ReceiveEndPlay
	void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);                                                          // [0x1ad0090] Event|Protected|BlueprintEvent 
	// Function /Script/Engine.Actor.ReceiveDestroyed
	void ReceiveDestroyed();                                                                                                 // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Actor.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x1ad0090] Event|Protected|BlueprintEvent 
	// Function /Script/Engine.Actor.ReceiveAnyDamage
	void ReceiveAnyDamage(float Damage, UDamageType* DamageType, AController* InstigatedBy, AActor* DamageCauser);           // [0x1ad0090] BlueprintAuthorityOnly|Event|Public|BlueprintEvent 
	// Function /Script/Engine.Actor.ReceiveActorOnReleased
	void ReceiveActorOnReleased(FKey ButtonReleased);                                                                        // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Actor.ReceiveActorOnInputTouchLeave
	void ReceiveActorOnInputTouchLeave(TEnumAsByte<ETouchIndex> FingerIndex);                                                // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Actor.ReceiveActorOnInputTouchEnter
	void ReceiveActorOnInputTouchEnter(TEnumAsByte<ETouchIndex> FingerIndex);                                                // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Actor.ReceiveActorOnInputTouchEnd
	void ReceiveActorOnInputTouchEnd(TEnumAsByte<ETouchIndex> FingerIndex);                                                  // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Actor.ReceiveActorOnInputTouchBegin
	void ReceiveActorOnInputTouchBegin(TEnumAsByte<ETouchIndex> FingerIndex);                                                // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Actor.ReceiveActorOnClicked
	void ReceiveActorOnClicked(FKey ButtonPressed);                                                                          // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Actor.ReceiveActorEndOverlap
	void ReceiveActorEndOverlap(AActor* OtherActor);                                                                         // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Actor.ReceiveActorEndCursorOver
	void ReceiveActorEndCursorOver();                                                                                        // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Actor.ReceiveActorBeginOverlap
	void ReceiveActorBeginOverlap(AActor* OtherActor);                                                                       // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Actor.ReceiveActorBeginCursorOver
	void ReceiveActorBeginCursorOver();                                                                                      // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Actor.PrestreamTextures
	void PrestreamTextures(float Seconds, bool bEnableStreaming, int32_t CinematicTextureGroups);                            // [0x3864970] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.OnRep_ReplicateMovement
	void OnRep_ReplicateMovement();                                                                                          // [0x2925ac0] Native|Public        
	// Function /Script/Engine.Actor.OnRep_ReplicatedMovement
	void OnRep_ReplicatedMovement();                                                                                         // [0x3865720] Native|Public        
	// Function /Script/Engine.Actor.OnRep_Owner
	void OnRep_Owner();                                                                                                      // [0x17c67d0] Native|Protected     
	// Function /Script/Engine.Actor.OnRep_Instigator
	void OnRep_Instigator();                                                                                                 // [0x386cc40] Native|Public        
	// Function /Script/Engine.Actor.OnRep_AttachmentReplication
	void OnRep_AttachmentReplication();                                                                                      // [0x2925920] Native|Public        
	// Function /Script/Engine.Actor.MakeNoise
	void MakeNoise(float Loudness, APawn* NoiseInstigator, FVector NoiseLocation, float MaxRange, FName Tag);                // [0x3863c90] Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.MakeMIDForMaterial
	UMaterialInstanceDynamic* MakeMIDForMaterial(UMaterialInterface* Parent);                                                // [0x3049380] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_TeleportTo
	bool K2_TeleportTo(FVector DestLocation, FRotator DestRotation);                                                         // [0x3864f50] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_SetActorTransform
	bool K2_SetActorTransform(FTransform& NewTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);            // [0x3869870] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_SetActorRotation
	bool K2_SetActorRotation(FRotator NewRotation, bool bTeleportPhysics);                                                   // [0x386bab0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_SetActorRelativeTransform
	void K2_SetActorRelativeTransform(FTransform& NewRelativeTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // [0x38684f0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_SetActorRelativeRotation
	void K2_SetActorRelativeRotation(FRotator NewRelativeRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // [0x3868810] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_SetActorRelativeLocation
	void K2_SetActorRelativeLocation(FVector NewRelativeLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);  // [0x3868ad0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_SetActorLocationAndRotation
	bool K2_SetActorLocationAndRotation(FVector NewLocation, FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // [0x386b740] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_SetActorLocation
	bool K2_SetActorLocation(FVector NewLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);                  // [0x386c2c0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_OnReset
	void K2_OnReset();                                                                                                       // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Actor.K2_OnEndViewTarget
	void K2_OnEndViewTarget(APlayerController* PC);                                                                          // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Actor.K2_OnBecomeViewTarget
	void K2_OnBecomeViewTarget(APlayerController* PC);                                                                       // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Actor.K2_GetRootComponent
	USceneComponent* K2_GetRootComponent();                                                                                  // [0x386bca0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.K2_GetComponentsByClass
	TArray<UActorComponent*> K2_GetComponentsByClass(UClass* ComponentClass);                                                // [0x3864570] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.K2_GetActorRotation
	FRotator K2_GetActorRotation();                                                                                          // [0x386c200] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.K2_GetActorLocation
	FVector K2_GetActorLocation();                                                                                           // [0x386c590] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.K2_DetachFromActor
	void K2_DetachFromActor(EDetachmentRule LocationRule, EDetachmentRule RotationRule, EDetachmentRule ScaleRule);          // [0x3866390] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_DestroyComponent
	void K2_DestroyComponent(UActorComponent* Component);                                                                    // [0x3867500] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_DestroyActor
	void K2_DestroyActor();                                                                                                  // [0x3868190] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_AttachToComponent
	void K2_AttachToComponent(USceneComponent* Parent, FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // [0x3866ed0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_AttachToActor
	void K2_AttachToActor(AActor* ParentActor, FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // [0x3866870] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_AttachRootComponentToActor
	void K2_AttachRootComponentToActor(AActor* InParentActor, FName InSocketName, TEnumAsByte<EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies); // [0x3866c10] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_AttachRootComponentTo
	void K2_AttachRootComponentTo(USceneComponent* InParent, FName InSocketName, TEnumAsByte<EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies); // [0x3867250] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_AddActorWorldTransformKeepScale
	void K2_AddActorWorldTransformKeepScale(FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // [0x3869ba0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_AddActorWorldTransform
	void K2_AddActorWorldTransform(FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);     // [0x3869ec0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_AddActorWorldRotation
	void K2_AddActorWorldRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);          // [0x386a1e0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_AddActorWorldOffset
	void K2_AddActorWorldOffset(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);             // [0x386a4a0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_AddActorLocalTransform
	void K2_AddActorLocalTransform(FTransform& NewTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);       // [0x3868d90] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_AddActorLocalRotation
	void K2_AddActorLocalRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);          // [0x3869150] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.K2_AddActorLocalOffset
	void K2_AddActorLocalOffset(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);             // [0x38694e0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.IsOverlappingActor
	bool IsOverlappingActor(AActor* Other);                                                                                  // [0x3865550] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.IsChildActor
	bool IsChildActor();                                                                                                     // [0x3865300] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.IsActorTickEnabled
	bool IsActorTickEnabled();                                                                                               // [0x3865830] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.IsActorBeingDestroyed
	bool IsActorBeingDestroyed();                                                                                            // [0x3865cd0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.HasAuthority
	bool HasAuthority();                                                                                                     // [0x3868160] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetVerticalDistanceTo
	float GetVerticalDistanceTo(AActor* OtherActor);                                                                         // [0x386af20] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetVelocity
	FVector GetVelocity();                                                                                                   // [0x386bc60] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetTransform
	FTransform GetTransform();                                                                                               // [0x386c610] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetTickableWhenPaused
	bool GetTickableWhenPaused();                                                                                            // [0x3865e50] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.GetSquaredDistanceTo
	float GetSquaredDistanceTo(AActor* OtherActor);                                                                          // [0x386b250] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetRemoteRole
	TEnumAsByte<ENetRole> GetRemoteRole();                                                                                   // [0x386cc60] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetParentComponent
	UChildActorComponent* GetParentComponent();                                                                              // [0x3865140] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetParentActor
	AActor* GetParentActor();                                                                                                // [0x38650f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetOwner
	AActor* GetOwner();                                                                                                      // [0x2954c40] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetOverlappingComponents
	void GetOverlappingComponents(TArray<UPrimitiveComponent*>& OverlappingComponents);                                      // [0x3865a50] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetOverlappingActors
	void GetOverlappingActors(TArray<AActor*>& OverlappingActors, UClass* ClassFilter);                                      // [0x3865b40] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetLocalRole
	TEnumAsByte<ENetRole> GetLocalRole();                                                                                    // [0x2db51f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetLifeSpan
	float GetLifeSpan();                                                                                                     // [0x3865940] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetInstigatorController
	AController* GetInstigatorController();                                                                                  // [0x386c660] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetInstigator
	APawn* GetInstigator();                                                                                                  // [0x386c6a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetInputVectorAxisValue
	FVector GetInputVectorAxisValue(FKey InputAxisKey);                                                                      // [0x386c6c0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetInputAxisValue
	float GetInputAxisValue(FName InputAxisName);                                                                            // [0x386c950] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetInputAxisKeyValue
	float GetInputAxisKeyValue(FKey InputAxisKey);                                                                           // [0x386c810] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetHorizontalDotProductTo
	float GetHorizontalDotProductTo(AActor* OtherActor);                                                                     // [0x386a860] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetHorizontalDistanceTo
	float GetHorizontalDistanceTo(AActor* OtherActor);                                                                       // [0x386b0b0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetGameTimeSinceCreation
	float GetGameTimeSinceCreation();                                                                                        // [0x3865d00] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetDotProductTo
	float GetDotProductTo(AActor* OtherActor);                                                                               // [0x386abb0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetDistanceTo
	float GetDistanceTo(AActor* OtherActor);                                                                                 // [0x386b410] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetComponentsByTag
	TArray<UActorComponent*> GetComponentsByTag(UClass* ComponentClass, FName Tag);                                          // [0x38643c0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetComponentsByInterface
	TArray<UActorComponent*> GetComponentsByInterface(UClass* Interface);                                                    // [0x3863fa0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetComponentByClass
	UActorComponent* GetComponentByClass(UClass* ComponentClass);                                                            // [0x38646f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetAttachParentSocketName
	FName GetAttachParentSocketName();                                                                                       // [0x3864ed0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetAttachParentActor
	AActor* GetAttachParentActor();                                                                                          // [0x3864f10] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetAttachedActors
	void GetAttachedActors(TArray<AActor*>& OutActors, bool bResetArray);                                                    // [0x3864d40] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetAllChildActors
	void GetAllChildActors(TArray<AActor*>& ChildActors, bool bIncludeDescendants);                                          // [0x3865170] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetActorUpVector
	FVector GetActorUpVector();                                                                                              // [0x386c040] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetActorTimeDilation
	float GetActorTimeDilation();                                                                                            // [0x38661f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetActorTickInterval
	float GetActorTickInterval();                                                                                            // [0x3865740] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetActorScale3D
	FVector GetActorScale3D();                                                                                               // [0x386b5d0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetActorRightVector
	FVector GetActorRightVector();                                                                                           // [0x386bf60] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetActorRelativeScale3D
	FVector GetActorRelativeScale3D();                                                                                       // [0x38683a0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetActorForwardVector
	FVector GetActorForwardVector();                                                                                         // [0x386c120] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetActorEyesViewPoint
	void GetActorEyesViewPoint(FVector& OutLocation, FRotator& OutRotation);                                                 // [0x38647e0] Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetActorEnableCollision
	bool GetActorEnableCollision();                                                                                          // [0x38681b0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.GetActorBounds
	void GetActorBounds(bool bOnlyCollidingComponents, FVector& Origin, FVector& BoxExtent, bool bIncludeFromChildActors);   // [0x386bcc0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Actor.ForceNetUpdate
	void ForceNetUpdate();                                                                                                   // [0x3864b70] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.FlushNetDormancy
	void FlushNetDormancy();                                                                                                 // [0x3865330] Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.FinishAddComponent
	void FinishAddComponent(UActorComponent* Component, bool bManualAttachment, FTransform& RelativeTransform);              // [0x38675f0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.EnableInput
	void EnableInput(APlayerController* PlayerController);                                                                   // [0x386cb60] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.DisableInput
	void DisableInput(APlayerController* PlayerController);                                                                  // [0x2ea13a0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.DetachRootComponentFromParent
	void DetachRootComponentFromParent(bool bMaintainWorldPosition);                                                         // [0x3866590] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.AddTickPrerequisiteComponent
	void AddTickPrerequisiteComponent(UActorComponent* PrerequisiteComponent);                                               // [0x3866030] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.AddTickPrerequisiteActor
	void AddTickPrerequisiteActor(AActor* PrerequisiteActor);                                                                // [0x3866110] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Actor.AddComponentByClass
	UActorComponent* AddComponentByClass(UClass* Class, bool bManualAttachment, FTransform& RelativeTransform, bool bDeferredFinish); // [0x3867a40] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.AddComponent
	UActorComponent* AddComponent(FName TemplateName, bool bManualAttachment, FTransform& RelativeTransform, UObject* ComponentTemplateContext, bool bDeferredFinish); // [0x3867df0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Actor.ActorHasTag
	bool ActorHasTag(FName Tag);                                                                                             // [0x3866260] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Engine.AnimNotify
/// Size: 0x0010 (0x000028 - 0x000038)
class UAnimNotify : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0028   (0x0010)  MISSED
};

/// Class /Script/Engine.ActorComponent
/// Size: 0x0088 (0x000028 - 0x0000B0)
class UActorComponent : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FActorComponentTickFunction                        PrimaryComponentTick;                                       // 0x0030   (0x0030)  
	TArray<FName>                                      ComponentTags;                                              // 0x0060   (0x0010)  
	TArray<UAssetUserData*>                            AssetUserData;                                              // 0x0070   (0x0010)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0080   (0x0004)  MISSED
	int32_t                                            UCSSerializationIndex;                                      // 0x0084   (0x0004)  
	unsigned char                                      UnknownBit02 : 1;                                           // 0x0088:0 (0x0001)  MISSED
	unsigned char                                      UnknownBit03 : 1;                                           // 0x0088:1 (0x0001)  MISSED
	unsigned char                                      UnknownBit04 : 1;                                           // 0x0088:2 (0x0001)  MISSED
	bool                                               bNetAddressable;                                            // 0x0088:3 (0x0001)  
	bool                                               bReplicates;                                                // 0x0088:4 (0x0001)  
	unsigned char                                      UnknownBit05 : 1;                                           // 0x0088:5 (0x0001)  MISSED
	unsigned char                                      UnknownBit06 : 1;                                           // 0x0088:6 (0x0001)  MISSED
	unsigned char                                      UnknownBit07 : 1;                                           // 0x0088:7 (0x0001)  MISSED
	unsigned char                                      UnknownBit08 : 1;                                           // 0x0089:0 (0x0001)  MISSED
	unsigned char                                      UnknownBit09 : 1;                                           // 0x0089:1 (0x0001)  MISSED
	unsigned char                                      UnknownBit10 : 1;                                           // 0x0089:2 (0x0001)  MISSED
	unsigned char                                      UnknownBit11 : 1;                                           // 0x0089:3 (0x0001)  MISSED
	unsigned char                                      UnknownBit12 : 1;                                           // 0x0089:4 (0x0001)  MISSED
	unsigned char                                      UnknownBit13 : 1;                                           // 0x0089:5 (0x0001)  MISSED
	unsigned char                                      UnknownBit14 : 1;                                           // 0x0089:6 (0x0001)  MISSED
	bool                                               bAutoActivate;                                              // 0x0089:7 (0x0001)  
	bool                                               bIsActive;                                                  // 0x008A:0 (0x0001)  
	bool                                               bEditableWhenInherited;                                     // 0x008A:1 (0x0001)  
	unsigned char                                      UnknownBit15 : 1;                                           // 0x008A:2 (0x0001)  MISSED
	bool                                               bCanEverAffectNavigation;                                   // 0x008A:3 (0x0001)  
	unsigned char                                      UnknownBit16 : 1;                                           // 0x008A:4 (0x0001)  MISSED
	bool                                               bIsEditorOnly;                                              // 0x008A:5 (0x0001)  
	unsigned char                                      UnknownData17_4[0x1];                                       // 0x008B   (0x0001)  MISSED
	EComponentCreationMethod                           CreationMethod;                                             // 0x008C   (0x0001)  
	FMulticastSparseDelegate                           OnComponentActivated;                                       // 0x008D   (0x0001)  
	FMulticastSparseDelegate                           OnComponentDeactivated;                                     // 0x008E   (0x0001)  
	unsigned char                                      UnknownData18_5[0x1];                                       // 0x008F   (0x0001)  MISSED
	TArray<FSimpleMemberReference>                     UCSModifiedProperties;                                      // 0x0090   (0x0010)  
	unsigned char                                      UnknownData19_6[0x10];                                      // 0x00A0   (0x0010)  MISSED


	/// Functions
	// Function /Script/Engine.ActorComponent.ToggleActive
	void ToggleActive();                                                                                                     // [0x17c67d0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.ActorComponent.SetTickGroup
	void SetTickGroup(TEnumAsByte<ETickingGroup> NewTickGroup);                                                              // [0x386f660] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.ActorComponent.SetTickableWhenPaused
	void SetTickableWhenPaused(bool bTickableWhenPaused);                                                                    // [0x386fcf0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.ActorComponent.SetIsReplicated
	void SetIsReplicated(bool ShouldReplicate);                                                                              // [0x386fc10] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.ActorComponent.SetComponentTickIntervalAndCooldown
	void SetComponentTickIntervalAndCooldown(float TickInterval);                                                            // [0x386f960] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.ActorComponent.SetComponentTickInterval
	void SetComponentTickInterval(float TickInterval);                                                                       // [0x386fa30] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.ActorComponent.SetComponentTickEnabled
	void SetComponentTickEnabled(bool bEnabled);                                                                             // [0x386fb30] Native|Public|BlueprintCallable 
	// Function /Script/Engine.ActorComponent.SetAutoActivate
	void SetAutoActivate(bool bNewAutoActivate);                                                                             // [0x386cc80] Native|Public|BlueprintCallable 
	// Function /Script/Engine.ActorComponent.SetActive
	void SetActive(bool bNewActive, bool bReset);                                                                            // [0x386fdd0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.ActorComponent.RemoveTickPrerequisiteComponent
	void RemoveTickPrerequisiteComponent(UActorComponent* PrerequisiteComponent);                                            // [0x386f2e0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.ActorComponent.RemoveTickPrerequisiteActor
	void RemoveTickPrerequisiteActor(AActor* PrerequisiteActor);                                                             // [0x386f3c0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.ActorComponent.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.ActorComponent.ReceiveEndPlay
	void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);                                                          // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.ActorComponent.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.ActorComponent.OnRep_IsActive
	void OnRep_IsActive();                                                                                                   // [0x2925ac0] Native|Public        
	// Function /Script/Engine.ActorComponent.K2_DestroyComponent
	void K2_DestroyComponent(UObject* Object);                                                                               // [0x386f730] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.ActorComponent.IsComponentTickEnabled
	bool IsComponentTickEnabled();                                                                                           // [0x386fb00] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.ActorComponent.IsBeingDestroyed
	bool IsBeingDestroyed();                                                                                                 // [0x3870090] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.ActorComponent.IsActive
	bool IsActive();                                                                                                         // [0xb5c300] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.ActorComponent.GetOwner
	AActor* GetOwner();                                                                                                      // [0x3870070] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.ActorComponent.GetComponentTickInterval
	float GetComponentTickInterval();                                                                                        // [0x386f940] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.ActorComponent.Deactivate
	void Deactivate();                                                                                                       // [0x2925a80] Native|Public|BlueprintCallable 
	// Function /Script/Engine.ActorComponent.ComponentHasTag
	bool ComponentHasTag(FName Tag);                                                                                         // [0x386ff50] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.ActorComponent.AddTickPrerequisiteComponent
	void AddTickPrerequisiteComponent(UActorComponent* PrerequisiteComponent);                                               // [0x386f4a0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.ActorComponent.AddTickPrerequisiteActor
	void AddTickPrerequisiteActor(AActor* PrerequisiteActor);                                                                // [0x386f580] Native|Public|BlueprintCallable 
	// Function /Script/Engine.ActorComponent.Activate
	void Activate(bool bReset);                                                                                              // [0x2ec3d40] Native|Public|BlueprintCallable 
};

/// Class /Script/Engine.SceneComponent
/// Size: 0x0150 (0x0000B0 - 0x000200)
class USceneComponent : public UActorComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x00B0   (0x0008)  MISSED
	TWeakObjectPtr<APhysicsVolume*>                    PhysicsVolume;                                              // 0x00B8   (0x0008)  
	USceneComponent*                                   AttachParent;                                               // 0x00C0   (0x0008)  
	FName                                              AttachSocketName;                                           // 0x00C8   (0x0008)  
	TArray<USceneComponent*>                           AttachChildren;                                             // 0x00D0   (0x0010)  
	TArray<USceneComponent*>                           ClientAttachedChildren;                                     // 0x00E0   (0x0010)  
	unsigned char                                      UnknownData01_5[0x2C];                                      // 0x00F0   (0x002C)  MISSED
	FVector                                            RelativeLocation;                                           // 0x011C   (0x000C)  
	FRotator                                           RelativeRotation;                                           // 0x0128   (0x000C)  
	FVector                                            RelativeScale3D;                                            // 0x0134   (0x000C)  
	FVector                                            ComponentVelocity;                                          // 0x0140   (0x000C)  
	bool                                               bComponentToWorldUpdated;                                   // 0x014C:0 (0x0001)  
	unsigned char                                      UnknownBit02 : 1;                                           // 0x014C:1 (0x0001)  MISSED
	bool                                               bAbsoluteLocation;                                          // 0x014C:2 (0x0001)  
	bool                                               bAbsoluteRotation;                                          // 0x014C:3 (0x0001)  
	bool                                               bAbsoluteScale;                                             // 0x014C:4 (0x0001)  
	bool                                               bVisible;                                                   // 0x014C:5 (0x0001)  
	bool                                               bShouldBeAttached;                                          // 0x014C:6 (0x0001)  
	bool                                               bShouldSnapLocationWhenAttached;                            // 0x014C:7 (0x0001)  
	bool                                               bShouldSnapRotationWhenAttached;                            // 0x014D:0 (0x0001)  
	bool                                               bShouldUpdatePhysicsVolume;                                 // 0x014D:1 (0x0001)  
	bool                                               bHiddenInGame;                                              // 0x014D:2 (0x0001)  
	bool                                               bBoundsChangeTriggersStreamingDataRebuild;                  // 0x014D:3 (0x0001)  
	bool                                               bUseAttachParentBound;                                      // 0x014D:4 (0x0001)  
	unsigned char                                      UnknownData03_4[0x1];                                       // 0x014E   (0x0001)  MISSED
	TEnumAsByte<EComponentMobility>                    Mobility;                                                   // 0x014F   (0x0001)  
	TEnumAsByte<EDetailMode>                           DetailMode;                                                 // 0x0150   (0x0001)  
	FMulticastSparseDelegate                           PhysicsVolumeChangedDelegate;                               // 0x0151   (0x0001)  
	unsigned char                                      UnknownData04_6[0xAE];                                      // 0x0152   (0x00AE)  MISSED


	/// Functions
	// Function /Script/Engine.SceneComponent.ToggleVisibility
	void ToggleVisibility(bool bPropagateToChildren);                                                                        // [0x3a2e7a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.SnapTo
	bool SnapTo(USceneComponent* InParent, FName InSocketName);                                                              // [0x3a2f490] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.SetWorldScale3D
	void SetWorldScale3D(FVector NewScale);                                                                                  // [0x3a31540] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.SetVisibility
	void SetVisibility(bool bNewVisibility, bool bPropagateToChildren);                                                      // [0x3a2e890] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.SetShouldUpdatePhysicsVolume
	void SetShouldUpdatePhysicsVolume(bool bInShouldUpdatePhysicsVolume);                                                    // [0x3a33560] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.SetRelativeScale3D
	void SetRelativeScale3D(FVector NewScale3D);                                                                             // [0x3a32a00] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.SetMobility
	void SetMobility(TEnumAsByte<EComponentMobility> NewMobility);                                                           // [0x3a2dbf0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.SetHiddenInGame
	void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren);                                                         // [0x3a2e620] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.SetAbsolute
	void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale);                          // [0x3a2e020] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.ResetRelativeTransform
	void ResetRelativeTransform();                                                                                           // [0x3a32ae0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.OnRep_Visibility
	void OnRep_Visibility(bool OldValue);                                                                                    // [0x3a333f0] Final|Native|Private 
	// Function /Script/Engine.SceneComponent.OnRep_Transform
	void OnRep_Transform();                                                                                                  // [0x3a33540] Final|Native|Private 
	// Function /Script/Engine.SceneComponent.OnRep_AttachSocketName
	void OnRep_AttachSocketName();                                                                                           // [0x3a33500] Final|Native|Private 
	// Function /Script/Engine.SceneComponent.OnRep_AttachParent
	void OnRep_AttachParent();                                                                                               // [0x3a33500] Final|Native|Private 
	// Function /Script/Engine.SceneComponent.OnRep_AttachChildren
	void OnRep_AttachChildren();                                                                                             // [0x3a33520] Final|Native|Private 
	// Function /Script/Engine.SceneComponent.K2_SetWorldTransform
	void K2_SetWorldTransform(FTransform& NewTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);            // [0x3a31220] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_SetWorldRotation
	void K2_SetWorldRotation(FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);                 // [0x3a31620] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_SetWorldLocationAndRotation
	void K2_SetWorldLocationAndRotation(FVector NewLocation, FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // [0x3a2dcc0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_SetWorldLocation
	void K2_SetWorldLocation(FVector NewLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);                  // [0x3a318e0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_SetRelativeTransform
	void K2_SetRelativeTransform(FTransform& NewTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);         // [0x3a32b50] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_SetRelativeRotation
	void K2_SetRelativeRotation(FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);              // [0x3a32e70] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_SetRelativeLocationAndRotation
	void K2_SetRelativeLocationAndRotation(FVector NewLocation, FRotator NewRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // [0x3a2e250] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_SetRelativeLocation
	void K2_SetRelativeLocation(FVector NewLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);               // [0x3a33130] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_GetComponentToWorld
	FTransform K2_GetComponentToWorld();                                                                                     // [0x3a30340] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.K2_GetComponentScale
	FVector K2_GetComponentScale();                                                                                          // [0x3a30380] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.K2_GetComponentRotation
	FRotator K2_GetComponentRotation();                                                                                      // [0x3a303d0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.K2_GetComponentLocation
	FVector K2_GetComponentLocation();                                                                                       // [0x3a30460] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.K2_DetachFromComponent
	void K2_DetachFromComponent(EDetachmentRule LocationRule, EDetachmentRule RotationRule, EDetachmentRule ScaleRule, bool bCallModify); // [0x3a2f080] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_AttachToComponent
	bool K2_AttachToComponent(USceneComponent* Parent, FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // [0x3a2f600] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_AttachTo
	bool K2_AttachTo(USceneComponent* InParent, FName InSocketName, TEnumAsByte<EAttachLocation> AttachType, bool bWeldSimulatedBodies); // [0x3a2f990] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_AddWorldTransformKeepScale
	void K2_AddWorldTransformKeepScale(FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport); // [0x3a304b0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_AddWorldTransform
	void K2_AddWorldTransform(FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);          // [0x3a308b0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_AddWorldRotation
	void K2_AddWorldRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);               // [0x3a30c70] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_AddWorldOffset
	void K2_AddWorldOffset(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);                  // [0x3a30f30] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_AddRelativeRotation
	void K2_AddRelativeRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);            // [0x3a32440] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_AddRelativeLocation
	void K2_AddRelativeLocation(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);             // [0x3a32740] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_AddLocalTransform
	void K2_AddLocalTransform(FTransform& DeltaTransform, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);          // [0x3a31ba0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_AddLocalRotation
	void K2_AddLocalRotation(FRotator DeltaRotation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);               // [0x3a31ec0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.K2_AddLocalOffset
	void K2_AddLocalOffset(FVector DeltaLocation, bool bSweep, FHitResult& SweepHitResult, bool bTeleport);                  // [0x3a32180] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SceneComponent.IsVisible
	bool IsVisible();                                                                                                        // [0x3a2ea10] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.IsSimulatingPhysics
	bool IsSimulatingPhysics(FName BoneName);                                                                                // [0x3a300f0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.IsAnySimulatingPhysics
	bool IsAnySimulatingPhysics();                                                                                           // [0x3a300c0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetUpVector
	FVector GetUpVector();                                                                                                   // [0x3a30290] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetSocketTransform
	FTransform GetSocketTransform(FName InSocketName, TEnumAsByte<ERelativeTransformSpace> TransformSpace);                  // [0x3a2ee70] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetSocketRotation
	FRotator GetSocketRotation(FName InSocketName);                                                                          // [0x3a2ec70] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetSocketQuaternion
	FQuat GetSocketQuaternion(FName InSocketName);                                                                           // [0x3a2eb70] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetSocketLocation
	FVector GetSocketLocation(FName InSocketName);                                                                           // [0x3a2ed70] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetShouldUpdatePhysicsVolume
	bool GetShouldUpdatePhysicsVolume();                                                                                     // [0x3a33670] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetRightVector
	FVector GetRightVector();                                                                                                // [0x3a301e0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetRelativeTransform
	FTransform GetRelativeTransform();                                                                                       // [0x3a32b00] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetPhysicsVolume
	APhysicsVolume* GetPhysicsVolume();                                                                                      // [0x3a2e5b0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetParentComponents
	void GetParentComponents(TArray<USceneComponent*>& Parents);                                                             // [0x3a2ff60] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetNumChildrenComponents
	int32_t GetNumChildrenComponents();                                                                                      // [0x3a2ff40] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetForwardVector
	FVector GetForwardVector();                                                                                              // [0x39fabd0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetComponentVelocity
	FVector GetComponentVelocity();                                                                                          // [0x3a2ea40] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetChildrenComponents
	void GetChildrenComponents(bool bIncludeAllDescendants, TArray<USceneComponent*>& Children);                             // [0x3a2fc40] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetChildComponent
	USceneComponent* GetChildComponent(int32_t ChildIndex);                                                                  // [0x3a2fdb0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetAttachSocketName
	FName GetAttachSocketName();                                                                                             // [0x3036d60] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetAttachParent
	USceneComponent* GetAttachParent();                                                                                      // [0x3a300a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.GetAllSocketNames
	TArray<FName> GetAllSocketNames();                                                                                       // [0x3a2f000] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.DoesSocketExist
	bool DoesSocketExist(FName InSocketName);                                                                                // [0x3a2ea80] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SceneComponent.DetachFromParent
	void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify);                                                    // [0x3a2f310] Native|Public|BlueprintCallable 
};

/// Class /Script/Engine.BlueprintFunctionLibrary
/// Size: 0x0000 (0x000028 - 0x000028)
class UBlueprintFunctionLibrary : public UObject
{ 
public:
};

/// Class /Script/Engine.ReverbEffect
/// Size: 0x0038 (0x000028 - 0x000060)
class UReverbEffect : public UObject
{ 
public:
	bool                                               bBypassEarlyReflections;                                    // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0029   (0x0003)  MISSED
	float                                              ReflectionsDelay;                                           // 0x002C   (0x0004)  
	float                                              GainHF;                                                     // 0x0030   (0x0004)  
	float                                              ReflectionsGain;                                            // 0x0034   (0x0004)  
	bool                                               bBypassLateReflections;                                     // 0x0038   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0039   (0x0003)  MISSED
	float                                              LateDelay;                                                  // 0x003C   (0x0004)  
	float                                              DecayTime;                                                  // 0x0040   (0x0004)  
	float                                              Density;                                                    // 0x0044   (0x0004)  
	float                                              Diffusion;                                                  // 0x0048   (0x0004)  
	float                                              AirAbsorptionGainHF;                                        // 0x004C   (0x0004)  
	float                                              DecayHFRatio;                                               // 0x0050   (0x0004)  
	float                                              LateGain;                                                   // 0x0054   (0x0004)  
	float                                              Gain;                                                       // 0x0058   (0x0004)  
	float                                              RoomRolloffFactor;                                          // 0x005C   (0x0004)  
};

/// Class /Script/Engine.BlueprintAsyncActionBase
/// Size: 0x0008 (0x000028 - 0x000030)
class UBlueprintAsyncActionBase : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0028   (0x0008)  MISSED
};

/// Class /Script/Engine.ReplicationDriver
/// Size: 0x0000 (0x000028 - 0x000028)
class UReplicationDriver : public UObject
{ 
public:
};

/// Class /Script/Engine.ReplicationConnectionDriver
/// Size: 0x0000 (0x000028 - 0x000028)
class UReplicationConnectionDriver : public UObject
{ 
public:
};

/// Class /Script/Engine.GameInstance
/// Size: 0x0180 (0x000028 - 0x0001A8)
class UGameInstance : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0028   (0x0010)  MISSED
	TArray<ULocalPlayer*>                              LocalPlayers;                                               // 0x0038   (0x0010)  
	UOnlineSession*                                    OnlineSession;                                              // 0x0048   (0x0008)  
	TArray<UObject*>                                   ReferencedObjects;                                          // 0x0050   (0x0010)  
	unsigned char                                      UnknownData01_5[0x18];                                      // 0x0060   (0x0018)  MISSED
	FMulticastInlineDelegate                           OnPawnControllerChangedDelegates;                           // 0x0078   (0x0010)  
	unsigned char                                      UnknownData02_6[0x120];                                     // 0x0088   (0x0120)  MISSED


	/// Functions
	// Function /Script/Engine.GameInstance.ReceiveShutdown
	void ReceiveShutdown();                                                                                                  // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.GameInstance.ReceiveInit
	void ReceiveInit();                                                                                                      // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.GameInstance.HandleTravelError
	void HandleTravelError(TEnumAsByte<ETravelFailure> FailureType);                                                         // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.GameInstance.HandleNetworkError
	void HandleNetworkError(TEnumAsByte<ENetworkFailure> FailureType, bool bIsServer);                                       // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.GameInstance.DebugRemovePlayer
	void DebugRemovePlayer(int32_t ControllerId);                                                                            // [0x38dd7f0] Exec|Native|Public   
	// Function /Script/Engine.GameInstance.DebugCreatePlayer
	void DebugCreatePlayer(int32_t ControllerId);                                                                            // [0x38dd8d0] Exec|Native|Public   
};

/// Class /Script/Engine.PrimitiveComponent
/// Size: 0x0240 (0x000200 - 0x000440)
class UPrimitiveComponent : public USceneComponent
{ 
public:
	float                                              MinDrawDistance;                                            // 0x0200   (0x0004)  
	float                                              LDMaxDrawDistance;                                          // 0x0204   (0x0004)  
	float                                              CachedMaxDrawDistance;                                      // 0x0208   (0x0004)  
	TEnumAsByte<ESceneDepthPriorityGroup>              DepthPriorityGroup;                                         // 0x020C   (0x0001)  
	TEnumAsByte<ESceneDepthPriorityGroup>              ViewOwnerDepthPriorityGroup;                                // 0x020D   (0x0001)  
	TEnumAsByte<EIndirectLightingCacheQuality>         IndirectLightingCacheQuality;                               // 0x020E   (0x0001)  
	ELightmapType                                      LightmapType;                                               // 0x020F   (0x0001)  
	bool                                               bUseMaxLODAsImposter;                                       // 0x0210:0 (0x0001)  
	bool                                               bBatchImpostersAsInstances;                                 // 0x0210:1 (0x0001)  
	bool                                               bNeverDistanceCull;                                         // 0x0210:2 (0x0001)  
	unsigned char                                      UnknownBit00 : 1;                                           // 0x0210:3 (0x0001)  MISSED
	unsigned char                                      UnknownBit01 : 1;                                           // 0x0210:4 (0x0001)  MISSED
	unsigned char                                      UnknownBit02 : 1;                                           // 0x0210:5 (0x0001)  MISSED
	unsigned char                                      UnknownBit03 : 1;                                           // 0x0210:6 (0x0001)  MISSED
	bool                                               bAlwaysCreatePhysicsState;                                  // 0x0210:7 (0x0001)  
	bool                                               bGenerateOverlapEvents;                                     // 0x0211:0 (0x0001)  
	bool                                               bMultiBodyOverlap;                                          // 0x0211:1 (0x0001)  
	bool                                               bTraceComplexOnMove;                                        // 0x0211:2 (0x0001)  
	bool                                               bReturnMaterialOnMove;                                      // 0x0211:3 (0x0001)  
	bool                                               bUseViewOwnerDepthPriorityGroup;                            // 0x0211:4 (0x0001)  
	bool                                               bAllowCullDistanceVolume;                                   // 0x0211:5 (0x0001)  
	bool                                               bHasMotionBlurVelocityMeshes;                               // 0x0211:6 (0x0001)  
	bool                                               bVisibleInReflectionCaptures;                               // 0x0211:7 (0x0001)  
	bool                                               bVisibleInRealTimeSkyCaptures;                              // 0x0212:0 (0x0001)  
	bool                                               bVisibleInRayTracing;                                       // 0x0212:1 (0x0001)  
	bool                                               bRenderInMainPass;                                          // 0x0212:2 (0x0001)  
	bool                                               bRenderInDepthPass;                                         // 0x0212:3 (0x0001)  
	bool                                               bReceivesDecals;                                            // 0x0212:4 (0x0001)  
	bool                                               bOwnerNoSee;                                                // 0x0212:5 (0x0001)  
	bool                                               bOnlyOwnerSee;                                              // 0x0212:6 (0x0001)  
	bool                                               bTreatAsBackgroundForOcclusion;                             // 0x0212:7 (0x0001)  
	bool                                               bUseAsOccluder;                                             // 0x0213:0 (0x0001)  
	bool                                               bSelectable;                                                // 0x0213:1 (0x0001)  
	bool                                               bForceMipStreaming;                                         // 0x0213:2 (0x0001)  
	bool                                               bHasPerInstanceHitProxies;                                  // 0x0213:3 (0x0001)  
	bool                                               CastShadow;                                                 // 0x0213:4 (0x0001)  
	bool                                               bAffectDynamicIndirectLighting;                             // 0x0213:5 (0x0001)  
	bool                                               bAffectDistanceFieldLighting;                               // 0x0213:6 (0x0001)  
	bool                                               bCastDynamicShadow;                                         // 0x0213:7 (0x0001)  
	bool                                               bCastStaticShadow;                                          // 0x0214:0 (0x0001)  
	bool                                               bCastVolumetricTranslucentShadow;                           // 0x0214:1 (0x0001)  
	bool                                               bCastContactShadow;                                         // 0x0214:2 (0x0001)  
	bool                                               bSelfShadowOnly;                                            // 0x0214:3 (0x0001)  
	bool                                               bCastFarShadow;                                             // 0x0214:4 (0x0001)  
	bool                                               bCastInsetShadow;                                           // 0x0214:5 (0x0001)  
	bool                                               bCastCinematicShadow;                                       // 0x0214:6 (0x0001)  
	bool                                               bCastHiddenShadow;                                          // 0x0214:7 (0x0001)  
	bool                                               bCastShadowAsTwoSided;                                      // 0x0215:0 (0x0001)  
	bool                                               bLightAsIfStatic;                                           // 0x0215:1 (0x0001)  
	bool                                               bLightAttachmentsAsGroup;                                   // 0x0215:2 (0x0001)  
	bool                                               bExcludeFromLightAttachmentGroup;                           // 0x0215:3 (0x0001)  
	bool                                               bReceiveMobileCSMShadows;                                   // 0x0215:4 (0x0001)  
	bool                                               bSingleSampleShadowFromStationaryLights;                    // 0x0215:5 (0x0001)  
	bool                                               bIgnoreRadialImpulse;                                       // 0x0215:6 (0x0001)  
	bool                                               bIgnoreRadialForce;                                         // 0x0215:7 (0x0001)  
	bool                                               bApplyImpulseOnDamage;                                      // 0x0216:0 (0x0001)  
	bool                                               bReplicatePhysicsToAutonomousProxy;                         // 0x0216:1 (0x0001)  
	bool                                               bFillCollisionUnderneathForNavmesh;                         // 0x0216:2 (0x0001)  
	bool                                               AlwaysLoadOnClient;                                         // 0x0216:3 (0x0001)  
	bool                                               AlwaysLoadOnServer;                                         // 0x0216:4 (0x0001)  
	bool                                               bUseEditorCompositing;                                      // 0x0216:5 (0x0001)  
	bool                                               bRenderCustomDepth;                                         // 0x0216:6 (0x0001)  
	TEnumAsByte<EHasCustomNavigableGeometry>           bHasCustomNavigableGeometry;                                // 0x0217   (0x0001)  
	unsigned char                                      UnknownData04_5[0x1];                                       // 0x0218   (0x0001)  MISSED
	TEnumAsByte<ECanBeCharacterBase>                   CanCharacterStepUpOn;                                       // 0x0219   (0x0001)  
	FLightingChannels                                  LightingChannels;                                           // 0x021A   (0x0001)  
	ERendererStencilMask                               CustomDepthStencilWriteMask;                                // 0x021B   (0x0001)  
	int32_t                                            CustomDepthStencilValue;                                    // 0x021C   (0x0004)  
	FCustomPrimitiveData                               CustomPrimitiveData;                                        // 0x0220   (0x0010)  
	FCustomPrimitiveData                               CustomPrimitiveDataInternal;                                // 0x0230   (0x0010)  
	unsigned char                                      UnknownData05_5[0x8];                                       // 0x0240   (0x0008)  MISSED
	int32_t                                            TranslucencySortPriority;                                   // 0x0248   (0x0004)  
	int32_t                                            VisibilityId;                                               // 0x024C   (0x0004)  
	TArray<URuntimeVirtualTexture*>                    RuntimeVirtualTextures;                                     // 0x0250   (0x0010)  
	int8_t                                             VirtualTextureLodBias;                                      // 0x0260   (0x0001)  
	int8_t                                             VirtualTextureCullMips;                                     // 0x0261   (0x0001)  
	int8_t                                             VirtualTextureMinCoverage;                                  // 0x0262   (0x0001)  
	ERuntimeVirtualTextureMainPassType                 VirtualTextureRenderPassType;                               // 0x0263   (0x0001)  
	unsigned char                                      UnknownData06_5[0x4];                                       // 0x0264   (0x0004)  MISSED
	float                                              LpvBiasMultiplier;                                          // 0x0268   (0x0004)  
	unsigned char                                      UnknownData07_5[0x8];                                       // 0x026C   (0x0008)  MISSED
	float                                              BoundsScale;                                                // 0x0274   (0x0004)  
	unsigned char                                      UnknownData08_5[0x10];                                      // 0x0278   (0x0010)  MISSED
	TArray<AActor*>                                    MoveIgnoreActors;                                           // 0x0288   (0x0010)  
	TArray<UPrimitiveComponent*>                       MoveIgnoreComponents;                                       // 0x0298   (0x0010)  
	unsigned char                                      UnknownData09_5[0x10];                                      // 0x02A8   (0x0010)  MISSED
	FBodyInstance                                      BodyInstance;                                               // 0x02B8   (0x0158)  
	FMulticastSparseDelegate                           OnComponentHit;                                             // 0x0410   (0x0001)  
	FMulticastSparseDelegate                           OnComponentBeginOverlap;                                    // 0x0411   (0x0001)  
	FMulticastSparseDelegate                           OnComponentEndOverlap;                                      // 0x0412   (0x0001)  
	FMulticastSparseDelegate                           OnComponentWake;                                            // 0x0413   (0x0001)  
	FMulticastSparseDelegate                           OnComponentSleep;                                           // 0x0414   (0x0001)  
	unsigned char                                      UnknownData10_5[0x1];                                       // 0x0415   (0x0001)  MISSED
	FMulticastSparseDelegate                           OnBeginCursorOver;                                          // 0x0416   (0x0001)  
	FMulticastSparseDelegate                           OnEndCursorOver;                                            // 0x0417   (0x0001)  
	FMulticastSparseDelegate                           OnClicked;                                                  // 0x0418   (0x0001)  
	FMulticastSparseDelegate                           OnReleased;                                                 // 0x0419   (0x0001)  
	FMulticastSparseDelegate                           OnInputTouchBegin;                                          // 0x041A   (0x0001)  
	FMulticastSparseDelegate                           OnInputTouchEnd;                                            // 0x041B   (0x0001)  
	FMulticastSparseDelegate                           OnInputTouchEnter;                                          // 0x041C   (0x0001)  
	FMulticastSparseDelegate                           OnInputTouchLeave;                                          // 0x041D   (0x0001)  
	unsigned char                                      UnknownData11_5[0x1A];                                      // 0x041E   (0x001A)  MISSED
	UPrimitiveComponent*                               LODParentPrimitive;                                         // 0x0438   (0x0008)  


	/// Functions
	// Function /Script/Engine.PrimitiveComponent.WasRecentlyRendered
	bool WasRecentlyRendered(float Tolerance);                                                                               // [0x3a1e2f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.WakeRigidBody
	void WakeRigidBody(FName BoneName);                                                                                      // [0x3a18240] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.WakeAllRigidBodies
	void WakeAllRigidBodies();                                                                                               // [0x3a15170] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetWalkableSlopeOverride
	void SetWalkableSlopeOverride(FWalkableSlopeOverride& NewOverride);                                                      // [0x3a1b570] Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetUseCCD
	void SetUseCCD(bool InUseCCD, FName BoneName);                                                                           // [0x3a145a0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetTranslucentSortPriority
	void SetTranslucentSortPriority(int32_t NewTranslucentSortPriority);                                                     // [0x3a17870] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetSingleSampleShadowFromStationaryLights
	void SetSingleSampleShadowFromStationaryLights(bool bNewSingleSampleShadowFromStationaryLights);                         // [0x3a17950] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetSimulatePhysics
	void SetSimulatePhysics(bool bSimulate);                                                                                 // [0x3a1b490] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetRenderInMainPass
	void SetRenderInMainPass(bool bValue);                                                                                   // [0x3a15990] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetRenderCustomDepth
	void SetRenderCustomDepth(bool bValue);                                                                                  // [0x3a15c40] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetReceivesDecals
	void SetReceivesDecals(bool bNewReceivesDecals);                                                                         // [0x3a17770] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetPhysMaterialOverride
	void SetPhysMaterialOverride(UPhysicalMaterial* NewPhysMaterial);                                                        // [0x3a141b0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInRadians
	void SetPhysicsMaxAngularVelocityInRadians(float NewMaxAngVel, bool bAddToCurrent, FName BoneName);                      // [0x3a18940] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInDegrees
	void SetPhysicsMaxAngularVelocityInDegrees(float NewMaxAngVel, bool bAddToCurrent, FName BoneName);                      // [0x3a18b40] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocity
	void SetPhysicsMaxAngularVelocity(float NewMaxAngVel, bool bAddToCurrent, FName BoneName);                               // [0x3a18b40] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetPhysicsLinearVelocity
	void SetPhysicsLinearVelocity(FVector NewVel, bool bAddToCurrent, FName BoneName);                                       // [0x3a196a0] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetPhysicsAngularVelocityInRadians
	void SetPhysicsAngularVelocityInRadians(FVector NewAngVel, bool bAddToCurrent, FName BoneName);                          // [0x3a18f80] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetPhysicsAngularVelocityInDegrees
	void SetPhysicsAngularVelocityInDegrees(FVector NewAngVel, bool bAddToCurrent, FName BoneName);                          // [0x3a18d50] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetPhysicsAngularVelocity
	void SetPhysicsAngularVelocity(FVector NewAngVel, bool bAddToCurrent, FName BoneName);                                   // [0x3a18d50] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetOwnerNoSee
	void SetOwnerNoSee(bool bNewOwnerNoSee);                                                                                 // [0x3a17f50] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetOnlyOwnerSee
	void SetOnlyOwnerSee(bool bNewOnlyOwnerSee);                                                                             // [0x3a17e50] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetNotifyRigidBodyCollision
	void SetNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision);                                                     // [0x3a18050] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetMaterialByName
	void SetMaterialByName(FName MaterialSlotName, UMaterialInterface* Material);                                            // [0x3a1bc90] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetMaterial
	void SetMaterial(int32_t ElementIndex, UMaterialInterface* Material);                                                    // [0x3a1bdf0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetMassScale
	void SetMassScale(FName BoneName, float InMassScale);                                                                    // [0x3a14db0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetMassOverrideInKg
	void SetMassOverrideInKg(FName BoneName, float MassInKg, bool bOverrideMass);                                            // [0x3a14a00] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetLinearDamping
	void SetLinearDamping(float InDamping);                                                                                  // [0x3a15070] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetLightingChannels
	void SetLightingChannels(bool bChannel0, bool bChannel1, bool bChannel2);                                                // [0x3a1e3d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetLightAttachmentsAsGroup
	void SetLightAttachmentsAsGroup(bool bInLightAttachmentsAsGroup);                                                        // [0x3a17b50] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetGenerateOverlapEvents
	void SetGenerateOverlapEvents(bool bInGenerateOverlapEvents);                                                            // [0x3a1e6f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetExcludeFromLightAttachmentGroup
	void SetExcludeFromLightAttachmentGroup(bool bInExcludeFromLightAttachmentGroup);                                        // [0x3a17a50] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetEnableGravity
	void SetEnableGravity(bool bGravityEnabled);                                                                             // [0x3a00580] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataVector4
	void SetDefaultCustomPrimitiveDataVector4(int32_t DataIndex, FVector4 Value);                                            // [0x3a1c6e0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataVector3
	void SetDefaultCustomPrimitiveDataVector3(int32_t DataIndex, FVector Value);                                             // [0x3a1c960] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataVector2
	void SetDefaultCustomPrimitiveDataVector2(int32_t DataIndex, FVector2D Value);                                           // [0x3a1cbe0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataFloat
	void SetDefaultCustomPrimitiveDataFloat(int32_t DataIndex, float Value);                                                 // [0x3a1ce20] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetCustomPrimitiveDataVector4
	void SetCustomPrimitiveDataVector4(int32_t DataIndex, FVector4 Value);                                                   // [0x3a1d070] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetCustomPrimitiveDataVector3
	void SetCustomPrimitiveDataVector3(int32_t DataIndex, FVector Value);                                                    // [0x3a1d300] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetCustomPrimitiveDataVector2
	void SetCustomPrimitiveDataVector2(int32_t DataIndex, FVector2D Value);                                                  // [0x3a1d5a0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetCustomPrimitiveDataFloat
	void SetCustomPrimitiveDataFloat(int32_t DataIndex, float Value);                                                        // [0x3a1d7f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetCustomDepthStencilWriteMask
	void SetCustomDepthStencilWriteMask(ERendererStencilMask WriteMaskBit);                                                  // [0x3a15a90] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetCustomDepthStencilValue
	void SetCustomDepthStencilValue(int32_t Value);                                                                          // [0x3a15b70] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetCullDistance
	void SetCullDistance(float NewCullDistance);                                                                             // [0x3a140e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetConstraintMode
	void SetConstraintMode(TEnumAsByte<EDOFMode> ConstraintMode);                                                            // [0x3a1b3c0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetCollisionResponseToChannel
	void SetCollisionResponseToChannel(TEnumAsByte<ECollisionChannel> Channel, TEnumAsByte<ECollisionResponse> NewResponse); // [0x3a14360] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetCollisionResponseToAllChannels
	void SetCollisionResponseToAllChannels(TEnumAsByte<ECollisionResponse> NewResponse);                                     // [0x3a14290] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetCollisionProfileName
	void SetCollisionProfileName(FName InCollisionProfileName, bool bUpdateOverlaps);                                        // [0x3a17540] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetCollisionObjectType
	void SetCollisionObjectType(TEnumAsByte<ECollisionChannel> Channel);                                                     // [0x3a17420] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetCollisionEnabled
	void SetCollisionEnabled(TEnumAsByte<ECollisionEnabled> NewType);                                                        // [0x3a176a0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetCenterOfMass
	void SetCenterOfMass(FVector CenterOfMassOffset, FName BoneName);                                                        // [0x3a18320] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetCastShadow
	void SetCastShadow(bool NewCastShadow);                                                                                  // [0x3a17d50] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetCastInsetShadow
	void SetCastInsetShadow(bool bInCastInsetShadow);                                                                        // [0x3a17c50] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetBoundsScale
	void SetBoundsScale(float NewBoundsScale);                                                                               // [0x3a1c040] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetAngularDamping
	void SetAngularDamping(float InDamping);                                                                                 // [0x3a14f60] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetAllUseCCD
	void SetAllUseCCD(bool InUseCCD);                                                                                        // [0x3a144c0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity
	void SetAllPhysicsLinearVelocity(FVector NewVel, bool bAddToCurrent);                                                    // [0x3a19190] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetAllPhysicsAngularVelocityInRadians
	void SetAllPhysicsAngularVelocityInRadians(FVector& NewAngVel, bool bAddToCurrent);                                      // [0x3a15190] Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetAllPhysicsAngularVelocityInDegrees
	void SetAllPhysicsAngularVelocityInDegrees(FVector& NewAngVel, bool bAddToCurrent);                                      // [0x3a15300] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.SetAllMassScale
	void SetAllMassScale(float InMassScale);                                                                                 // [0x3a14bf0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.ScaleByMomentOfInertia
	FVector ScaleByMomentOfInertia(FVector InputVector, FName BoneName);                                                     // [0x3a14720] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.PutRigidBodyToSleep
	void PutRigidBodyToSleep(FName BoneName);                                                                                // [0x3a18130] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.K2_SphereTraceComponent
	bool K2_SphereTraceComponent(FVector TraceStart, FVector TraceEnd, float SphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, FVector& HitLocation, FVector& HitNormal, FName& BoneName, FHitResult& OutHit); // [0x3a16750] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.K2_SphereOverlapComponent
	bool K2_SphereOverlapComponent(FVector InSphereCentre, float InSphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, FVector& HitLocation, FVector& HitNormal, FName& BoneName, FHitResult& OutHit); // [0x3a15d20] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.K2_LineTraceComponent
	bool K2_LineTraceComponent(FVector TraceStart, FVector TraceEnd, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, FVector& HitLocation, FVector& HitNormal, FName& BoneName, FHitResult& OutHit); // [0x3a16e60] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.K2_IsQueryCollisionEnabled
	bool K2_IsQueryCollisionEnabled();                                                                                       // [0x3a15600] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.K2_IsPhysicsCollisionEnabled
	bool K2_IsPhysicsCollisionEnabled();                                                                                     // [0x3a155c0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.K2_IsCollisionEnabled
	bool K2_IsCollisionEnabled();                                                                                            // [0x3a15640] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.K2_BoxOverlapComponent
	bool K2_BoxOverlapComponent(FVector InBoxCentre, FBox InBox, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, FVector& HitLocation, FVector& HitNormal, FName& BoneName, FHitResult& OutHit); // [0x3a16220] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.IsOverlappingComponent
	bool IsOverlappingComponent(UPrimitiveComponent* OtherComp);                                                             // [0x3a1c550] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.IsOverlappingActor
	bool IsOverlappingActor(AActor* Other);                                                                                  // [0x3a1c3c0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.IsGravityEnabled
	bool IsGravityEnabled();                                                                                                 // [0x3a15140] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.IsAnyRigidBodyAwake
	bool IsAnyRigidBodyAwake();                                                                                              // [0x38dea80] Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.PrimitiveComponent.IgnoreComponentWhenMoving
	void IgnoreComponentWhenMoving(UPrimitiveComponent* Component, bool bShouldIgnore);                                      // [0x3a1dc40] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.IgnoreActorWhenMoving
	void IgnoreActorWhenMoving(AActor* Actor, bool bShouldIgnore);                                                           // [0x3a1e0f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.GetWalkableSlopeOverride
	FWalkableSlopeOverride GetWalkableSlopeOverride();                                                                       // [0x3a1b670] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetPhysicsLinearVelocityAtPoint
	FVector GetPhysicsLinearVelocityAtPoint(FVector Point, FName BoneName);                                                  // [0x3a19320] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.GetPhysicsLinearVelocity
	FVector GetPhysicsLinearVelocity(FName BoneName);                                                                        // [0x3a19520] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.GetPhysicsAngularVelocityInRadians
	FVector GetPhysicsAngularVelocityInRadians(FName BoneName);                                                              // [0x3a185e0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetPhysicsAngularVelocityInDegrees
	FVector GetPhysicsAngularVelocityInDegrees(FName BoneName);                                                              // [0x3a18740] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetPhysicsAngularVelocity
	FVector GetPhysicsAngularVelocity(FName BoneName);                                                                       // [0x3a18840] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetOverlappingComponents
	void GetOverlappingComponents(TArray<UPrimitiveComponent*>& OutOverlappingComponents);                                   // [0x3a1c140] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetOverlappingActors
	void GetOverlappingActors(TArray<AActor*>& OverlappingActors, UClass* ClassFilter);                                      // [0x3a1c230] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetNumMaterials
	int32_t GetNumMaterials();                                                                                               // [0x3a15960] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetMaterialFromCollisionFaceIndex
	UMaterialInterface* GetMaterialFromCollisionFaceIndex(int32_t FaceIndex, int32_t& SectionIndex);                         // [0x3a1b6e0] Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetMaterial
	UMaterialInterface* GetMaterial(int32_t ElementIndex);                                                                   // [0x3a1bf50] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetMassScale
	float GetMassScale(FName BoneName);                                                                                      // [0x3a14cc0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetMass
	float GetMass();                                                                                                         // [0x3a149c0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetLinearDamping
	float GetLinearDamping();                                                                                                // [0x3a15030] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetInertiaTensor
	FVector GetInertiaTensor(FName BoneName);                                                                                // [0x3a148c0] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetGenerateOverlapEvents
	bool GetGenerateOverlapEvents();                                                                                         // [0x3a1e810] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetCollisionResponseToChannel
	TEnumAsByte<ECollisionResponse> GetCollisionResponseToChannel(TEnumAsByte<ECollisionChannel> Channel);                   // [0x3a154e0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetCollisionProfileName
	FName GetCollisionProfileName();                                                                                         // [0x3a174f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetCollisionObjectType
	TEnumAsByte<ECollisionChannel> GetCollisionObjectType();                                                                 // [0x3a154b0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetCollisionEnabled
	TEnumAsByte<ECollisionEnabled> GetCollisionEnabled();                                                                    // [0x3a15680] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetClosestPointOnCollision
	float GetClosestPointOnCollision(FVector& Point, FVector& OutPointOnBody, FName BoneName);                               // [0x3a156b0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetCenterOfMass
	FVector GetCenterOfMass(FName BoneName);                                                                                 // [0x3a184c0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.GetAngularDamping
	float GetAngularDamping();                                                                                               // [0x3a14f20] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.CreateDynamicMaterialInstance
	UMaterialInstanceDynamic* CreateDynamicMaterialInstance(int32_t ElementIndex, UMaterialInterface* SourceMaterial, FName OptionalName); // [0x3a1b840] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial
	UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamicFromMaterial(int32_t ElementIndex, UMaterialInterface* Parent); // [0x3a1ba30] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic
	UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamic(int32_t ElementIndex);                                     // [0x3a1bba0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreComponents
	TArray<UPrimitiveComponent*> CopyArrayOfMoveIgnoreComponents();                                                          // [0x3a1da90] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors
	TArray<AActor*> CopyArrayOfMoveIgnoreActors();                                                                           // [0x3a1df40] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.ClearMoveIgnoreComponents
	void ClearMoveIgnoreComponents();                                                                                        // [0x3a1da60] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.ClearMoveIgnoreActors
	void ClearMoveIgnoreActors();                                                                                            // [0x3a1df10] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.CanCharacterStepUp
	bool CanCharacterStepUp(APawn* Pawn);                                                                                    // [0x3a13ff0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PrimitiveComponent.AddTorqueInRadians
	void AddTorqueInRadians(FVector Torque, FName BoneName, bool bAccelChange);                                              // [0x3a19ad0] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.AddTorqueInDegrees
	void AddTorqueInDegrees(FVector Torque, FName BoneName, bool bAccelChange);                                              // [0x3a198b0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.AddTorque
	void AddTorque(FVector Torque, FName BoneName, bool bAccelChange);                                                       // [0x3a19ad0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.AddRadialImpulse
	void AddRadialImpulse(FVector Origin, float Radius, float Strength, TEnumAsByte<ERadialImpulseFalloff> Falloff, bool bVelChange); // [0x3a1a640] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.AddRadialForce
	void AddRadialForce(FVector Origin, float Radius, float Strength, TEnumAsByte<ERadialImpulseFalloff> Falloff, bool bAccelChange); // [0x3a19cd0] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.AddImpulseAtLocation
	void AddImpulseAtLocation(FVector Impulse, FVector Location, FName BoneName);                                            // [0x3a1a990] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.AddImpulse
	void AddImpulse(FVector Impulse, FName BoneName, bool bVelChange);                                                       // [0x3a1b1c0] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.AddForceAtLocationLocal
	void AddForceAtLocationLocal(FVector Force, FVector Location, FName BoneName);                                           // [0x3a1a020] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.AddForceAtLocation
	void AddForceAtLocation(FVector Force, FVector Location, FName BoneName);                                                // [0x3a1a230] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.AddForce
	void AddForce(FVector Force, FName BoneName, bool bAccelChange);                                                         // [0x3a1a440] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.AddAngularImpulseInRadians
	void AddAngularImpulseInRadians(FVector Impulse, FName BoneName, bool bVelChange);                                       // [0x3a1adc0] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.AddAngularImpulseInDegrees
	void AddAngularImpulseInDegrees(FVector Impulse, FName BoneName, bool bVelChange);                                       // [0x3a1aba0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PrimitiveComponent.AddAngularImpulse
	void AddAngularImpulse(FVector Impulse, FName BoneName, bool bVelChange);                                                // [0x3a1afc0] Native|Public|HasDefaults|BlueprintCallable 
};

/// Class /Script/Engine.FXSystemComponent
/// Size: 0x0000 (0x000440 - 0x000440)
class UFXSystemComponent : public UPrimitiveComponent
{ 
public:
};

/// Class /Script/Engine.FXSystemAsset
/// Size: 0x0008 (0x000028 - 0x000030)
class UFXSystemAsset : public UObject
{ 
public:
	uint32_t                                           MaxPoolSize;                                                // 0x0028   (0x0004)  
	uint32_t                                           PoolPrimeSize;                                              // 0x002C   (0x0004)  
};

/// Class /Script/Engine.AnimNotifyState
/// Size: 0x0008 (0x000028 - 0x000030)
class UAnimNotifyState : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0028   (0x0008)  MISSED
};

/// Class /Script/Engine.MeshComponent
/// Size: 0x0030 (0x000440 - 0x000470)
class UMeshComponent : public UPrimitiveComponent
{ 
public:
	TArray<UMaterialInterface*>                        OverrideMaterials;                                          // 0x0440   (0x0010)  
	unsigned char                                      UnknownData00_5[0x10];                                      // 0x0450   (0x0010)  MISSED
	bool                                               bEnableMaterialParameterCaching;                            // 0x0460:0 (0x0001)  
	unsigned char                                      UnknownData01_6[0xF];                                       // 0x0461   (0x000F)  MISSED


	/// Functions
	// Function /Script/Engine.MeshComponent.SetVectorParameterValueOnMaterials
	void SetVectorParameterValueOnMaterials(FName ParameterName, FVector ParameterValue);                                    // [0x39d5b00] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.MeshComponent.SetScalarParameterValueOnMaterials
	void SetScalarParameterValueOnMaterials(FName ParameterName, float ParameterValue);                                      // [0x39d5c80] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.MeshComponent.PrestreamTextures
	void PrestreamTextures(float Seconds, bool bPrioritizeCharacterTextures, int32_t CinematicTextureGroups);                // [0x39d5de0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.MeshComponent.IsMaterialSlotNameValid
	bool IsMaterialSlotNameValid(FName MaterialSlotName);                                                                    // [0x39d5fe0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.MeshComponent.GetMaterialSlotNames
	TArray<FName> GetMaterialSlotNames();                                                                                    // [0x39d60d0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.MeshComponent.GetMaterials
	TArray<UMaterialInterface*> GetMaterials();                                                                              // [0x39d6240] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.MeshComponent.GetMaterialIndex
	int32_t GetMaterialIndex(FName MaterialSlotName);                                                                        // [0x39d6150] Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Engine.SkinnedMeshComponent
/// Size: 0x0220 (0x000470 - 0x000690)
class USkinnedMeshComponent : public UMeshComponent
{ 
public:
	USkeletalMesh*                                     SkeletalMesh;                                               // 0x0470   (0x0008)  
	TWeakObjectPtr<USkinnedMeshComponent*>             MasterPoseComponent;                                        // 0x0478   (0x0008)  
	TArray<ESkinCacheUsage>                            SkinCacheUsage;                                             // 0x0480   (0x0010)  
	TArray<FVertexOffsetUsage>                         VertexOffsetUsage;                                          // 0x0490   (0x0010)  
	unsigned char                                      UnknownData00_5[0xF8];                                      // 0x04A0   (0x00F8)  MISSED
	UPhysicsAsset*                                     PhysicsAssetOverride;                                       // 0x0598   (0x0008)  
	int32_t                                            ForcedLodModel;                                             // 0x05A0   (0x0004)  
	int32_t                                            MinLodModel;                                                // 0x05A4   (0x0004)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x05A8   (0x0008)  MISSED
	float                                              StreamingDistanceMultiplier;                                // 0x05B0   (0x0004)  
	unsigned char                                      UnknownData02_5[0xC];                                       // 0x05B4   (0x000C)  MISSED
	TArray<FSkelMeshComponentLODInfo>                  LODInfo;                                                    // 0x05C0   (0x0010)  
	unsigned char                                      UnknownData03_5[0x24];                                      // 0x05D0   (0x0024)  MISSED
	EVisibilityBasedAnimTickOption                     VisibilityBasedAnimTickOption;                              // 0x05F4   (0x0001)  
	unsigned char                                      UnknownData04_5[0x1];                                       // 0x05F5   (0x0001)  MISSED
	unsigned char                                      UnknownBit05 : 1;                                           // 0x05F6:0 (0x0001)  MISSED
	unsigned char                                      UnknownBit06 : 1;                                           // 0x05F6:1 (0x0001)  MISSED
	unsigned char                                      UnknownBit07 : 1;                                           // 0x05F6:2 (0x0001)  MISSED
	bool                                               bOverrideMinLOD;                                            // 0x05F6:3 (0x0001)  
	bool                                               bUseBoundsFromMasterPoseComponent;                          // 0x05F6:4 (0x0001)  
	bool                                               bForceWireframe;                                            // 0x05F6:5 (0x0001)  
	bool                                               bDisplayBones;                                              // 0x05F6:6 (0x0001)  
	bool                                               bDisableMorphTarget;                                        // 0x05F6:7 (0x0001)  
	bool                                               bHideSkin;                                                  // 0x05F7:0 (0x0001)  
	bool                                               bPerBoneMotionBlur;                                         // 0x05F7:1 (0x0001)  
	bool                                               bComponentUseFixedSkelBounds;                               // 0x05F7:2 (0x0001)  
	bool                                               bConsiderAllBodiesForBounds;                                // 0x05F7:3 (0x0001)  
	bool                                               bSyncAttachParentLOD;                                       // 0x05F7:4 (0x0001)  
	bool                                               bCanHighlightSelectedSections;                              // 0x05F7:5 (0x0001)  
	bool                                               bRecentlyRendered;                                          // 0x05F7:6 (0x0001)  
	bool                                               bCastCapsuleDirectShadow;                                   // 0x05F7:7 (0x0001)  
	bool                                               bCastCapsuleIndirectShadow;                                 // 0x05F8:0 (0x0001)  
	bool                                               bCPUSkinning;                                               // 0x05F8:1 (0x0001)  
	bool                                               bEnableUpdateRateOptimizations;                             // 0x05F8:2 (0x0001)  
	bool                                               bDisplayDebugUpdateRateOptimizations;                       // 0x05F8:3 (0x0001)  
	bool                                               bRenderStatic;                                              // 0x05F8:4 (0x0001)  
	bool                                               bIgnoreMasterPoseComponentLOD;                              // 0x05F8:5 (0x0001)  
	unsigned char                                      UnknownBit08 : 1;                                           // 0x05F8:6 (0x0001)  MISSED
	unsigned char                                      UnknownBit09 : 1;                                           // 0x05F8:7 (0x0001)  MISSED
	bool                                               bCachedLocalBoundsUpToDate;                                 // 0x05F9:0 (0x0001)  
	unsigned char                                      UnknownBit10 : 1;                                           // 0x05F9:1 (0x0001)  MISSED
	bool                                               bForceMeshObjectUpdate;                                     // 0x05F9:2 (0x0001)  
	unsigned char                                      UnknownData11_4[0x2];                                       // 0x05FA   (0x0002)  MISSED
	float                                              CapsuleIndirectShadowMinVisibility;                         // 0x05FC   (0x0004)  
	unsigned char                                      UnknownData12_5[0x10];                                      // 0x0600   (0x0010)  MISSED
	FBoxSphereBounds                                   CachedWorldSpaceBounds;                                     // 0x0610   (0x001C)  
	unsigned char                                      UnknownData13_5[0x4];                                       // 0x062C   (0x0004)  MISSED
	FMatrix                                            CachedWorldToLocalTransform;                                // 0x0630   (0x0040)  
	unsigned char                                      UnknownData14_6[0x20];                                      // 0x0670   (0x0020)  MISSED


	/// Functions
	// Function /Script/Engine.SkinnedMeshComponent.UnloadSkinWeightProfile
	void UnloadSkinWeightProfile(FName InProfileName);                                                                       // [0x3a48870] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.UnHideBoneByName
	void UnHideBoneByName(FName BoneName);                                                                                   // [0x3a46fa0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.TransformToBoneSpace
	void TransformToBoneSpace(FName BoneName, FVector InPosition, FRotator InRotation, FVector& OutPosition, FRotator& OutRotation); // [0x3a478a0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkinnedMeshComponent.TransformFromBoneSpace
	void TransformFromBoneSpace(FName BoneName, FVector InPosition, FRotator InRotation, FVector& OutPosition, FRotator& OutRotation); // [0x3a47580] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.ShowMaterialSection
	void ShowMaterialSection(int32_t MaterialID, int32_t SectionIndex, bool bShow, int32_t LODIndex);                        // [0x3a46bd0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.ShowAllMaterialSections
	void ShowAllMaterialSections(int32_t LODIndex);                                                                          // [0x3a46b00] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.SetVertexOffsetUsage
	void SetVertexOffsetUsage(int32_t LODIndex, int32_t Usage);                                                              // [0x3a484c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.SetVertexColorOverride_LinearColor
	void SetVertexColorOverride_LinearColor(int32_t LODIndex, TArray<FLinearColor>& VertexColors);                           // [0x3a49090] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.SetSkinWeightProfile
	bool SetSkinWeightProfile(FName InProfileName);                                                                          // [0x3a48bf0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.SetSkinWeightOverride
	void SetSkinWeightOverride(int32_t LODIndex, TArray<FSkelMeshSkinWeightInfo>& SkinWeights);                              // [0x3a48e00] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.SetSkeletalMesh
	void SetSkeletalMesh(USkeletalMesh* NewMesh, bool bReinitPose);                                                          // [0x3a49760] Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.SetRenderStatic
	void SetRenderStatic(bool bNewValue);                                                                                    // [0x3a46860] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.SetPreSkinningOffsets
	void SetPreSkinningOffsets(int32_t LODIndex, TArray<FVector> Offsets);                                                   // [0x3a48250] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.SetPostSkinningOffsets
	void SetPostSkinningOffsets(int32_t LODIndex, TArray<FVector> Offsets);                                                  // [0x3a47fe0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.SetPhysicsAsset
	void SetPhysicsAsset(UPhysicsAsset* NewPhysicsAsset, bool bForceReInit);                                                 // [0x3a4a1d0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.SetMinLOD
	void SetMinLOD(int32_t InNewMinLOD);                                                                                     // [0x3a4a060] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.SetMasterPoseComponent
	void SetMasterPoseComponent(USkinnedMeshComponent* NewMasterBoneComponent, bool bForceUpdate);                           // [0x3a47e80] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.SetForcedLOD
	void SetForcedLOD(int32_t InNewForcedLOD);                                                                               // [0x3a49f30] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.SetCastCapsuleIndirectShadow
	void SetCastCapsuleIndirectShadow(bool bNewValue);                                                                       // [0x3a49d20] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.SetCastCapsuleDirectShadow
	void SetCastCapsuleDirectShadow(bool bNewValue);                                                                         // [0x3a49e10] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.SetCapsuleIndirectShadowMinVisibility
	void SetCapsuleIndirectShadowMinVisibility(float NewValue);                                                              // [0x3a49c40] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.IsUsingSkinWeightProfile
	bool IsUsingSkinWeightProfile();                                                                                         // [0x3a48820] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkinnedMeshComponent.IsMaterialSectionShown
	bool IsMaterialSectionShown(int32_t MaterialID, int32_t LODIndex);                                                       // [0x3a46960] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.IsBoneHiddenByName
	bool IsBoneHiddenByName(FName BoneName);                                                                                 // [0x3a46e50] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.HideBoneByName
	void HideBoneByName(FName BoneName, TEnumAsByte<EPhysBodyOp> PhysBodyOption);                                            // [0x3a470f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.GetVertexOffsetUsage
	int32_t GetVertexOffsetUsage(int32_t LODIndex);                                                                          // [0x3a48710] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkinnedMeshComponent.GetTwistAndSwingAngleOfDeltaRotationFromRefPose
	bool GetTwistAndSwingAngleOfDeltaRotationFromRefPose(FName BoneName, float& OutTwistAngle, float& OutSwingAngle);        // [0x3a49260] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkinnedMeshComponent.GetSocketBoneName
	FName GetSocketBoneName(FName InSocketName);                                                                             // [0x3a498c0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkinnedMeshComponent.GetRefPosePosition
	FVector GetRefPosePosition(int32_t BoneIndex);                                                                           // [0x3a47bc0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.GetParentBone
	FName GetParentBone(FName BoneName);                                                                                     // [0x3a495f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkinnedMeshComponent.GetNumLODs
	int32_t GetNumLODs();                                                                                                    // [0x3a4a180] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkinnedMeshComponent.GetNumBones
	int32_t GetNumBones();                                                                                                   // [0x3a49c00] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkinnedMeshComponent.GetForcedLOD
	int32_t GetForcedLOD();                                                                                                  // [0x3a49f10] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkinnedMeshComponent.GetDeltaTransformFromRefPose
	FTransform GetDeltaTransformFromRefPose(FName BoneName, FName BaseName);                                                 // [0x3a49450] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkinnedMeshComponent.GetCurrentSkinWeightProfileName
	FName GetCurrentSkinWeightProfileName();                                                                                 // [0x3a48850] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkinnedMeshComponent.GetBoneName
	FName GetBoneName(int32_t BoneIndex);                                                                                    // [0x3a499a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkinnedMeshComponent.GetBoneIndex
	int32_t GetBoneIndex(FName BoneName);                                                                                    // [0x3a49ac0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkinnedMeshComponent.FindClosestBone_K2
	FName FindClosestBone_K2(FVector TestLocation, FVector& BoneLocation, float IgnoreScale, bool bRequirePhysicsAsset);     // [0x3a472c0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkinnedMeshComponent.ClearVertexColorOverride
	void ClearVertexColorOverride(int32_t LODIndex);                                                                         // [0x3a48f70] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.ClearSkinWeightProfile
	void ClearSkinWeightProfile();                                                                                           // [0x3a48ab0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.ClearSkinWeightOverride
	void ClearSkinWeightOverride(int32_t LODIndex);                                                                          // [0x3a48ce0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkinnedMeshComponent.BoneIsChildOf
	bool BoneIsChildOf(FName BoneName, FName ParentBoneName);                                                                // [0x3a47d10] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Engine.SkeletalMeshComponent
/// Size: 0x0840 (0x000690 - 0x000ED0)
class USkeletalMeshComponent : public USkinnedMeshComponent
{ 
public:
	UAnimBlueprintGeneratedClass*                      AnimBlueprintGeneratedClass;                                // 0x0690   (0x0008)  
	UClass*                                            AnimClass;                                                  // 0x0698   (0x0008)  
	UAnimInstance*                                     AnimScriptInstance;                                         // 0x06A0   (0x0008)  
	UAnimInstance*                                     PostProcessAnimInstance;                                    // 0x06A8   (0x0008)  
	FSingleAnimationPlayData                           AnimationData;                                              // 0x06B0   (0x0018)  
	unsigned char                                      UnknownData00_5[0x10];                                      // 0x06C8   (0x0010)  MISSED
	FVector                                            RootBoneTranslation;                                        // 0x06D8   (0x000C)  
	FVector                                            LineCheckBoundsScale;                                       // 0x06E4   (0x000C)  
	unsigned char                                      UnknownData01_5[0x30];                                      // 0x06F0   (0x0030)  MISSED
	TArray<UAnimInstance*>                             LinkedInstances;                                            // 0x0720   (0x0010)  
	TArray<FTransform>                                 CachedBoneSpaceTransforms;                                  // 0x0730   (0x0010)  
	TArray<FTransform>                                 CachedComponentSpaceTransforms;                             // 0x0740   (0x0010)  
	unsigned char                                      UnknownData02_5[0x150];                                     // 0x0750   (0x0150)  MISSED
	float                                              GlobalAnimRateScale;                                        // 0x08A0   (0x0004)  
	TEnumAsByte<EKinematicBonesUpdateToPhysics>        KinematicBonesUpdateType;                                   // 0x08A4   (0x0001)  
	TEnumAsByte<EPhysicsTransformUpdateMode>           PhysicsTransformUpdateMode;                                 // 0x08A5   (0x0001)  
	unsigned char                                      UnknownData03_5[0x1];                                       // 0x08A6   (0x0001)  MISSED
	TEnumAsByte<EAnimationMode>                        AnimationMode;                                              // 0x08A7   (0x0001)  
	unsigned char                                      UnknownData04_5[0x1];                                       // 0x08A8   (0x0001)  MISSED
	bool                                               bDisablePostProcessBlueprint;                               // 0x08A9:0 (0x0001)  
	unsigned char                                      UnknownBit05 : 1;                                           // 0x08A9:1 (0x0001)  MISSED
	bool                                               bUpdateOverlapsOnAnimationFinalize;                         // 0x08A9:2 (0x0001)  
	unsigned char                                      UnknownBit06 : 1;                                           // 0x08A9:3 (0x0001)  MISSED
	bool                                               bHasValidBodies;                                            // 0x08A9:4 (0x0001)  
	bool                                               bBlendPhysics;                                              // 0x08A9:5 (0x0001)  
	bool                                               bEnablePhysicsOnDedicatedServer;                            // 0x08A9:6 (0x0001)  
	bool                                               bUpdateJointsFromAnimation;                                 // 0x08A9:7 (0x0001)  
	bool                                               bDisableClothSimulation;                                    // 0x08AA:0 (0x0001)  
	unsigned char                                      UnknownData07_3[0x5];                                       // 0x08AB   (0x0005)  MISSED
	unsigned char                                      UnknownBit08 : 1;                                           // 0x08B0:0 (0x0001)  MISSED
	bool                                               bDisableRigidBodyAnimNode;                                  // 0x08B0:1 (0x0001)  
	bool                                               bAllowAnimCurveEvaluation;                                  // 0x08B0:2 (0x0001)  
	bool                                               bDisableAnimCurves;                                         // 0x08B0:3 (0x0001)  
	unsigned char                                      UnknownBit09 : 1;                                           // 0x08B0:4 (0x0001)  MISSED
	unsigned char                                      UnknownBit10 : 1;                                           // 0x08B0:5 (0x0001)  MISSED
	unsigned char                                      UnknownBit11 : 1;                                           // 0x08B0:6 (0x0001)  MISSED
	bool                                               bCollideWithEnvironment;                                    // 0x08B0:7 (0x0001)  
	bool                                               bCollideWithAttachedChildren;                               // 0x08B1:0 (0x0001)  
	bool                                               bLocalSpaceSimulation;                                      // 0x08B1:1 (0x0001)  
	bool                                               bResetAfterTeleport;                                        // 0x08B1:2 (0x0001)  
	unsigned char                                      UnknownBit12 : 1;                                           // 0x08B1:3 (0x0001)  MISSED
	bool                                               bDeferKinematicBoneUpdate;                                  // 0x08B1:4 (0x0001)  
	bool                                               bNoSkeletonUpdate;                                          // 0x08B1:5 (0x0001)  
	bool                                               bPauseAnims;                                                // 0x08B1:6 (0x0001)  
	bool                                               bUseRefPoseOnInitAnim;                                      // 0x08B1:7 (0x0001)  
	bool                                               bEnablePerPolyCollision;                                    // 0x08B2:0 (0x0001)  
	bool                                               bForceRefpose;                                              // 0x08B2:1 (0x0001)  
	bool                                               bOnlyAllowAutonomousTickPose;                               // 0x08B2:2 (0x0001)  
	bool                                               bIsAutonomousTickPose;                                      // 0x08B2:3 (0x0001)  
	bool                                               bOldForceRefPose;                                           // 0x08B2:4 (0x0001)  
	bool                                               bShowPrePhysBones;                                          // 0x08B2:5 (0x0001)  
	bool                                               bRequiredBonesUpToDate;                                     // 0x08B2:6 (0x0001)  
	bool                                               bAnimTreeInitialised;                                       // 0x08B2:7 (0x0001)  
	bool                                               bIncludeComponentLocationIntoBounds;                        // 0x08B3:0 (0x0001)  
	bool                                               bEnableLineCheckWithBounds;                                 // 0x08B3:1 (0x0001)  
	bool                                               bUseBendingElements;                                        // 0x08B3:2 (0x0001)  
	bool                                               bUseTetrahedralConstraints;                                 // 0x08B3:3 (0x0001)  
	bool                                               bUseThinShellVolumeConstraints;                             // 0x08B3:4 (0x0001)  
	bool                                               bUseSelfCollisions;                                         // 0x08B3:5 (0x0001)  
	bool                                               bUseContinuousCollisionDetection;                           // 0x08B3:6 (0x0001)  
	bool                                               bPropagateCurvesToSlaves;                                   // 0x08B3:7 (0x0001)  
	bool                                               bSkipKinematicUpdateWhenInterpolating;                      // 0x08B4:0 (0x0001)  
	bool                                               bSkipBoundsUpdateWhenInterpolating;                         // 0x08B4:1 (0x0001)  
	unsigned char                                      UnknownBit13 : 1;                                           // 0x08B4:2 (0x0001)  MISSED
	unsigned char                                      UnknownBit14 : 1;                                           // 0x08B4:3 (0x0001)  MISSED
	bool                                               bNeedsQueuedAnimEventsDispatched;                           // 0x08B4:4 (0x0001)  
	unsigned char                                      UnknownData15_4[0x1];                                       // 0x08B5   (0x0001)  MISSED
	uint16_t                                           CachedAnimCurveUidVersion;                                  // 0x08B6   (0x0002)  
	EClothMassMode                                     MassMode;                                                   // 0x08B8   (0x0001)  
	unsigned char                                      UnknownData16_5[0x3];                                       // 0x08B9   (0x0003)  MISSED
	float                                              UniformMass;                                                // 0x08BC   (0x0004)  
	float                                              TotalMass;                                                  // 0x08C0   (0x0004)  
	float                                              Density;                                                    // 0x08C4   (0x0004)  
	float                                              MinPerParticleMass;                                         // 0x08C8   (0x0004)  
	float                                              ClothBlendWeight;                                           // 0x08CC   (0x0004)  
	float                                              EdgeStiffness;                                              // 0x08D0   (0x0004)  
	float                                              BendingStiffness;                                           // 0x08D4   (0x0004)  
	float                                              AreaStiffness;                                              // 0x08D8   (0x0004)  
	float                                              VolumeStiffness;                                            // 0x08DC   (0x0004)  
	float                                              StrainLimitingStiffness;                                    // 0x08E0   (0x0004)  
	float                                              ShapeTargetStiffness;                                       // 0x08E4   (0x0004)  
	bool                                               bWaitForParallelClothTask;                                  // 0x08E8   (0x0001)  
	unsigned char                                      UnknownData17_5[0x7];                                       // 0x08E9   (0x0007)  MISSED
	TArray<FName>                                      DisallowedAnimCurves;                                       // 0x08F0   (0x0010)  
	UBodySetup*                                        BodySetup;                                                  // 0x0900   (0x0008)  
	unsigned char                                      UnknownData18_5[0x8];                                       // 0x0908   (0x0008)  MISSED
	FMulticastInlineDelegate                           OnConstraintBroken;                                         // 0x0910   (0x0010)  
	UClass*                                            ClothingSimulationFactory;                                  // 0x0920   (0x0008)  
	unsigned char                                      UnknownData19_5[0xD0];                                      // 0x0928   (0x00D0)  MISSED
	float                                              TeleportDistanceThreshold;                                  // 0x09F8   (0x0004)  
	float                                              TeleportRotationThreshold;                                  // 0x09FC   (0x0004)  
	unsigned char                                      UnknownData20_5[0x8];                                       // 0x0A00   (0x0008)  MISSED
	uint32_t                                           LastPoseTickFrame;                                          // 0x0A08   (0x0004)  
	unsigned char                                      UnknownData21_5[0x54];                                      // 0x0A0C   (0x0054)  MISSED
	UClothingSimulationInteractor*                     ClothingInteractor;                                         // 0x0A60   (0x0008)  
	unsigned char                                      UnknownData22_5[0xC8];                                      // 0x0A68   (0x00C8)  MISSED
	FMulticastInlineDelegate                           OnAnimInitialized;                                          // 0x0B30   (0x0010)  
	unsigned char                                      UnknownData23_6[0x390];                                     // 0x0B40   (0x0390)  MISSED


	/// Functions
	// Function /Script/Engine.SkeletalMeshComponent.UnlinkAnimClassLayers
	void UnlinkAnimClassLayers(UClass* InClass);                                                                             // [0x3a40de0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.UnbindClothFromMasterPoseComponent
	void UnbindClothFromMasterPoseComponent(bool bRestoreSimulationSpace);                                                   // [0x3a3f650] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.ToggleDisablePostProcessBlueprint
	void ToggleDisablePostProcessBlueprint();                                                                                // [0x3a42c10] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.TermBodiesBelow
	void TermBodiesBelow(FName ParentBoneName);                                                                              // [0x3a3d5a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SuspendClothingSimulation
	void SuspendClothingSimulation();                                                                                        // [0x3a3f880] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.Stop
	void Stop();                                                                                                             // [0x3a40690] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SnapshotPose
	void SnapshotPose(FPoseSnapshot& Snapshot);                                                                              // [0x3a3f9d0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetUpdateClothInEditor
	void SetUpdateClothInEditor(bool NewUpdateState);                                                                        // [0x1773b90] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetUpdateAnimationInEditor
	void SetUpdateAnimationInEditor(bool NewUpdateState);                                                                    // [0x1773b90] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetTeleportRotationThreshold
	void SetTeleportRotationThreshold(float Threshold);                                                                      // [0x3a3ed70] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetTeleportDistanceThreshold
	void SetTeleportDistanceThreshold(float Threshold);                                                                      // [0x3a3ec70] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetPosition
	void SetPosition(float InPos, bool bFireNotifies);                                                                       // [0x3a40460] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetPlayRate
	void SetPlayRate(float Rate);                                                                                            // [0x3a402d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetPhysicsBlendWeight
	void SetPhysicsBlendWeight(float PhysicsBlendWeight);                                                                    // [0x3a3d390] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetNotifyRigidBodyCollisionBelow
	void SetNotifyRigidBodyCollisionBelow(bool bNewNotifyRigidBodyCollision, FName BoneName, bool bIncludeSelf);             // [0x3a3e8e0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetMorphTarget
	void SetMorphTarget(FName MorphTargetName, float Value, bool bRemoveZeroWeight);                                         // [0x3a3fcb0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetEnablePhysicsBlending
	void SetEnablePhysicsBlending(bool bNewBlendPhysics);                                                                    // [0x3a3d2b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetEnableGravityOnAllBodiesBelow
	void SetEnableGravityOnAllBodiesBelow(bool bEnableGravity, FName BoneName, bool bIncludeSelf);                           // [0x3a3e420] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetEnableBodyGravity
	void SetEnableBodyGravity(bool bEnableGravity, FName BoneName);                                                          // [0x3a3e750] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetDisablePostProcessBlueprint
	void SetDisablePostProcessBlueprint(bool bInDisablePostProcess);                                                         // [0x3a42ad0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetDisableAnimCurves
	void SetDisableAnimCurves(bool bInDisableAnimCurves);                                                                    // [0x3a3f360] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetConstraintProfileForAll
	void SetConstraintProfileForAll(FName ProfileName, bool bDefaultIfNotFound);                                             // [0x3a3ba40] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetConstraintProfile
	void SetConstraintProfile(FName JointName, FName ProfileName, bool bDefaultIfNotFound);                                  // [0x3a3bc60] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetClothMaxDistanceScale
	void SetClothMaxDistanceScale(float Scale);                                                                              // [0x3a3f8e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetBodyNotifyRigidBodyCollision
	void SetBodyNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision, FName BoneName);                                 // [0x3a3ead0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetAnimClass
	void SetAnimClass(UClass* NewClass);                                                                                     // [0x3a41460] Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetAnimationMode
	void SetAnimationMode(TEnumAsByte<EAnimationMode> InAnimationMode);                                                      // [0x3a40a00] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetAnimation
	void SetAnimation(UAnimationAsset* NewAnimToPlay);                                                                       // [0x3a40790] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetAngularLimits
	void SetAngularLimits(FName InBoneName, float Swing1LimitAngle, float TwistLimitAngle, float Swing2LimitAngle);          // [0x3a3b200] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetAllowRigidBodyAnimNode
	void SetAllowRigidBodyAnimNode(bool bInAllow, bool bReinitAnim);                                                         // [0x3a3f490] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetAllowedAnimCurvesEvaluation
	void SetAllowedAnimCurvesEvaluation(TArray<FName>& List, bool bAllow);                                                   // [0x3a3ee60] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetAllowAnimCurveEvaluation
	void SetAllowAnimCurveEvaluation(bool bInAllow);                                                                         // [0x3a3f230] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetAllMotorsAngularVelocityDrive
	void SetAllMotorsAngularVelocityDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType);      // [0x3a3c2b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetAllMotorsAngularPositionDrive
	void SetAllMotorsAngularPositionDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType);      // [0x3a3c5f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetAllMotorsAngularDriveParams
	void SetAllMotorsAngularDriveParams(float InSpring, float InDamping, float InForceLimit, bool bSkipCustomPhysicsType);   // [0x3a3bf10] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetAllBodiesSimulatePhysics
	void SetAllBodiesSimulatePhysics(bool bNewSimulate);                                                                     // [0x3a3d4c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetAllBodiesPhysicsBlendWeight
	void SetAllBodiesPhysicsBlendWeight(float PhysicsBlendWeight, bool bSkipCustomPhysicsType);                              // [0x3a3ce70] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetAllBodiesBelowSimulatePhysics
	void SetAllBodiesBelowSimulatePhysics(FName& InBoneName, bool bNewSimulate, bool bIncludeSelf);                          // [0x3a3d0b0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.SetAllBodiesBelowPhysicsBlendWeight
	void SetAllBodiesBelowPhysicsBlendWeight(FName& InBoneName, float PhysicsBlendWeight, bool bSkipCustomPhysicsType, bool bIncludeSelf); // [0x3a3cb80] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.ResumeClothingSimulation
	void ResumeClothingSimulation();                                                                                         // [0x3a3f850] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.ResetClothTeleportMode
	void ResetClothTeleportMode();                                                                                           // [0x3a3f800] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.ResetAnimInstanceDynamics
	void ResetAnimInstanceDynamics(ETeleportType InTeleportType);                                                            // [0x3a40ad0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.ResetAllowedAnimCurveEvaluation
	void ResetAllowedAnimCurveEvaluation();                                                                                  // [0x3a3eff0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.ResetAllBodiesSimulatePhysics
	void ResetAllBodiesSimulatePhysics();                                                                                    // [0x3a3cfe0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.PlayAnimation
	void PlayAnimation(UAnimationAsset* NewAnimToPlay, bool bLooping);                                                       // [0x3a40870] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.Play
	void Play(bool bLooping);                                                                                                // [0x3a406b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.OverrideAnimationData
	void OverrideAnimationData(UAnimationAsset* InAnimToPlay, bool bIsLooping, bool bIsPlaying, float Position, float PlayRate); // [0x3a3fea0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.LinkAnimGraphByTag
	void LinkAnimGraphByTag(FName InTag, UClass* InClass);                                                                   // [0x3a40fe0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.LinkAnimClassLayers
	void LinkAnimClassLayers(UClass* InClass);                                                                               // [0x3a40ee0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.K2_GetClosestPointOnPhysicsAsset
	bool K2_GetClosestPointOnPhysicsAsset(FVector& WorldPosition, FVector& ClosestWorldPosition, FVector& Normal, FName& BoneName, float& Distance); // [0x3a3e030] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.IsPlaying
	bool IsPlaying();                                                                                                        // [0x3a405d0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.IsClothingSimulationSuspended
	bool IsClothingSimulationSuspended();                                                                                    // [0x3a3f820] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.IsBodyGravityEnabled
	bool IsBodyGravityEnabled(FName BoneName);                                                                               // [0x3a3e650] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.HasValidAnimationInstance
	bool HasValidAnimationInstance();                                                                                        // [0x3a40ba0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetTeleportRotationThreshold
	float GetTeleportRotationThreshold();                                                                                    // [0x3a3ed50] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetTeleportDistanceThreshold
	float GetTeleportDistanceThreshold();                                                                                    // [0x3a3ed50] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetStringAttribute_Ref
	bool GetStringAttribute_Ref(FName& BoneName, FName& AttributeName, FString& OutValue, ECustomBoneAttributeLookup LookupType); // [0x3a420c0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.GetStringAttribute
	bool GetStringAttribute(FName& BoneName, FName& AttributeName, FString DefaultValue, FString& OutValue, ECustomBoneAttributeLookup LookupType); // [0x3a41540] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.GetSkeletalCenterOfMass
	FVector GetSkeletalCenterOfMass();                                                                                       // [0x3a3dc00] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetPostProcessInstance
	UAnimInstance* GetPostProcessInstance();                                                                                 // [0x3a413b0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetPosition
	float GetPosition();                                                                                                     // [0x3a403a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetPlayRate
	float GetPlayRate();                                                                                                     // [0x3a40210] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetMorphTarget
	float GetMorphTarget(FName MorphTargetName);                                                                             // [0x3a3fae0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetLinkedAnimLayerInstanceByGroup
	UAnimInstance* GetLinkedAnimLayerInstanceByGroup(FName InGroup);                                                         // [0x3a40ce0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetLinkedAnimLayerInstanceByClass
	UAnimInstance* GetLinkedAnimLayerInstanceByClass(UClass* InClass);                                                       // [0x3a40be0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstancesByTag
	void GetLinkedAnimGraphInstancesByTag(FName InTag, TArray<UAnimInstance*>& OutLinkedInstances);                          // [0x3a41140] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstanceByTag
	UAnimInstance* GetLinkedAnimGraphInstanceByTag(FName InTag);                                                             // [0x3a412b0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetIntegerAttribute_Ref
	bool GetIntegerAttribute_Ref(FName& BoneName, FName& AttributeName, int32_t& OutValue, ECustomBoneAttributeLookup LookupType); // [0x3a423c0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.GetIntegerAttribute
	bool GetIntegerAttribute(FName& BoneName, FName& AttributeName, int32_t DefaultValue, int32_t& OutValue, ECustomBoneAttributeLookup LookupType); // [0x3a418e0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.GetFloatAttribute_Ref
	bool GetFloatAttribute_Ref(FName& BoneName, FName& AttributeName, float& OutValue, ECustomBoneAttributeLookup LookupType); // [0x3a42740] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.GetFloatAttribute
	bool GetFloatAttribute(FName& BoneName, FName& AttributeName, float DefaultValue, float& OutValue, ECustomBoneAttributeLookup LookupType); // [0x3a41cd0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.GetDisablePostProcessBlueprint
	bool GetDisablePostProcessBlueprint();                                                                                   // [0x3a42be0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetDisableAnimCurves
	bool GetDisableAnimCurves();                                                                                             // [0x3a3f330] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetCurrentJointAngles
	void GetCurrentJointAngles(FName InBoneName, float& Swing1Angle, float& TwistAngle, float& Swing2Angle);                 // [0x3a3aee0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.GetClothMaxDistanceScale
	float GetClothMaxDistanceScale();                                                                                        // [0x3a3f9b0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetClothingSimulationInteractor
	UClothingSimulationInteractor* GetClothingSimulationInteractor();                                                        // [0x3a3ec50] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetBoneMass
	float GetBoneMass(FName BoneName, bool bScaleMass);                                                                      // [0x3a3de30] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetAnimInstance
	UAnimInstance* GetAnimInstance();                                                                                        // [0x3a413d0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetAnimClass
	UClass* GetAnimClass();                                                                                                  // [0x3a413f0] Final|Native|Public  
	// Function /Script/Engine.SkeletalMeshComponent.GetAnimationMode
	TEnumAsByte<EAnimationMode> GetAnimationMode();                                                                          // [0x3a409e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetAllowRigidBodyAnimNode
	bool GetAllowRigidBodyAnimNode();                                                                                        // [0x3a3f460] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.GetAllowedAnimCurveEvaluate
	bool GetAllowedAnimCurveEvaluate();                                                                                      // [0x3a3f200] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.SkeletalMeshComponent.ForceClothNextUpdateTeleportAndReset
	void ForceClothNextUpdateTeleportAndReset();                                                                             // [0x3a3f8a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.ForceClothNextUpdateTeleport
	void ForceClothNextUpdateTeleport();                                                                                     // [0x3a3f8c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.FindConstraintBoneName
	FName FindConstraintBoneName(int32_t ConstraintIndex);                                                                   // [0x3a3b910] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.ClearMorphTargets
	void ClearMorphTargets();                                                                                                // [0x3a3fc70] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.BreakConstraint
	void BreakConstraint(FVector Impulse, FVector HitLocation, FName InBoneName);                                            // [0x3a3b5f0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.BindClothToMasterPoseComponent
	void BindClothToMasterPoseComponent();                                                                                   // [0x3a3f770] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.AllowAnimCurveEvaluation
	void AllowAnimCurveEvaluation(FName NameOfCurve, bool bAllow);                                                           // [0x3a3f040] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.AddImpulseToAllBodiesBelow
	void AddImpulseToAllBodiesBelow(FVector Impulse, FName BoneName, bool bVelChange, bool bIncludeSelf);                    // [0x3a3d680] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.AddForceToAllBodiesBelow
	void AddForceToAllBodiesBelow(FVector Force, FName BoneName, bool bAccelChange, bool bIncludeSelf);                      // [0x3a3d940] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.SkeletalMeshComponent.AccumulateAllBodiesBelowPhysicsBlendWeight
	void AccumulateAllBodiesBelowPhysicsBlendWeight(FName& InBoneName, float AddPhysicsBlendWeight, bool bSkipCustomPhysicsType); // [0x3a3c920] Final|Native|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/Engine.AnimInstance
/// Size: 0x0298 (0x000028 - 0x0002C0)
class UAnimInstance : public UObject
{ 
public:
	USkeleton*                                         CurrentSkeleton;                                            // 0x0028   (0x0008)  
	TEnumAsByte<ERootMotionMode>                       RootMotionMode;                                             // 0x0030   (0x0001)  
	bool                                               bUseMultiThreadedAnimationUpdate;                           // 0x0031:0 (0x0001)  
	bool                                               bUsingCopyPoseFromMesh;                                     // 0x0031:1 (0x0001)  
	unsigned char                                      UnknownBit00 : 1;                                           // 0x0031:2 (0x0001)  MISSED
	unsigned char                                      UnknownBit01 : 1;                                           // 0x0031:3 (0x0001)  MISSED
	bool                                               bReceiveNotifiesFromLinkedInstances;                        // 0x0031:4 (0x0001)  
	bool                                               bPropagateNotifiesToLinkedInstances;                        // 0x0031:5 (0x0001)  
	bool                                               bQueueMontageEvents;                                        // 0x0031:6 (0x0001)  
	unsigned char                                      UnknownData02_4[0x6];                                       // 0x0032   (0x0006)  MISSED
	FMulticastInlineDelegate                           OnMontageBlendingOut;                                       // 0x0038   (0x0010)  
	FMulticastInlineDelegate                           OnMontageStarted;                                           // 0x0048   (0x0010)  
	FMulticastInlineDelegate                           OnMontageEnded;                                             // 0x0058   (0x0010)  
	FMulticastInlineDelegate                           OnAllMontageInstancesEnded;                                 // 0x0068   (0x0010)  
	unsigned char                                      UnknownData03_5[0x88];                                      // 0x0078   (0x0088)  MISSED
	FAnimNotifyQueue                                   NotifyQueue;                                                // 0x0100   (0x0070)  
	TArray<FAnimNotifyEvent>                           ActiveAnimNotifyState;                                      // 0x0170   (0x0010)  
	unsigned char                                      UnknownData04_6[0x140];                                     // 0x0180   (0x0140)  MISSED


	/// Functions
	// Function /Script/Engine.AnimInstance.UnlockAIResources
	void UnlockAIResources(bool bUnlockMovement, bool UnlockAILogic);                                                        // [0x3876260] Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.UnlinkAnimClassLayers
	void UnlinkAnimClassLayers(UClass* InClass);                                                                             // [0x3878b60] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.TryGetPawnOwner
	APawn* TryGetPawnOwner();                                                                                                // [0x387c370] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.StopSlotAnimation
	void StopSlotAnimation(float InBlendOutTime, FName SlotNodeName);                                                        // [0x387af10] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.SnapshotPose
	void SnapshotPose(FPoseSnapshot& Snapshot);                                                                              // [0x387c180] Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.SetRootMotionMode
	void SetRootMotionMode(TEnumAsByte<ERootMotionMode> Value);                                                              // [0x3864c70] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.SetReceiveNotifiesFromLinkedInstances
	void SetReceiveNotifiesFromLinkedInstances(bool bSet);                                                                   // [0x387c070] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.SetPropagateNotifiesToLinkedInstances
	void SetPropagateNotifiesToLinkedInstances(bool bSet);                                                                   // [0x387bf60] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.SetMorphTarget
	void SetMorphTarget(FName MorphTargetName, float Value);                                                                 // [0x38766d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.SavePoseSnapshot
	void SavePoseSnapshot(FName SnapshotName);                                                                               // [0x387c290] Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.ResetDynamics
	void ResetDynamics(ETeleportType InTeleportType);                                                                        // [0x3875920] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage
	UAnimMontage* PlaySlotAnimationAsDynamicMontage(UAnimSequenceBase* Asset, FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // [0x387b070] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.PlaySlotAnimation
	float PlaySlotAnimation(UAnimSequenceBase* Asset, FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount); // [0x387bb80] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.Montage_StopGroupByName
	void Montage_StopGroupByName(float InBlendOutTime, FName GroupName);                                                     // [0x387a700] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.Montage_Stop
	void Montage_Stop(float InBlendOutTime, UAnimMontage* Montage);                                                          // [0x387a860] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.Montage_SetPosition
	void Montage_SetPosition(UAnimMontage* Montage, float NewPosition);                                                      // [0x3879520] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.Montage_SetPlayRate
	void Montage_SetPlayRate(UAnimMontage* Montage, float NewPlayRate);                                                      // [0x3879c50] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.Montage_SetNextSection
	void Montage_SetNextSection(FName SectionNameToChange, FName NextSection, UAnimMontage* Montage);                        // [0x3879e20] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.Montage_Resume
	void Montage_Resume(UAnimMontage* Montage);                                                                              // [0x387a480] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.Montage_Play
	float Montage_Play(UAnimMontage* MontageToPlay, float InPlayRate, EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages); // [0x387a9c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.Montage_Pause
	void Montage_Pause(UAnimMontage* Montage);                                                                               // [0x387a5d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.Montage_JumpToSectionsEnd
	void Montage_JumpToSectionsEnd(FName SectionName, UAnimMontage* Montage);                                                // [0x387a0a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.Montage_JumpToSection
	void Montage_JumpToSection(FName SectionName, UAnimMontage* Montage);                                                    // [0x387a290] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.Montage_IsPlaying
	bool Montage_IsPlaying(UAnimMontage* Montage);                                                                           // [0x38799d0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.Montage_IsActive
	bool Montage_IsActive(UAnimMontage* Montage);                                                                            // [0x3879b20] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.Montage_GetPosition
	float Montage_GetPosition(UAnimMontage* Montage);                                                                        // [0x3879710] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.Montage_GetPlayRate
	float Montage_GetPlayRate(UAnimMontage* Montage);                                                                        // [0x38791a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.Montage_GetIsStopped
	bool Montage_GetIsStopped(UAnimMontage* Montage);                                                                        // [0x3879420] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.Montage_GetCurrentSection
	FName Montage_GetCurrentSection(UAnimMontage* Montage);                                                                  // [0x3879850] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.Montage_GetBlendTime
	float Montage_GetBlendTime(UAnimMontage* Montage);                                                                       // [0x38792e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.LockAIResources
	void LockAIResources(bool bLockMovement, bool LockAILogic);                                                              // [0x38763b0] Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.LinkAnimGraphByTag
	void LinkAnimGraphByTag(FName InTag, UClass* InClass);                                                                   // [0x3878d40] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.LinkAnimClassLayers
	void LinkAnimClassLayers(UClass* InClass);                                                                               // [0x3878c50] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.IsSyncGroupBetweenMarkers
	bool IsSyncGroupBetweenMarkers(FName InSyncGroupName, FName PreviousMarker, FName NextMarker, bool bRespectMarkerOrder); // [0x3875b90] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.IsPlayingSlotAnimation
	bool IsPlayingSlotAnimation(UAnimSequenceBase* Asset, FName SlotNodeName);                                               // [0x387ace0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.IsAnyMontagePlaying
	bool IsAnyMontagePlaying();                                                                                              // [0x3879170] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.HasMarkerBeenHitThisFrame
	bool HasMarkerBeenHitThisFrame(FName SyncGroup, FName MarkerName);                                                       // [0x3875f20] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.GetTimeToClosestMarker
	bool GetTimeToClosestMarker(FName SyncGroup, FName MarkerName, float& OutMarkerTime);                                    // [0x3876090] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.GetSyncGroupPosition
	FMarkerSyncAnimPosition GetSyncGroupPosition(FName InSyncGroupName);                                                     // [0x3875a00] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.GetRelevantAnimTimeRemainingFraction
	float GetRelevantAnimTimeRemainingFraction(int32_t MachineIndex, int32_t StateIndex);                                    // [0x38773d0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.AnimInstance.GetRelevantAnimTimeRemaining
	float GetRelevantAnimTimeRemaining(int32_t MachineIndex, int32_t StateIndex);                                            // [0x3877540] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.AnimInstance.GetRelevantAnimTimeFraction
	float GetRelevantAnimTimeFraction(int32_t MachineIndex, int32_t StateIndex);                                             // [0x3876dd0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.AnimInstance.GetRelevantAnimTime
	float GetRelevantAnimTime(int32_t MachineIndex, int32_t StateIndex);                                                     // [0x3877030] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.AnimInstance.GetRelevantAnimLength
	float GetRelevantAnimLength(int32_t MachineIndex, int32_t StateIndex);                                                   // [0x38771a0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.AnimInstance.GetReceiveNotifiesFromLinkedInstances
	bool GetReceiveNotifiesFromLinkedInstances();                                                                            // [0x387c150] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.GetPropagateNotifiesToLinkedInstances
	bool GetPropagateNotifiesToLinkedInstances();                                                                            // [0x387c040] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.GetOwningComponent
	USkeletalMeshComponent* GetOwningComponent();                                                                            // [0x387bf10] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.GetOwningActor
	AActor* GetOwningActor();                                                                                                // [0x387bf30] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.GetLinkedAnimLayerInstancesByGroup
	void GetLinkedAnimLayerInstancesByGroup(FName InGroup, TArray<UAnimInstance*>& OutLinkedInstances);                      // [0x3878900] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.GetLinkedAnimLayerInstanceByGroupAndClass
	UAnimInstance* GetLinkedAnimLayerInstanceByGroupAndClass(FName InGroup, UClass* InClass);                                // [0x3878790] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.GetLinkedAnimLayerInstanceByGroup
	UAnimInstance* GetLinkedAnimLayerInstanceByGroup(FName InGroup);                                                         // [0x3878a70] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.GetLinkedAnimLayerInstanceByClass
	UAnimInstance* GetLinkedAnimLayerInstanceByClass(UClass* InClass);                                                       // [0x38786a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.GetLinkedAnimGraphInstancesByTag
	void GetLinkedAnimGraphInstancesByTag(FName InTag, TArray<UAnimInstance*>& OutLinkedInstances);                          // [0x3878ea0] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.GetLinkedAnimGraphInstanceByTag
	UAnimInstance* GetLinkedAnimGraphInstanceByTag(FName InTag);                                                             // [0x3879010] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.GetInstanceTransitionTimeElapsedFraction
	float GetInstanceTransitionTimeElapsedFraction(int32_t MachineIndex, int32_t TransitionIndex);                           // [0x38776b0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.AnimInstance.GetInstanceTransitionTimeElapsed
	float GetInstanceTransitionTimeElapsed(int32_t MachineIndex, int32_t TransitionIndex);                                   // [0x3877970] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.AnimInstance.GetInstanceTransitionCrossfadeDuration
	float GetInstanceTransitionCrossfadeDuration(int32_t MachineIndex, int32_t TransitionIndex);                             // [0x3877ae0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.AnimInstance.GetInstanceStateWeight
	float GetInstanceStateWeight(int32_t MachineIndex, int32_t StateIndex);                                                  // [0x3877d40] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.AnimInstance.GetInstanceMachineWeight
	float GetInstanceMachineWeight(int32_t MachineIndex);                                                                    // [0x3877eb0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.AnimInstance.GetInstanceCurrentStateElapsedTime
	float GetInstanceCurrentStateElapsedTime(int32_t MachineIndex);                                                          // [0x3877c50] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEndFraction
	float GetInstanceAssetPlayerTimeFromEndFraction(int32_t AssetPlayerIndex);                                               // [0x3877fa0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEnd
	float GetInstanceAssetPlayerTimeFromEnd(int32_t AssetPlayerIndex);                                                       // [0x3878170] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.AnimInstance.GetInstanceAssetPlayerTimeFraction
	float GetInstanceAssetPlayerTimeFraction(int32_t AssetPlayerIndex);                                                      // [0x3878330] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.AnimInstance.GetInstanceAssetPlayerTime
	float GetInstanceAssetPlayerTime(int32_t AssetPlayerIndex);                                                              // [0x3878420] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.AnimInstance.GetInstanceAssetPlayerLength
	float GetInstanceAssetPlayerLength(int32_t AssetPlayerIndex);                                                            // [0x3878510] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.AnimInstance.GetCurveValue
	float GetCurveValue(FName CurveName);                                                                                    // [0x3876ce0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.GetCurrentStateName
	FName GetCurrentStateName(int32_t MachineIndex);                                                                         // [0x3876840] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.AnimInstance.GetCurrentActiveMontage
	UAnimMontage* GetCurrentActiveMontage();                                                                                 // [0x3879100] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.GetAllCurveNames
	void GetAllCurveNames(TArray<FName>& OutNames);                                                                          // [0x3876980] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.GetActiveCurveNames
	void GetActiveCurveNames(EAnimCurveType CurveType, TArray<FName>& OutNames);                                             // [0x3876ab0] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.ClearMorphTargets
	void ClearMorphTargets();                                                                                                // [0x3876680] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.AnimInstance.CalculateDirection
	float CalculateDirection(FVector& Velocity, FRotator& BaseRotation);                                                     // [0x3876500] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.AnimInstance.BlueprintUpdateAnimation
	void BlueprintUpdateAnimation(float DeltaTimeX);                                                                         // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.AnimInstance.BlueprintPostEvaluateAnimation
	void BlueprintPostEvaluateAnimation();                                                                                   // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.AnimInstance.BlueprintLinkedAnimationLayersInitialized
	void BlueprintLinkedAnimationLayersInitialized();                                                                        // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.AnimInstance.BlueprintInitializeAnimation
	void BlueprintInitializeAnimation();                                                                                     // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.AnimInstance.BlueprintBeginPlay
	void BlueprintBeginPlay();                                                                                               // [0x1ad0090] Event|Public|BlueprintEvent 
};

/// Class /Script/Engine.BlueprintGeneratedClass
/// Size: 0x00F8 (0x000230 - 0x000328)
class UBlueprintGeneratedClass : public UClass
{ 
public:
	int32_t                                            NumReplicatedProperties;                                    // 0x0230   (0x0004)  
	bool                                               bHasNativizedParent;                                        // 0x0234:0 (0x0001)  
	bool                                               bHasCookedComponentInstancingData;                          // 0x0234:1 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0235   (0x0003)  MISSED
	TArray<UDynamicBlueprintBinding*>                  DynamicBindingObjects;                                      // 0x0238   (0x0010)  
	TArray<UActorComponent*>                           ComponentTemplates;                                         // 0x0248   (0x0010)  
	TArray<UTimelineTemplate*>                         Timelines;                                                  // 0x0258   (0x0010)  
	TArray<FBPComponentClassOverride>                  ComponentClassOverrides;                                    // 0x0268   (0x0010)  
	USimpleConstructionScript*                         SimpleConstructionScript;                                   // 0x0278   (0x0008)  
	UInheritableComponentHandler*                      InheritableComponentHandler;                                // 0x0280   (0x0008)  
	UStructProperty*                                   UberGraphFramePointerProperty;                              // 0x0288   (0x0008)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x0290   (0x0008)  MISSED
	UFunction*                                         UberGraphFunction;                                          // 0x0298   (0x0008)  
	TMap<FName, FBlueprintCookedComponentInstancingData> CookedComponentInstancingData;                            // 0x02A0   (0x0050)  
	unsigned char                                      UnknownData02_6[0x38];                                      // 0x02F0   (0x0038)  MISSED
};

/// Class /Script/Engine.CameraShakeBase
/// Size: 0x0078 (0x000028 - 0x0000A0)
class UCameraShakeBase : public UObject
{ 
public:
	bool                                               bSingleInstance;                                            // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0029   (0x0003)  MISSED
	float                                              ShakeScale;                                                 // 0x002C   (0x0004)  
	APlayerCameraManager*                              CameraManager;                                              // 0x0030   (0x0008)  
	unsigned char                                      UnknownData01_6[0x68];                                      // 0x0038   (0x0068)  MISSED
};

/// Class /Script/Engine.OnlineBlueprintCallProxyBase
/// Size: 0x0000 (0x000030 - 0x000030)
class UOnlineBlueprintCallProxyBase : public UBlueprintAsyncActionBase
{ 
public:
};

/// Class /Script/Engine.Player
/// Size: 0x0020 (0x000028 - 0x000048)
class UPlayer : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	APlayerController*                                 PlayerController;                                           // 0x0030   (0x0008)  
	int32_t                                            CurrentNetSpeed;                                            // 0x0038   (0x0004)  
	int32_t                                            ConfiguredInternetSpeed;                                    // 0x003C   (0x0004)  
	int32_t                                            ConfiguredLanSpeed;                                         // 0x0040   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0044   (0x0004)  MISSED
};

/// Class /Script/Engine.NetConnection
/// Size: 0x1AA8 (0x000048 - 0x001AF0)
class UNetConnection : public UPlayer
{ 
public:
	TArray<UChildConnection*>                          Children;                                                   // 0x0048   (0x0010)  
	UNetDriver*                                        Driver;                                                     // 0x0058   (0x0008)  
	UClass*                                            PackageMapClass;                                            // 0x0060   (0x0008)  
	UPackageMap*                                       PackageMap;                                                 // 0x0068   (0x0008)  
	TArray<UChannel*>                                  OpenChannels;                                               // 0x0070   (0x0010)  
	TArray<AActor*>                                    SentTemporaries;                                            // 0x0080   (0x0010)  
	AActor*                                            ViewTarget;                                                 // 0x0090   (0x0008)  
	AActor*                                            OwningActor;                                                // 0x0098   (0x0008)  
	int32_t                                            MaxPacket;                                                  // 0x00A0   (0x0004)  
	bool                                               InternalAck;                                                // 0x00A4:0 (0x0001)  
	unsigned char                                      UnknownData00_4[0xBB];                                      // 0x00A5   (0x00BB)  MISSED
	FUniqueNetIdRepl                                   PlayerId;                                                   // 0x0160   (0x0028)  
	unsigned char                                      UnknownData01_5[0x48];                                      // 0x0188   (0x0048)  MISSED
	double                                             LastReceiveTime;                                            // 0x01D0   (0x0008)  
	unsigned char                                      UnknownData02_5[0x1340];                                    // 0x01D8   (0x1340)  MISSED
	TArray<UChannel*>                                  ChannelsToTick;                                             // 0x1518   (0x0010)  
	unsigned char                                      UnknownData03_6[0x5C8];                                     // 0x1528   (0x05C8)  MISSED
};

/// Class /Script/Engine.NetDriver
/// Size: 0x0720 (0x000028 - 0x000748)
class UNetDriver : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FString                                            NetConnectionClassName;                                     // 0x0030   (0x0010)  
	FString                                            ReplicationDriverClassName;                                 // 0x0040   (0x0010)  
	int32_t                                            MaxDownloadSize;                                            // 0x0050   (0x0004)  
	bool                                               bClampListenServerTickRate;                                 // 0x0054:0 (0x0001)  
	unsigned char                                      UnknownData01_4[0x3];                                       // 0x0055   (0x0003)  MISSED
	int32_t                                            NetServerMaxTickRate;                                       // 0x0058   (0x0004)  
	int32_t                                            MaxNetTickRate;                                             // 0x005C   (0x0004)  
	int32_t                                            MaxInternetClientRate;                                      // 0x0060   (0x0004)  
	int32_t                                            MaxClientRate;                                              // 0x0064   (0x0004)  
	float                                              ServerTravelPause;                                          // 0x0068   (0x0004)  
	float                                              SpawnPrioritySeconds;                                       // 0x006C   (0x0004)  
	float                                              RelevantTimeout;                                            // 0x0070   (0x0004)  
	float                                              KeepAliveTime;                                              // 0x0074   (0x0004)  
	float                                              InitialConnectTimeout;                                      // 0x0078   (0x0004)  
	float                                              ConnectionTimeout;                                          // 0x007C   (0x0004)  
	float                                              TimeoutMultiplierForUnoptimizedBuilds;                      // 0x0080   (0x0004)  
	bool                                               bNoTimeouts;                                                // 0x0084   (0x0001)  
	bool                                               bNeverApplyNetworkEmulationSettings;                        // 0x0085   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x0086   (0x0002)  MISSED
	UNetConnection*                                    ServerConnection;                                           // 0x0088   (0x0008)  
	TArray<UNetConnection*>                            ClientConnections;                                          // 0x0090   (0x0010)  
	unsigned char                                      UnknownData03_5[0x60];                                      // 0x00A0   (0x0060)  MISSED
	int32_t                                            RecentlyDisconnectedTrackingTime;                           // 0x0100   (0x0004)  
	unsigned char                                      UnknownData04_5[0x3C];                                      // 0x0104   (0x003C)  MISSED
	UWorld*                                            World;                                                      // 0x0140   (0x0008)  
	UPackage*                                          WorldPackage;                                               // 0x0148   (0x0008)  
	unsigned char                                      UnknownData05_5[0x20];                                      // 0x0150   (0x0020)  MISSED
	UClass*                                            NetConnectionClass;                                         // 0x0170   (0x0008)  
	UClass*                                            ReplicationDriverClass;                                     // 0x0178   (0x0008)  
	unsigned char                                      UnknownData06_5[0x10];                                      // 0x0180   (0x0010)  MISSED
	FName                                              NetDriverName;                                              // 0x0190   (0x0008)  
	TArray<FChannelDefinition>                         ChannelDefinitions;                                         // 0x0198   (0x0010)  
	TMap<FName, FChannelDefinition>                    ChannelDefinitionMap;                                       // 0x01A8   (0x0050)  
	TArray<UChannel*>                                  ActorChannelPool;                                           // 0x01F8   (0x0010)  
	unsigned char                                      UnknownData07_5[0x8];                                       // 0x0208   (0x0008)  MISSED
	float                                              Time;                                                       // 0x0210   (0x0004)  
	unsigned char                                      UnknownData08_5[0x4D4];                                     // 0x0214   (0x04D4)  MISSED
	UReplicationDriver*                                ReplicationDriver;                                          // 0x06E8   (0x0008)  
	unsigned char                                      UnknownData09_6[0x58];                                      // 0x06F0   (0x0058)  MISSED
};

/// Class /Script/Engine.OnlineEngineInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UOnlineEngineInterface : public UObject
{ 
public:
};

/// Class /Script/Engine.OnlineSession
/// Size: 0x0000 (0x000028 - 0x000028)
class UOnlineSession : public UObject
{ 
public:
};

/// Class /Script/Engine.Pawn
/// Size: 0x0060 (0x000220 - 0x000280)
class APawn : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0220   (0x0008)  MISSED
	bool                                               bUseControllerRotationPitch;                                // 0x0228:0 (0x0001)  
	bool                                               bUseControllerRotationYaw;                                  // 0x0228:1 (0x0001)  
	bool                                               bUseControllerRotationRoll;                                 // 0x0228:2 (0x0001)  
	bool                                               bCanAffectNavigationGeneration;                             // 0x0228:3 (0x0001)  
	unsigned char                                      UnknownData01_4[0x3];                                       // 0x0229   (0x0003)  MISSED
	float                                              BaseEyeHeight;                                              // 0x022C   (0x0004)  
	TEnumAsByte<EAutoReceiveInput>                     AutoPossessPlayer;                                          // 0x0230   (0x0001)  
	EAutoPossessAI                                     AutoPossessAI;                                              // 0x0231   (0x0001)  
	char                                               RemoteViewPitch;                                            // 0x0232   (0x0001)  
	unsigned char                                      UnknownData02_5[0x5];                                       // 0x0233   (0x0005)  MISSED
	UClass*                                            AIControllerClass;                                          // 0x0238   (0x0008)  
	APlayerState*                                      PlayerState;                                                // 0x0240   (0x0008)  
	unsigned char                                      UnknownData03_5[0x8];                                       // 0x0248   (0x0008)  MISSED
	AController*                                       LastHitBy;                                                  // 0x0250   (0x0008)  
	AController*                                       Controller;                                                 // 0x0258   (0x0008)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x0260   (0x0004)  MISSED
	FVector                                            ControlInputVector;                                         // 0x0264   (0x000C)  
	FVector                                            LastControlInputVector;                                     // 0x0270   (0x000C)  
	unsigned char                                      UnknownData05_6[0x4];                                       // 0x027C   (0x0004)  MISSED


	/// Functions
	// Function /Script/Engine.Pawn.SpawnDefaultController
	void SpawnDefaultController();                                                                                           // [0x17dc270] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Pawn.SetCanAffectNavigationGeneration
	void SetCanAffectNavigationGeneration(bool bNewValue, bool bForceUpdate);                                                // [0x39f18f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Pawn.ReceiveUnpossessed
	void ReceiveUnpossessed(AController* OldController);                                                                     // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Pawn.ReceivePossessed
	void ReceivePossessed(AController* NewController);                                                                       // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Pawn.PawnMakeNoise
	void PawnMakeNoise(float Loudness, FVector NoiseLocation, bool bUseNoiseMakerLocation, AActor* NoiseMaker);              // [0x39f1cf0] Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Pawn.OnRep_PlayerState
	void OnRep_PlayerState();                                                                                                // [0x10fe6a0] Native|Public        
	// Function /Script/Engine.Pawn.OnRep_Controller
	void OnRep_Controller();                                                                                                 // [0x39f1ab0] Native|Public        
	// Function /Script/Engine.Pawn.LaunchPawn
	void LaunchPawn(FVector LaunchVelocity, bool bXYOverride, bool bZOverride);                                              // [0x39f10c0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Pawn.K2_GetMovementInputVector
	FVector K2_GetMovementInputVector();                                                                                     // [0x39f1090] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Pawn.IsPlayerControlled
	bool IsPlayerControlled();                                                                                               // [0x38c12d0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Pawn.IsPawnControlled
	bool IsPawnControlled();                                                                                                 // [0x39f1b60] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Pawn.IsMoveInputIgnored
	bool IsMoveInputIgnored();                                                                                               // [0x39f1300] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Pawn.IsLocallyControlled
	bool IsLocallyControlled();                                                                                              // [0x39f1870] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Pawn.IsControlled
	bool IsControlled();                                                                                                     // [0x39f1b90] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Pawn.IsBotControlled
	bool IsBotControlled();                                                                                                  // [0x38e0260] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Pawn.GetPendingMovementInputVector
	FVector GetPendingMovementInputVector();                                                                                 // [0x39f1090] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Pawn.GetNavAgentLocation
	FVector GetNavAgentLocation();                                                                                           // [0x39f18a0] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Pawn.GetMovementComponent
	UPawnMovementComponent* GetMovementComponent();                                                                          // [0x38c7490] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Pawn.GetMovementBaseActor
	AActor* GetMovementBaseActor(APawn* Pawn);                                                                               // [0x39f1c00] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Engine.Pawn.GetLastMovementInputVector
	FVector GetLastMovementInputVector();                                                                                    // [0x39f15e0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Pawn.GetControlRotation
	FRotator GetControlRotation();                                                                                           // [0x39f1ad0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Pawn.GetController
	AController* GetController();                                                                                            // [0x39f1b40] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Pawn.GetBaseAimRotation
	FRotator GetBaseAimRotation();                                                                                           // [0x39f1830] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Pawn.DetachFromControllerPendingDestroy
	void DetachFromControllerPendingDestroy();                                                                               // [0x39f1810] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Pawn.ConsumeMovementInputVector
	FVector ConsumeMovementInputVector();                                                                                    // [0x39f15a0] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Pawn.AddMovementInput
	void AddMovementInput(FVector WorldDirection, float ScaleValue, bool bForce);                                            // [0x39f1610] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Pawn.AddControllerYawInput
	void AddControllerYawInput(float Val);                                                                                   // [0x39f1400] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Pawn.AddControllerRollInput
	void AddControllerRollInput(float Val);                                                                                  // [0x39f1330] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Pawn.AddControllerPitchInput
	void AddControllerPitchInput(float Val);                                                                                 // [0x39f14d0] Native|Public|BlueprintCallable 
};

/// Class /Script/Engine.Character
/// Size: 0x0240 (0x000280 - 0x0004C0)
class ACharacter : public APawn
{ 
public:
	USkeletalMeshComponent*                            Mesh;                                                       // 0x0280   (0x0008)  
	UCharacterMovementComponent*                       CharacterMovement;                                          // 0x0288   (0x0008)  
	UCapsuleComponent*                                 CapsuleComponent;                                           // 0x0290   (0x0008)  
	FBasedMovementInfo                                 BasedMovement;                                              // 0x0298   (0x0030)  
	FBasedMovementInfo                                 ReplicatedBasedMovement;                                    // 0x02C8   (0x0030)  
	float                                              AnimRootMotionTranslationScale;                             // 0x02F8   (0x0004)  
	FVector                                            BaseTranslationOffset;                                      // 0x02FC   (0x000C)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0308   (0x0008)  MISSED
	FQuat                                              BaseRotationOffset;                                         // 0x0310   (0x0010)  
	float                                              ReplicatedServerLastTransformUpdateTimeStamp;               // 0x0320   (0x0004)  
	float                                              ReplayLastTransformUpdateTimeStamp;                         // 0x0324   (0x0004)  
	char                                               ReplicatedMovementMode;                                     // 0x0328   (0x0001)  
	bool                                               bInBaseReplication;                                         // 0x0329   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x032A   (0x0002)  MISSED
	float                                              CrouchedEyeHeight;                                          // 0x032C   (0x0004)  
	bool                                               bIsCrouched;                                                // 0x0330:0 (0x0001)  
	bool                                               bProxyIsJumpForceApplied;                                   // 0x0330:1 (0x0001)  
	bool                                               bPressedJump;                                               // 0x0330:2 (0x0001)  
	bool                                               bClientUpdating;                                            // 0x0330:3 (0x0001)  
	bool                                               bClientWasFalling;                                          // 0x0330:4 (0x0001)  
	bool                                               bClientResimulateRootMotion;                                // 0x0330:5 (0x0001)  
	bool                                               bClientResimulateRootMotionSources;                         // 0x0330:6 (0x0001)  
	bool                                               bSimGravityDisabled;                                        // 0x0330:7 (0x0001)  
	bool                                               bClientCheckEncroachmentOnNetUpdate;                        // 0x0331:0 (0x0001)  
	bool                                               bServerMoveIgnoreRootMotion;                                // 0x0331:1 (0x0001)  
	bool                                               bWasJumping;                                                // 0x0331:2 (0x0001)  
	unsigned char                                      UnknownData02_4[0x2];                                       // 0x0332   (0x0002)  MISSED
	float                                              JumpKeyHoldTime;                                            // 0x0334   (0x0004)  
	float                                              JumpForceTimeRemaining;                                     // 0x0338   (0x0004)  
	float                                              ProxyJumpForceStartedTime;                                  // 0x033C   (0x0004)  
	float                                              JumpMaxHoldTime;                                            // 0x0340   (0x0004)  
	int32_t                                            JumpMaxCount;                                               // 0x0344   (0x0004)  
	int32_t                                            JumpCurrentCount;                                           // 0x0348   (0x0004)  
	int32_t                                            JumpCurrentCountPreJump;                                    // 0x034C   (0x0004)  
	unsigned char                                      UnknownData03_5[0x8];                                       // 0x0350   (0x0008)  MISSED
	FMulticastInlineDelegate                           OnReachedJumpApex;                                          // 0x0358   (0x0010)  
	unsigned char                                      UnknownData04_5[0x10];                                      // 0x0368   (0x0010)  MISSED
	FMulticastInlineDelegate                           MovementModeChangedDelegate;                                // 0x0378   (0x0010)  
	FMulticastInlineDelegate                           OnCharacterMovementUpdated;                                 // 0x0388   (0x0010)  
	FRootMotionSourceGroup                             SavedRootMotion;                                            // 0x0398   (0x0038)  
	FRootMotionMovementParams                          ClientRootMotionParams;                                     // 0x03D0   (0x0040)  
	TArray<FSimulatedRootMotionReplicatedMove>         RootMotionRepMoves;                                         // 0x0410   (0x0010)  
	FRepRootMotionMontage                              RepRootMotion;                                              // 0x0420   (0x0098)  
	unsigned char                                      UnknownData05_6[0x8];                                       // 0x04B8   (0x0008)  MISSED


	/// Functions
	// Function /Script/Engine.Character.UnCrouch
	void UnCrouch(bool bClientSimulation);                                                                                   // [0x38b2950] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Character.StopJumping
	void StopJumping();                                                                                                      // [0x38b33c0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Character.StopAnimMontage
	void StopAnimMontage(UAnimMontage* AnimMontage);                                                                         // [0x38b3020] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Character.ServerMovePacked
	void ServerMovePacked(FCharacterServerMovePackedBits PackedBits);                                                        // [0x38b7710] Net|Native|Event|Public|NetServer|NetValidate 
	// Function /Script/Engine.Character.ServerMoveOld
	void ServerMoveOld(float OldTimeStamp, FVector_NetQuantize10 OldAccel, char OldMoveFlags);                               // [0x38b5090] Net|Native|Event|Public|NetServer|NetValidate 
	// Function /Script/Engine.Character.ServerMoveNoBase
	void ServerMoveNoBase(float Timestamp, FVector_NetQuantize10 InAccel, FVector_NetQuantize100 ClientLoc, char CompressedMoveFlags, char ClientRoll, uint32_t View, char ClientMovementMode); // [0x38b6ab0] Net|Native|Event|Public|NetServer|NetValidate 
	// Function /Script/Engine.Character.ServerMoveDualNoBase
	void ServerMoveDualNoBase(float TimeStamp0, FVector_NetQuantize10 InAccel0, char PendingFlags, uint32_t View0, float Timestamp, FVector_NetQuantize10 InAccel, FVector_NetQuantize100 ClientLoc, char NewFlags, char ClientRoll, uint32_t View, char ClientMovementMode); // [0x38b5b30] Net|Native|Event|Public|NetServer|NetValidate 
	// Function /Script/Engine.Character.ServerMoveDualHybridRootMotion
	void ServerMoveDualHybridRootMotion(float TimeStamp0, FVector_NetQuantize10 InAccel0, char PendingFlags, uint32_t View0, float Timestamp, FVector_NetQuantize10 InAccel, FVector_NetQuantize100 ClientLoc, char NewFlags, char ClientRoll, uint32_t View, UPrimitiveComponent* ClientMovementBase, FName ClientBaseBoneName, char ClientMovementMode); // [0x38b52f0] Net|Native|Event|Public|NetServer|NetValidate 
	// Function /Script/Engine.Character.ServerMoveDual
	void ServerMoveDual(float TimeStamp0, FVector_NetQuantize10 InAccel0, char PendingFlags, uint32_t View0, float Timestamp, FVector_NetQuantize10 InAccel, FVector_NetQuantize100 ClientLoc, char NewFlags, char ClientRoll, uint32_t View, UPrimitiveComponent* ClientMovementBase, FName ClientBaseBoneName, char ClientMovementMode); // [0x38b6270] Net|Native|Event|Public|NetServer|NetValidate 
	// Function /Script/Engine.Character.ServerMove
	void ServerMove(float Timestamp, FVector_NetQuantize10 InAccel, FVector_NetQuantize100 ClientLoc, char CompressedMoveFlags, char ClientRoll, uint32_t View, UPrimitiveComponent* ClientMovementBase, FName ClientBaseBoneName, char ClientMovementMode); // [0x38b6f80] Net|Native|Event|Public|NetServer|NetValidate 
	// Function /Script/Engine.Character.RootMotionDebugClientPrintOnScreen
	void RootMotionDebugClientPrintOnScreen(FString inString);                                                               // [0x38b27d0] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/Engine.Character.PlayAnimMontage
	float PlayAnimMontage(UAnimMontage* AnimMontage, float InPlayRate, FName StartSectionName);                              // [0x38b3100] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Character.OnWalkingOffLedge
	void OnWalkingOffLedge(FVector& PreviousFloorImpactNormal, FVector& PreviousFloorContactNormal, FVector& PreviousLocation, float TimeDelta); // [0x38b2b10] Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent 
	// Function /Script/Engine.Character.OnRep_RootMotion
	void OnRep_RootMotion();                                                                                                 // [0x38b26a0] Final|Native|Public  
	// Function /Script/Engine.Character.OnRep_ReplicatedBasedMovement
	void OnRep_ReplicatedBasedMovement();                                                                                    // [0x38b34d0] Native|Public        
	// Function /Script/Engine.Character.OnRep_ReplayLastTransformUpdateTimeStamp
	void OnRep_ReplayLastTransformUpdateTimeStamp();                                                                         // [0x38b34a0] Final|Native|Public  
	// Function /Script/Engine.Character.OnRep_IsCrouched
	void OnRep_IsCrouched();                                                                                                 // [0x38b3400] Native|Public        
	// Function /Script/Engine.Character.OnLaunched
	void OnLaunched(FVector LaunchVelocity, bool bXYOverride, bool bZOverride);                                              // [0x1ad0090] Event|Public|HasDefaults|BlueprintEvent 
	// Function /Script/Engine.Character.OnLanded
	void OnLanded(FHitResult& Hit);                                                                                          // [0x1ad0090] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Script/Engine.Character.OnJumped
	void OnJumped();                                                                                                         // [0x38b2dc0] Native|Event|Public|BlueprintEvent 
	// Function /Script/Engine.Character.LaunchCharacter
	void LaunchCharacter(FVector LaunchVelocity, bool bXYOverride, bool bZOverride);                                         // [0x38b2de0] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.Character.K2_UpdateCustomMovement
	void K2_UpdateCustomMovement(float DeltaTime);                                                                           // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Character.K2_OnStartCrouch
	void K2_OnStartCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust);                                             // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Character.K2_OnMovementModeChanged
	void K2_OnMovementModeChanged(TEnumAsByte<EMovementMode> PrevMovementMode, TEnumAsByte<EMovementMode> NewMovementMode, char PrevCustomMode, char NewCustomMode); // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Character.K2_OnEndCrouch
	void K2_OnEndCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust);                                               // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/Engine.Character.Jump
	void Jump();                                                                                                             // [0x38b33e0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Character.IsPlayingRootMotion
	bool IsPlayingRootMotion();                                                                                              // [0x38b2650] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Character.IsPlayingNetworkedRootMotionMontage
	bool IsPlayingNetworkedRootMotionMontage();                                                                              // [0x38b25b0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Character.IsJumpProvidingForce
	bool IsJumpProvidingForce();                                                                                             // [0x38b32f0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Character.HasAnyRootMotion
	bool HasAnyRootMotion();                                                                                                 // [0x38b2600] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Character.GetCurrentMontage
	UAnimMontage* GetCurrentMontage();                                                                                       // [0x38b2ff0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Character.GetBaseTranslationOffset
	FVector GetBaseTranslationOffset();                                                                                      // [0x38b3470] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Character.GetBaseRotationOffsetRotator
	FRotator GetBaseRotationOffsetRotator();                                                                                 // [0x38b3420] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Character.GetAnimRootMotionTranslationScale
	float GetAnimRootMotionTranslationScale();                                                                               // [0x38b2590] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Character.Crouch
	void Crouch(bool bClientSimulation);                                                                                     // [0x38b2a30] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Character.ClientVeryShortAdjustPosition
	void ClientVeryShortAdjustPosition(float Timestamp, FVector NewLoc, UPrimitiveComponent* NewBase, FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // [0x38b46b0] Net|Native|Event|Public|HasDefaults|NetClient 
	// Function /Script/Engine.Character.ClientMoveResponsePacked
	void ClientMoveResponsePacked(FCharacterMoveResponsePackedBits PackedBits);                                              // [0x38b7550] Net|Native|Event|Public|NetClient|NetValidate 
	// Function /Script/Engine.Character.ClientCheatWalk
	void ClientCheatWalk();                                                                                                  // [0x38b2900] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/Engine.Character.ClientCheatGhost
	void ClientCheatGhost();                                                                                                 // [0x38b28c0] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/Engine.Character.ClientCheatFly
	void ClientCheatFly();                                                                                                   // [0x38b28e0] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/Engine.Character.ClientAdjustRootMotionSourcePosition
	void ClientAdjustRootMotionSourcePosition(float Timestamp, FRootMotionSourceGroup ServerRootMotion, bool bHasAnimRootMotion, float ServerMontageTrackPosition, FVector ServerLoc, FVector_NetQuantizeNormal ServerRotation, float ServerVelZ, UPrimitiveComponent* ServerBase, FName ServerBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // [0x38b3670] Net|Native|Event|Public|HasDefaults|NetClient 
	// Function /Script/Engine.Character.ClientAdjustRootMotionPosition
	void ClientAdjustRootMotionPosition(float Timestamp, float ServerMontageTrackPosition, FVector ServerLoc, FVector_NetQuantizeNormal ServerRotation, float ServerVelZ, UPrimitiveComponent* ServerBase, FName ServerBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // [0x38b40d0] Net|Native|Event|Public|HasDefaults|NetClient 
	// Function /Script/Engine.Character.ClientAdjustPosition
	void ClientAdjustPosition(float Timestamp, FVector NewLoc, FVector NewVel, UPrimitiveComponent* NewBase, FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // [0x38b4ae0] Net|Native|Event|Public|HasDefaults|NetClient 
	// Function /Script/Engine.Character.ClientAckGoodMove
	void ClientAckGoodMove(float Timestamp);                                                                                 // [0x38b4fb0] Net|Native|Event|Public|NetClient 
	// Function /Script/Engine.Character.CanJumpInternal
	bool CanJumpInternal();                                                                                                  // [0x38b3320] Native|Event|Protected|BlueprintEvent|Const 
	// Function /Script/Engine.Character.CanJump
	bool CanJump();                                                                                                          // [0x38b3350] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Character.CanCrouch
	bool CanCrouch();                                                                                                        // [0x38b2920] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.Character.CacheInitialMeshOffset
	void CacheInitialMeshOffset(FVector MeshRelativeLocation, FRotator MeshRelativeRotation);                                // [0x38b34f0] Native|Public|HasDefaults|BlueprintCallable 
};

/// Class /Script/Engine.MovementComponent
/// Size: 0x0040 (0x0000B0 - 0x0000F0)
class UMovementComponent : public UActorComponent
{ 
public:
	USceneComponent*                                   UpdatedComponent;                                           // 0x00B0   (0x0008)  
	UPrimitiveComponent*                               UpdatedPrimitive;                                           // 0x00B8   (0x0008)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x00C0   (0x0004)  MISSED
	FVector                                            Velocity;                                                   // 0x00C4   (0x000C)  
	FVector                                            PlaneConstraintNormal;                                      // 0x00D0   (0x000C)  
	FVector                                            PlaneConstraintOrigin;                                      // 0x00DC   (0x000C)  
	bool                                               bUpdateOnlyIfRendered;                                      // 0x00E8:0 (0x0001)  
	bool                                               bAutoUpdateTickRegistration;                                // 0x00E8:1 (0x0001)  
	bool                                               bTickBeforeOwner;                                           // 0x00E8:2 (0x0001)  
	bool                                               bAutoRegisterUpdatedComponent;                              // 0x00E8:3 (0x0001)  
	bool                                               bConstrainToPlane;                                          // 0x00E8:4 (0x0001)  
	bool                                               bSnapToPlaneAtStart;                                        // 0x00E8:5 (0x0001)  
	bool                                               bAutoRegisterPhysicsVolumeUpdates;                          // 0x00E8:6 (0x0001)  
	bool                                               bComponentShouldUpdatePhysicsVolume;                        // 0x00E8:7 (0x0001)  
	unsigned char                                      UnknownData01_4[0x2];                                       // 0x00E9   (0x0002)  MISSED
	EPlaneConstraintAxisSetting                        PlaneConstraintAxisSetting;                                 // 0x00EB   (0x0001)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x00EC   (0x0004)  MISSED


	/// Functions
	// Function /Script/Engine.MovementComponent.StopMovementImmediately
	void StopMovementImmediately();                                                                                          // [0x39d9840] Native|Public|BlueprintCallable 
	// Function /Script/Engine.MovementComponent.SnapUpdatedComponentToPlane
	void SnapUpdatedComponentToPlane();                                                                                      // [0x39d88a0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.MovementComponent.SetUpdatedComponent
	void SetUpdatedComponent(USceneComponent* NewUpdatedComponent);                                                          // [0x39d9650] Native|Public|BlueprintCallable 
	// Function /Script/Engine.MovementComponent.SetPlaneConstraintOrigin
	void SetPlaneConstraintOrigin(FVector PlaneOrigin);                                                                      // [0x39d8d00] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.MovementComponent.SetPlaneConstraintNormal
	void SetPlaneConstraintNormal(FVector PlaneNormal);                                                                      // [0x39d8f60] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.MovementComponent.SetPlaneConstraintFromVectors
	void SetPlaneConstraintFromVectors(FVector Forward, FVector Up);                                                         // [0x39d8de0] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.MovementComponent.SetPlaneConstraintEnabled
	void SetPlaneConstraintEnabled(bool bEnabled);                                                                           // [0x39d8c20] Native|Public|BlueprintCallable 
	// Function /Script/Engine.MovementComponent.SetPlaneConstraintAxisSetting
	void SetPlaneConstraintAxisSetting(EPlaneConstraintAxisSetting NewAxisSetting);                                          // [0x39d9060] Native|Public|BlueprintCallable 
	// Function /Script/Engine.MovementComponent.PhysicsVolumeChanged
	void PhysicsVolumeChanged(APhysicsVolume* NewVolume);                                                                    // [0x39d9730] Native|Public        
	// Function /Script/Engine.MovementComponent.K2_MoveUpdatedComponent
	bool K2_MoveUpdatedComponent(FVector Delta, FRotator NewRotation, FHitResult& OutHit, bool bSweep, bool bTeleport);      // [0x39d9130] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.MovementComponent.K2_GetModifiedMaxSpeed
	float K2_GetModifiedMaxSpeed();                                                                                          // [0x39d9950] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.MovementComponent.K2_GetMaxSpeedModifier
	float K2_GetMaxSpeedModifier();                                                                                          // [0x39d9990] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.MovementComponent.IsExceedingMaxSpeed
	bool IsExceedingMaxSpeed(float MaxSpeed);                                                                                // [0x39d9860] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.MovementComponent.GetPlaneConstraintOrigin
	FVector GetPlaneConstraintOrigin();                                                                                      // [0x39d8bc0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.MovementComponent.GetPlaneConstraintNormal
	FVector GetPlaneConstraintNormal();                                                                                      // [0x39d8bf0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.MovementComponent.GetPlaneConstraintAxisSetting
	EPlaneConstraintAxisSetting GetPlaneConstraintAxisSetting();                                                             // [0x39d9040] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.MovementComponent.GetPhysicsVolume
	APhysicsVolume* GetPhysicsVolume();                                                                                      // [0x39d9810] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.MovementComponent.GetMaxSpeed
	float GetMaxSpeed();                                                                                                     // [0x39d99d0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.MovementComponent.GetGravityZ
	float GetGravityZ();                                                                                                     // [0x39d9a10] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.MovementComponent.ConstrainNormalToPlane
	FVector ConstrainNormalToPlane(FVector Normal);                                                                          // [0x39d88c0] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.MovementComponent.ConstrainLocationToPlane
	FVector ConstrainLocationToPlane(FVector Location);                                                                      // [0x39d89c0] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.MovementComponent.ConstrainDirectionToPlane
	FVector ConstrainDirectionToPlane(FVector Direction);                                                                    // [0x39d8ac0] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Engine.NavMovementComponent
/// Size: 0x0040 (0x0000F0 - 0x000130)
class UNavMovementComponent : public UMovementComponent
{ 
public:
	FNavAgentProperties                                NavAgentProps;                                              // 0x00F0   (0x0030)  
	float                                              FixedPathBrakingDistance;                                   // 0x0120   (0x0004)  
	bool                                               bUpdateNavAgentWithOwnersCollision;                         // 0x0124:0 (0x0001)  
	bool                                               bUseAccelerationForPaths;                                   // 0x0124:1 (0x0001)  
	bool                                               bUseFixedBrakingDistanceForPaths;                           // 0x0124:2 (0x0001)  
	FMovementProperties                                MovementState;                                              // 0x0125   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0126   (0x0002)  MISSED
	UObject*                                           PathFollowingComp;                                          // 0x0128   (0x0008)  


	/// Functions
	// Function /Script/Engine.NavMovementComponent.StopMovementKeepPathing
	void StopMovementKeepPathing();                                                                                          // [0x39dc640] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.NavMovementComponent.StopActiveMovement
	void StopActiveMovement();                                                                                               // [0x39dc680] Native|Public|BlueprintCallable 
	// Function /Script/Engine.NavMovementComponent.IsSwimming
	bool IsSwimming();                                                                                                       // [0x39dc5e0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.NavMovementComponent.IsMovingOnGround
	bool IsMovingOnGround();                                                                                                 // [0x38ba7e0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.NavMovementComponent.IsFlying
	bool IsFlying();                                                                                                         // [0x39dc5b0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.NavMovementComponent.IsFalling
	bool IsFalling();                                                                                                        // [0x3891180] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.NavMovementComponent.IsCrouching
	bool IsCrouching();                                                                                                      // [0x39dc610] Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Engine.PawnMovementComponent
/// Size: 0x0008 (0x000130 - 0x000138)
class UPawnMovementComponent : public UNavMovementComponent
{ 
public:
	APawn*                                             PawnOwner;                                                  // 0x0130   (0x0008)  


	/// Functions
	// Function /Script/Engine.PawnMovementComponent.K2_GetInputVector
	FVector K2_GetInputVector();                                                                                             // [0x39f28b0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PawnMovementComponent.IsMoveInputIgnored
	bool IsMoveInputIgnored();                                                                                               // [0x39f2920] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PawnMovementComponent.GetPendingInputVector
	FVector GetPendingInputVector();                                                                                         // [0x39f28b0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PawnMovementComponent.GetPawnOwner
	APawn* GetPawnOwner();                                                                                                   // [0x386bca0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PawnMovementComponent.GetLastInputVector
	FVector GetLastInputVector();                                                                                            // [0x39f2990] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.PawnMovementComponent.ConsumeInputVector
	FVector ConsumeInputVector();                                                                                            // [0x39f2950] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.PawnMovementComponent.AddInputVector
	void AddInputVector(FVector WorldVector, bool bForce);                                                                   // [0x39f2a00] Native|Public|HasDefaults|BlueprintCallable 
};

/// Class /Script/Engine.CharacterMovementComponent
/// Size: 0x09C8 (0x000138 - 0x000B00)
class UCharacterMovementComponent : public UPawnMovementComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0138   (0x0010)  MISSED
	ACharacter*                                        CharacterOwner;                                             // 0x0148   (0x0008)  
	float                                              GravityScale;                                               // 0x0150   (0x0004)  
	float                                              MaxStepHeight;                                              // 0x0154   (0x0004)  
	float                                              JumpZVelocity;                                              // 0x0158   (0x0004)  
	float                                              JumpOffJumpZFactor;                                         // 0x015C   (0x0004)  
	float                                              WalkableFloorAngle;                                         // 0x0160   (0x0004)  
	float                                              WalkableFloorZ;                                             // 0x0164   (0x0004)  
	TEnumAsByte<EMovementMode>                         MovementMode;                                               // 0x0168   (0x0001)  
	char                                               CustomMovementMode;                                         // 0x0169   (0x0001)  
	ENetworkSmoothingMode                              NetworkSmoothingMode;                                       // 0x016A   (0x0001)  
	unsigned char                                      UnknownData01_5[0x1];                                       // 0x016B   (0x0001)  MISSED
	float                                              GroundFriction;                                             // 0x016C   (0x0004)  
	unsigned char                                      UnknownData02_5[0x1C];                                      // 0x0170   (0x001C)  MISSED
	float                                              MaxWalkSpeed;                                               // 0x018C   (0x0004)  
	float                                              MaxWalkSpeedCrouched;                                       // 0x0190   (0x0004)  
	float                                              MaxSwimSpeed;                                               // 0x0194   (0x0004)  
	float                                              MaxFlySpeed;                                                // 0x0198   (0x0004)  
	float                                              MaxCustomMovementSpeed;                                     // 0x019C   (0x0004)  
	float                                              MaxAcceleration;                                            // 0x01A0   (0x0004)  
	float                                              MinAnalogWalkSpeed;                                         // 0x01A4   (0x0004)  
	float                                              BrakingFrictionFactor;                                      // 0x01A8   (0x0004)  
	float                                              BrakingFriction;                                            // 0x01AC   (0x0004)  
	float                                              BrakingSubStepTime;                                         // 0x01B0   (0x0004)  
	float                                              BrakingDecelerationWalking;                                 // 0x01B4   (0x0004)  
	float                                              BrakingDecelerationFalling;                                 // 0x01B8   (0x0004)  
	float                                              BrakingDecelerationSwimming;                                // 0x01BC   (0x0004)  
	float                                              BrakingDecelerationFlying;                                  // 0x01C0   (0x0004)  
	float                                              AirControl;                                                 // 0x01C4   (0x0004)  
	float                                              AirControlBoostMultiplier;                                  // 0x01C8   (0x0004)  
	float                                              AirControlBoostVelocityThreshold;                           // 0x01CC   (0x0004)  
	float                                              FallingLateralFriction;                                     // 0x01D0   (0x0004)  
	float                                              CrouchedHalfHeight;                                         // 0x01D4   (0x0004)  
	float                                              Buoyancy;                                                   // 0x01D8   (0x0004)  
	float                                              PerchRadiusThreshold;                                       // 0x01DC   (0x0004)  
	float                                              PerchAdditionalHeight;                                      // 0x01E0   (0x0004)  
	FRotator                                           RotationRate;                                               // 0x01E4   (0x000C)  
	bool                                               bUseSeparateBrakingFriction;                                // 0x01F0:0 (0x0001)  
	bool                                               bApplyGravityWhileJumping;                                  // 0x01F0:1 (0x0001)  
	bool                                               bUseControllerDesiredRotation;                              // 0x01F0:2 (0x0001)  
	bool                                               bOrientRotationToMovement;                                  // 0x01F0:3 (0x0001)  
	bool                                               bSweepWhileNavWalking;                                      // 0x01F0:4 (0x0001)  
	unsigned char                                      UnknownBit03 : 1;                                           // 0x01F0:5 (0x0001)  MISSED
	bool                                               bMovementInProgress;                                        // 0x01F0:6 (0x0001)  
	bool                                               bEnableScopedMovementUpdates;                               // 0x01F0:7 (0x0001)  
	bool                                               bEnableServerDualMoveScopedMovementUpdates;                 // 0x01F1:0 (0x0001)  
	bool                                               bForceMaxAccel;                                             // 0x01F1:1 (0x0001)  
	bool                                               bRunPhysicsWithNoController;                                // 0x01F1:2 (0x0001)  
	bool                                               bForceNextFloorCheck;                                       // 0x01F1:3 (0x0001)  
	bool                                               bShrinkProxyCapsule;                                        // 0x01F1:4 (0x0001)  
	bool                                               bCanWalkOffLedges;                                          // 0x01F1:5 (0x0001)  
	bool                                               bCanWalkOffLedgesWhenCrouching;                             // 0x01F1:6 (0x0001)  
	unsigned char                                      UnknownBit04 : 1;                                           // 0x01F1:7 (0x0001)  MISSED
	unsigned char                                      UnknownBit05 : 1;                                           // 0x01F2:0 (0x0001)  MISSED
	bool                                               bNetworkSkipProxyPredictionOnNetUpdate;                     // 0x01F2:1 (0x0001)  
	bool                                               bNetworkAlwaysReplicateTransformUpdateTimestamp;            // 0x01F2:2 (0x0001)  
	bool                                               bDeferUpdateMoveComponent;                                  // 0x01F2:3 (0x0001)  
	bool                                               bEnablePhysicsInteraction;                                  // 0x01F2:4 (0x0001)  
	bool                                               bTouchForceScaledToMass;                                    // 0x01F2:5 (0x0001)  
	bool                                               bPushForceScaledToMass;                                     // 0x01F2:6 (0x0001)  
	bool                                               bPushForceUsingZOffset;                                     // 0x01F2:7 (0x0001)  
	bool                                               bScalePushForceToVelocity;                                  // 0x01F3:0 (0x0001)  
	unsigned char                                      UnknownData06_4[0x4];                                       // 0x01F4   (0x0004)  MISSED
	USceneComponent*                                   DeferredUpdatedMoveComponent;                               // 0x01F8   (0x0008)  
	float                                              MaxOutOfWaterStepHeight;                                    // 0x0200   (0x0004)  
	float                                              OutofWaterZ;                                                // 0x0204   (0x0004)  
	float                                              Mass;                                                       // 0x0208   (0x0004)  
	float                                              StandingDownwardForceScale;                                 // 0x020C   (0x0004)  
	float                                              InitialPushForceFactor;                                     // 0x0210   (0x0004)  
	float                                              PushForceFactor;                                            // 0x0214   (0x0004)  
	float                                              PushForcePointZOffsetFactor;                                // 0x0218   (0x0004)  
	float                                              TouchForceFactor;                                           // 0x021C   (0x0004)  
	float                                              MinTouchForce;                                              // 0x0220   (0x0004)  
	float                                              MaxTouchForce;                                              // 0x0224   (0x0004)  
	float                                              RepulsionForce;                                             // 0x0228   (0x0004)  
	FVector                                            Acceleration;                                               // 0x022C   (0x000C)  
	unsigned char                                      UnknownData07_5[0x8];                                       // 0x0238   (0x0008)  MISSED
	FQuat                                              LastUpdateRotation;                                         // 0x0240   (0x0010)  
	FVector                                            LastUpdateLocation;                                         // 0x0250   (0x000C)  
	FVector                                            LastUpdateVelocity;                                         // 0x025C   (0x000C)  
	float                                              ServerLastTransformUpdateTimeStamp;                         // 0x0268   (0x0004)  
	float                                              ServerLastClientGoodMoveAckTime;                            // 0x026C   (0x0004)  
	float                                              ServerLastClientAdjustmentTime;                             // 0x0270   (0x0004)  
	FVector                                            PendingImpulseToApply;                                      // 0x0274   (0x000C)  
	FVector                                            PendingForceToApply;                                        // 0x0280   (0x000C)  
	float                                              AnalogInputModifier;                                        // 0x028C   (0x0004)  
	unsigned char                                      UnknownData08_5[0xC];                                       // 0x0290   (0x000C)  MISSED
	float                                              MaxSimulationTimeStep;                                      // 0x029C   (0x0004)  
	int32_t                                            MaxSimulationIterations;                                    // 0x02A0   (0x0004)  
	int32_t                                            MaxJumpApexAttemptsPerSimulation;                           // 0x02A4   (0x0004)  
	float                                              MaxDepenetrationWithGeometry;                               // 0x02A8   (0x0004)  
	float                                              MaxDepenetrationWithGeometryAsProxy;                        // 0x02AC   (0x0004)  
	float                                              MaxDepenetrationWithPawn;                                   // 0x02B0   (0x0004)  
	float                                              MaxDepenetrationWithPawnAsProxy;                            // 0x02B4   (0x0004)  
	float                                              NetworkSimulatedSmoothLocationTime;                         // 0x02B8   (0x0004)  
	float                                              NetworkSimulatedSmoothRotationTime;                         // 0x02BC   (0x0004)  
	float                                              ListenServerNetworkSimulatedSmoothLocationTime;             // 0x02C0   (0x0004)  
	float                                              ListenServerNetworkSimulatedSmoothRotationTime;             // 0x02C4   (0x0004)  
	float                                              NetProxyShrinkRadius;                                       // 0x02C8   (0x0004)  
	float                                              NetProxyShrinkHalfHeight;                                   // 0x02CC   (0x0004)  
	float                                              NetworkMaxSmoothUpdateDistance;                             // 0x02D0   (0x0004)  
	float                                              NetworkNoSmoothUpdateDistance;                              // 0x02D4   (0x0004)  
	float                                              NetworkMinTimeBetweenClientAckGoodMoves;                    // 0x02D8   (0x0004)  
	float                                              NetworkMinTimeBetweenClientAdjustments;                     // 0x02DC   (0x0004)  
	float                                              NetworkMinTimeBetweenClientAdjustmentsLargeCorrection;      // 0x02E0   (0x0004)  
	float                                              NetworkLargeClientCorrectionDistance;                       // 0x02E4   (0x0004)  
	float                                              LedgeCheckThreshold;                                        // 0x02E8   (0x0004)  
	float                                              JumpOutOfWaterPitch;                                        // 0x02EC   (0x0004)  
	FFindFloorResult                                   CurrentFloor;                                               // 0x02F0   (0x0098)  
	TEnumAsByte<EMovementMode>                         DefaultLandMovementMode;                                    // 0x0388   (0x0001)  
	TEnumAsByte<EMovementMode>                         DefaultWaterMovementMode;                                   // 0x0389   (0x0001)  
	TEnumAsByte<EMovementMode>                         GroundMovementMode;                                         // 0x038A   (0x0001)  
	bool                                               bMaintainHorizontalGroundVelocity;                          // 0x038B:0 (0x0001)  
	bool                                               bImpartBaseVelocityX;                                       // 0x038B:1 (0x0001)  
	bool                                               bImpartBaseVelocityY;                                       // 0x038B:2 (0x0001)  
	bool                                               bImpartBaseVelocityZ;                                       // 0x038B:3 (0x0001)  
	bool                                               bImpartBaseAngularVelocity;                                 // 0x038B:4 (0x0001)  
	bool                                               bJustTeleported;                                            // 0x038B:5 (0x0001)  
	bool                                               bNetworkUpdateReceived;                                     // 0x038B:6 (0x0001)  
	bool                                               bNetworkMovementModeChanged;                                // 0x038B:7 (0x0001)  
	bool                                               bIgnoreClientMovementErrorChecksAndCorrection;              // 0x038C:0 (0x0001)  
	bool                                               bServerAcceptClientAuthoritativePosition;                   // 0x038C:1 (0x0001)  
	bool                                               bNotifyApex;                                                // 0x038C:2 (0x0001)  
	bool                                               bCheatFlying;                                               // 0x038C:3 (0x0001)  
	bool                                               bWantsToCrouch;                                             // 0x038C:4 (0x0001)  
	bool                                               bCrouchMaintainsBaseLocation;                               // 0x038C:5 (0x0001)  
	bool                                               bIgnoreBaseRotation;                                        // 0x038C:6 (0x0001)  
	bool                                               bFastAttachedMove;                                          // 0x038C:7 (0x0001)  
	bool                                               bAlwaysCheckFloor;                                          // 0x038D:0 (0x0001)  
	bool                                               bUseFlatBaseForFloorChecks;                                 // 0x038D:1 (0x0001)  
	bool                                               bPerformingJumpOff;                                         // 0x038D:2 (0x0001)  
	bool                                               bWantsToLeaveNavWalking;                                    // 0x038D:3 (0x0001)  
	bool                                               bUseRVOAvoidance;                                           // 0x038D:4 (0x0001)  
	bool                                               bRequestedMoveUseAcceleration;                              // 0x038D:5 (0x0001)  
	unsigned char                                      UnknownBit09 : 1;                                           // 0x038D:6 (0x0001)  MISSED
	bool                                               bWasSimulatingRootMotion;                                   // 0x038D:7 (0x0001)  
	bool                                               bAllowPhysicsRotationDuringAnimRootMotion;                  // 0x038E:0 (0x0001)  
	bool                                               bHasRequestedVelocity;                                      // 0x038E:1 (0x0001)  
	bool                                               bRequestedMoveWithMaxSpeed;                                 // 0x038E:2 (0x0001)  
	bool                                               bWasAvoidanceUpdated;                                       // 0x038E:3 (0x0001)  
	unsigned char                                      UnknownBit10 : 1;                                           // 0x038E:4 (0x0001)  MISSED
	unsigned char                                      UnknownBit11 : 1;                                           // 0x038E:5 (0x0001)  MISSED
	bool                                               bProjectNavMeshWalking;                                     // 0x038E:6 (0x0001)  
	bool                                               bProjectNavMeshOnBothWorldChannels;                         // 0x038E:7 (0x0001)  
	unsigned char                                      UnknownData12_4[0x11];                                      // 0x038F   (0x0011)  MISSED
	float                                              AvoidanceConsiderationRadius;                               // 0x03A0   (0x0004)  
	FVector                                            RequestedVelocity;                                          // 0x03A4   (0x000C)  
	int32_t                                            AvoidanceUID;                                               // 0x03B0   (0x0004)  
	FNavAvoidanceMask                                  AvoidanceGroup;                                             // 0x03B4   (0x0004)  
	FNavAvoidanceMask                                  GroupsToAvoid;                                              // 0x03B8   (0x0004)  
	FNavAvoidanceMask                                  GroupsToIgnore;                                             // 0x03BC   (0x0004)  
	float                                              AvoidanceWeight;                                            // 0x03C0   (0x0004)  
	FVector                                            PendingLaunchVelocity;                                      // 0x03C4   (0x000C)  
	unsigned char                                      UnknownData13_5[0xA4];                                      // 0x03D0   (0x00A4)  MISSED
	float                                              NavMeshProjectionInterval;                                  // 0x0474   (0x0004)  
	float                                              NavMeshProjectionTimer;                                     // 0x0478   (0x0004)  
	float                                              NavMeshProjectionInterpSpeed;                               // 0x047C   (0x0004)  
	float                                              NavMeshProjectionHeightScaleUp;                             // 0x0480   (0x0004)  
	float                                              NavMeshProjectionHeightScaleDown;                           // 0x0484   (0x0004)  
	float                                              NavWalkingFloorDistTolerance;                               // 0x0488   (0x0004)  
	unsigned char                                      UnknownData14_5[0x4];                                       // 0x048C   (0x0004)  MISSED
	FCharacterMovementComponentPostPhysicsTickFunction PostPhysicsTickFunction;                                    // 0x0490   (0x0030)  
	unsigned char                                      UnknownData15_5[0x18];                                      // 0x04C0   (0x0018)  MISSED
	float                                              MinTimeBetweenTimeStampResets;                              // 0x04D8   (0x0004)  
	unsigned char                                      UnknownData16_5[0x4AC];                                     // 0x04DC   (0x04AC)  MISSED
	FRootMotionSourceGroup                             CurrentRootMotion;                                          // 0x0988   (0x0038)  
	FRootMotionSourceGroup                             ServerCorrectionRootMotion;                                 // 0x09C0   (0x0038)  
	unsigned char                                      UnknownData17_5[0x98];                                      // 0x09F8   (0x0098)  MISSED
	FRootMotionMovementParams                          RootMotionParams;                                           // 0x0A90   (0x0040)  
	FVector                                            AnimRootMotionVelocity;                                     // 0x0AD0   (0x000C)  
	unsigned char                                      UnknownData18_6[0x24];                                      // 0x0ADC   (0x0024)  MISSED


	/// Functions
	// Function /Script/Engine.CharacterMovementComponent.SetWalkableFloorZ
	void SetWalkableFloorZ(float InWalkableFloorZ);                                                                          // [0x38b9cd0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.CharacterMovementComponent.SetWalkableFloorAngle
	void SetWalkableFloorAngle(float InWalkableFloorAngle);                                                                  // [0x38b9dc0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.CharacterMovementComponent.SetMovementMode
	void SetMovementMode(TEnumAsByte<EMovementMode> NewMovementMode, char NewCustomMode);                                    // [0x38ba810] Native|Public|BlueprintCallable 
	// Function /Script/Engine.CharacterMovementComponent.SetGroupsToIgnoreMask
	void SetGroupsToIgnoreMask(FNavAvoidanceMask& GroupMask);                                                                // [0x38baad0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.CharacterMovementComponent.SetGroupsToIgnore
	void SetGroupsToIgnore(int32_t GroupFlags);                                                                              // [0x38babb0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.CharacterMovementComponent.SetGroupsToAvoidMask
	void SetGroupsToAvoidMask(FNavAvoidanceMask& GroupMask);                                                                 // [0x38bac90] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.CharacterMovementComponent.SetGroupsToAvoid
	void SetGroupsToAvoid(int32_t GroupFlags);                                                                               // [0x38bad70] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.CharacterMovementComponent.SetAvoidanceGroupMask
	void SetAvoidanceGroupMask(FNavAvoidanceMask& GroupMask);                                                                // [0x38bae50] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Engine.CharacterMovementComponent.SetAvoidanceGroup
	void SetAvoidanceGroup(int32_t GroupFlags);                                                                              // [0x38baf30] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.CharacterMovementComponent.SetAvoidanceEnabled
	void SetAvoidanceEnabled(bool bEnable);                                                                                  // [0x38ba990] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.CharacterMovementComponent.K2_GetWalkableFloorZ
	float K2_GetWalkableFloorZ();                                                                                            // [0x38b9da0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.K2_GetWalkableFloorAngle
	float K2_GetWalkableFloorAngle();                                                                                        // [0x2e9d290] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.K2_GetModifiedMaxAcceleration
	float K2_GetModifiedMaxAcceleration();                                                                                   // [0x38ba3b0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.K2_FindFloor
	void K2_FindFloor(FVector CapsuleLocation, FFindFloorResult& FloorResult);                                               // [0x38b9b00] Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.K2_ComputeFloorDist
	void K2_ComputeFloorDist(FVector CapsuleLocation, float LineDistance, float SweepDistance, float SweepRadius, FFindFloorResult& FloorResult); // [0x38b97a0] Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.IsWalking
	bool IsWalking();                                                                                                        // [0x38ba7e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.IsWalkable
	bool IsWalkable(FHitResult& Hit);                                                                                        // [0x38b9ed0] Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.GetValidPerchRadius
	float GetValidPerchRadius();                                                                                             // [0x38ba010] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.GetPerchRadiusThreshold
	float GetPerchRadiusThreshold();                                                                                         // [0x38ba040] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.GetMovementBase
	UPrimitiveComponent* GetMovementBase();                                                                                  // [0x38ba780] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.GetMinAnalogSpeed
	float GetMinAnalogSpeed();                                                                                               // [0x38ba3f0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.GetMaxJumpHeightWithJumpTime
	float GetMaxJumpHeightWithJumpTime();                                                                                    // [0x38ba430] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.GetMaxJumpHeight
	float GetMaxJumpHeight();                                                                                                // [0x38ba470] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.GetMaxBrakingDeceleration
	float GetMaxBrakingDeceleration();                                                                                       // [0x38ba330] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.GetMaxAcceleration
	float GetMaxAcceleration();                                                                                              // [0x38ba370] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.GetLastUpdateVelocity
	FVector GetLastUpdateVelocity();                                                                                         // [0x38bb010] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.GetLastUpdateRotation
	FRotator GetLastUpdateRotation();                                                                                        // [0x38bb040] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.GetLastUpdateLocation
	FVector GetLastUpdateLocation();                                                                                         // [0x38bb090] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.GetImpartedMovementBaseVelocity
	FVector GetImpartedMovementBaseVelocity();                                                                               // [0x38ba740] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.GetCurrentAcceleration
	FVector GetCurrentAcceleration();                                                                                        // [0x38ba300] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.GetCharacterOwner
	ACharacter* GetCharacterOwner();                                                                                         // [0x38ba970] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.GetAnalogInputModifier
	float GetAnalogInputModifier();                                                                                          // [0x38ba2e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Engine.CharacterMovementComponent.DisableMovement
	void DisableMovement();                                                                                                  // [0x38ba7c0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.CharacterMovementComponent.ClearAccumulatedForces
	void ClearAccumulatedForces();                                                                                           // [0x191d9b0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.CharacterMovementComponent.CapsuleTouched
	void CapsuleTouched(UPrimitiveComponent* OverlappedComp, AActor* Other, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x38b93f0] Native|Protected|HasOutParms 
	// Function /Script/Engine.CharacterMovementComponent.CalcVelocity
	void CalcVelocity(float DeltaTime, float Friction, bool bFluid, float BrakingDeceleration);                              // [0x38ba4b0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.CharacterMovementComponent.AddImpulse
	void AddImpulse(FVector Impulse, bool bVelocityChange);                                                                  // [0x38ba150] Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Engine.CharacterMovementComponent.AddForce
	void AddForce(FVector Force);                                                                                            // [0x38ba070] Native|Public|HasDefaults|BlueprintCallable 
};

/// Class /Script/Engine.Subsystem
/// Size: 0x0008 (0x000028 - 0x000030)
class USubsystem : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0028   (0x0008)  MISSED
};

/// Class /Script/Engine.DynamicSubsystem
/// Size: 0x0000 (0x000030 - 0x000030)
class UDynamicSubsystem : public USubsystem
{ 
public:
};

/// Class /Script/Engine.EngineSubsystem
/// Size: 0x0000 (0x000030 - 0x000030)
class UEngineSubsystem : public UDynamicSubsystem
{ 
public:
};

/// Class /Script/Engine.Brush
/// Size: 0x0038 (0x000220 - 0x000258)
class ABrush : public AActor
{ 
public:
	TEnumAsByte<EBrushType>                            BrushType;                                                  // 0x0220   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0221   (0x0003)  MISSED
	FColor                                             BrushColor;                                                 // 0x0224   (0x0004)  
	int32_t                                            PolyFlags;                                                  // 0x0228   (0x0004)  
	bool                                               bColored;                                                   // 0x022C:0 (0x0001)  
	bool                                               bSolidWhenSelected;                                         // 0x022C:1 (0x0001)  
	bool                                               bPlaceableFromClassBrowser;                                 // 0x022C:2 (0x0001)  
	bool                                               bNotForClientOrServer;                                      // 0x022C:3 (0x0001)  
	unsigned char                                      UnknownData01_4[0x3];                                       // 0x022D   (0x0003)  MISSED
	UModel*                                            Brush;                                                      // 0x0230   (0x0008)  
	UBrushComponent*                                   BrushComponent;                                             // 0x0238   (0x0008)  
	bool                                               bInManipulation;                                            // 0x0240:0 (0x0001)  
	unsigned char                                      UnknownData02_4[0x7];                                       // 0x0241   (0x0007)  MISSED
	TArray<FGeomSelection>                             SavedSelections;                                            // 0x0248   (0x0010)  
};

/// Class /Script/Engine.Volume
/// Size: 0x0000 (0x000258 - 0x000258)
class AVolume : public ABrush
{ 
public:
};

/// Class /Script/Engine.Controller
/// Size: 0x0078 (0x000220 - 0x000298)
class AController : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0220   (0x0008)  MISSED
	APlayerState*                                      PlayerState;                                                // 0x0228   (0x0008)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x0230   (0x0008)  MISSED
	FMulticastInlineDelegate                           OnInstigatedAnyDamage;                                      // 0x0238   (0x0010)  
	FName                                              StateName;                                                  // 0x0248   (0x0008)  
	APawn*                                             Pawn;                                                       // 0x0250   (0x0008)  
	unsigned char                                      UnknownData02_5[0x8];                                       // 0x0258   (0x0008)  MISSED
	ACharacter*                                        Character;                                                  // 0x0260   (0x0008)  
	USceneComponent*                                   TransformComponent;                                         // 0x0268   (0x0008)  
	unsigned char                                      UnknownData03_5[0x18];                                      // 0x0270   (0x0018)  MISSED
	FRotator                                           ControlRotation;                                            // 0x0288   (0x000C)  
	bool                                               bAttachToPawn;                                              // 0x0294:0 (0x0001)  
	unsigned char                                      UnknownData04_6[0x3];                                       // 0x0295   (0x0003)  MISSED


	/// Functions
	// Function /Script/Engine.Controller.UnPossess
	void UnPossess();                                                                                                        // [0x38c11d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Engine.Controller.StopMovement
	void StopMovement();                                                                                                     // [0x17efde0] Native|Public|BlueprintCallable 
	// Function /Script/Engine.Controller.SetInitialLocationAndRotation
	void SetInitialLocationAndRotation(FVector& NewLocation, FRotator& NewRotation);                                         // [0x38c1a40] Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
