// WidgetBlueprintGeneratedClass WBP_MainMenu_PlayerClass.WBP_MainMenu_PlayerClass_C
// Size: 0x4c8 (Inherited: 0x478)
struct UWBP_MainMenu_PlayerClass_C : UWTLMainMenuPlayerClass {
	struct UImage* imgFemaleEngineer; // 0x478(0x08)
	struct UImage* imgFemaleHunter; // 0x480(0x08)
	struct UImage* imgFemaleMercenary; // 0x488(0x08)
	struct UImage* imgFemaleMiner; // 0x490(0x08)
	struct UImage* imgFemaleNone; // 0x498(0x08)
	struct UImage* imgMaleEngineer; // 0x4a0(0x08)
	struct UImage* imgMaleHunter; // 0x4a8(0x08)
	struct UImage* imgMaleMercenary; // 0x4b0(0x08)
	struct UImage* imgMaleMiner; // 0x4b8(0x08)
	struct UImage* imgMaleNone; // 0x4c0(0x08)
};

