#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xB0 (0x1940 - 0x1890)
// WidgetBlueprintGeneratedClass WBP_MainMenu_Customization.WBP_MainMenu_Customization_C
class UWBP_MainMenu_Customization_C : public UWTLMainMenuCustomization
{
public:
	class UHorizontalBox*                        HbBodyType;                                        // 0x1890(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_SexButton_C*               UcSexButtonFemale;                                 // 0x1898(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_SexButton_C*               UcSexButtonMale;                                   // 0x18A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_BodyPartTabButton_C*     UI_MainMenu_BodyPart_TabButton;                    // 0x18A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_BodyPartTabButton_C*     UI_MainMenu_BodyPart_TabButton_C_0;                // 0x18B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_BodyPartTabButton_C*     UI_MainMenu_BodyPart_TabButton_C_1;                // 0x18B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_BodyPartTabButton_C*     UI_MainMenu_BodyPart_TabButton_C_2;                // 0x18C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_BodyPartTabButton_C*     UI_MainMenu_BodyPart_TabButton_C_3;                // 0x18C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_BodyPartTabButton_C*     UI_MainMenu_BodyPart_TabButton_C_4;                // 0x18D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_BodyPartTabButton_C*     UI_MainMenu_BodyPart_TabButton_C_5;                // 0x18D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_BodyPartTabButton_C*     UI_MainMenu_BodyPart_TabButton_C_6;                // 0x18E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_Customization_Item_C*    UI_MainMenu_Customization_Item;                    // 0x18E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_Customization_Item_C*    UI_MainMenu_Customization_Item_C_0;                // 0x18F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_Customization_Item_C*    UI_MainMenu_Customization_Item_C_2;                // 0x18F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_Customization_Item_C*    UI_MainMenu_Customization_Item_C_3;                // 0x1900(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_Customization_MaterialsTabButton_C* UI_MainMenu_Customization_Materials_Tab_Button;    // 0x1908(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_Customization_MaterialsTabButton_C* UI_MainMenu_Customization_Materials_Tab_Button_C_1; // 0x1910(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_Customization_MaterialsTabButton_C* UI_MainMenu_Customization_Materials_Tab_Button_C_2; // 0x1918(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_MaterialColorScalar_C*   UI_MainMenu_Material_Color_Scalar;                 // 0x1920(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_MaterialColorScalar_C*   UI_MainMenu_Material_Color_Scalar_C_1;             // 0x1928(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_MaterialColorScalar_C*   UI_MainMenu_Material_Color_Scalar_C_2;             // 0x1930(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_MaterialColorScalar_C*   UI_MainMenu_Material_Color_Scalar_C_3;             // 0x1938(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UWBP_MainMenu_Customization_C* GetDefaultObj();

};

}


