// WidgetBlueprintGeneratedClass WBP_MainMenu_Start.WBP_MainMenu_Start_C
// Size: 0x3b8 (Inherited: 0x378)
struct UWBP_MainMenu_Start_C : UWTLMainMenuStart {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x378(0x08)
	struct UImage* Image_1; // 0x380(0x08)
	struct UImage* Image_2; // 0x388(0x08)
	struct UImage* Image_3; // 0x390(0x08)
	struct UImage* Image_4; // 0x398(0x08)
	struct UImage* Image_5; // 0x3a0(0x08)
	struct UImage* imgLogo; // 0x3a8(0x08)
	struct UTextBlock* TextBlock_66; // 0x3b0(0x08)

	void Construct(); // Function WBP_MainMenu_Start.WBP_MainMenu_Start_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void ExecuteUbergraph_WBP_MainMenu_Start(int32_t EntryPoint); // Function WBP_MainMenu_Start.WBP_MainMenu_Start_C.ExecuteUbergraph_WBP_MainMenu_Start // (Final|UbergraphFunction) // @ game+0x1ad0090
};

