// WidgetBlueprintGeneratedClass WBP_MainMenu_CharacterSelect.WBP_MainMenu_CharacterSelect_C
// Size: 0x430 (Inherited: 0x3f0)
struct UWBP_MainMenu_CharacterSelect_C : UWTLMainMenuCharacterSelect {
	struct UBorder* bMessageBorder; // 0x3f0(0x08)
	struct UHorizontalBox* hbButtonsBox; // 0x3f8(0x08)
	struct UImage* Image_6; // 0x400(0x08)
	struct UImage* Image_7; // 0x408(0x08)
	struct UWBP_MainMenu_CharacterListItem_C* UI_MainMenu_CharacterListItem; // 0x410(0x08)
	struct UWBP_MainMenu_CharacterListItem_C* UI_MainMenu_CharacterListItem_C_1; // 0x418(0x08)
	struct UWBP_MainMenu_CharacterListItem_C* UI_MainMenu_CharacterListItem_C_2; // 0x420(0x08)
	struct UWBP_MainMenu_CharacterListItem_C* UI_MainMenu_CharacterListItem_C_3; // 0x428(0x08)

	void InitializeBlueprint(); // Function WBP_MainMenu_CharacterSelect.WBP_MainMenu_CharacterSelect_C.InitializeBlueprint // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ad0090
};

