/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package WTL.

/// Class /Script/WTL.EQSTest_AwayFromAllPawns
/// Size: 0x0000 (0x0001F8 - 0x0001F8)
class UEQSTest_AwayFromAllPawns : public UEnvQueryTest
{ 
public:
};

/// Class /Script/WTL.EQSTest_IsAlive
/// Size: 0x0008 (0x0001F8 - 0x000200)
class UEQSTest_IsAlive : public UEnvQueryTest
{ 
public:
	bool                                               IsAITargetInterface;                                        // 0x01F8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x01F9   (0x0007)  MISSED
};

/// Class /Script/WTL.EQSTest_IsOnTheGround
/// Size: 0x0000 (0x0001F8 - 0x0001F8)
class UEQSTest_IsOnTheGround : public UEnvQueryTest
{ 
public:
};

/// Class /Script/WTL.EQSTest_PointBehindTheEnemy
/// Size: 0x0000 (0x0001F8 - 0x0001F8)
class UEQSTest_PointBehindTheEnemy : public UEnvQueryTest
{ 
public:
};

/// Class /Script/WTL.EQSTest_TraceChannel
/// Size: 0x00E0 (0x0001F8 - 0x0002D8)
class UEQSTest_TraceChannel : public UEnvQueryTest
{ 
public:
	FEnvTraceData                                      TraceData;                                                  // 0x01F8   (0x0030)  
	FAIDataProviderBoolValue                           TraceFromContext;                                           // 0x0228   (0x0038)  
	FAIDataProviderFloatValue                          ItemHeightOffset;                                           // 0x0260   (0x0038)  
	FAIDataProviderFloatValue                          ContextHeightOffset;                                        // 0x0298   (0x0038)  
	UClass*                                            Context;                                                    // 0x02D0   (0x0008)  
};

/// Class /Script/WTL.EQSTest_VisibilityCone
/// Size: 0x0000 (0x0001F8 - 0x0001F8)
class UEQSTest_VisibilityCone : public UEnvQueryTest
{ 
public:
};

/// Class /Script/WTL.WTL3DActorHealth
/// Size: 0x0038 (0x000260 - 0x000298)
class UWTL3DActorHealth : public UUserWidget
{ 
public:
	UProgressBar*                                      pbActorHealth;                                              // 0x0260   (0x0008)  
	FLinearColor                                       HealthBarFillNormalColor;                                   // 0x0268   (0x0010)  
	FLinearColor                                       HealthBarFillWarningColor;                                  // 0x0278   (0x0010)  
	FLinearColor                                       HealthBarFillDangerColor;                                   // 0x0288   (0x0010)  


	/// Functions
	// Function /Script/WTL.WTL3DActorHealth.SetActorHealth
	void SetActorHealth(float CurrentHealth, float MaxHealth);                                                               // [0x1772f20] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/WTL.WTL3DActorName
/// Size: 0x0010 (0x000260 - 0x000270)
class UWTL3DActorName : public UUserWidget
{ 
public:
	UTextBlock*                                        tbActorName;                                                // 0x0260   (0x0008)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0268   (0x0008)  MISSED


	/// Functions
	// Function /Script/WTL.WTL3DActorName.SetActorNameText
	void SetActorNameText(FString ActorName);                                                                                // [0x1773250] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/WTL.WTL3DMobileStartPointParameters
/// Size: 0x0008 (0x000260 - 0x000268)
class UWTL3DMobileStartPointParameters : public UUserWidget
{ 
public:
	UProgressBar*                                      pbPoint;                                                    // 0x0260   (0x0008)  
};

/// Class /Script/WTL.WTL3DMonsterIdentity
/// Size: 0x0018 (0x000270 - 0x000288)
class UWTL3DMonsterIdentity : public UWTL3DActorName
{ 
public:
	UImage*                                            imgIndicator;                                               // 0x0270   (0x0008)  
	UProgressBar*                                      pbHealth;                                                   // 0x0278   (0x0008)  
	UTextBlock*                                        tbLevel;                                                    // 0x0280   (0x0008)  
};

/// Class /Script/WTL.WTL3DMonsterName
/// Size: 0x0000 (0x000270 - 0x000270)
class UWTL3DMonsterName : public UWTL3DActorName
{ 
public:
};

/// Class /Script/WTL.WTL3DPlayerIdentity
/// Size: 0x0028 (0x000270 - 0x000298)
class UWTL3DPlayerIdentity : public UWTL3DActorName
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0270   (0x0008)  MISSED
	UImage*                                            imgTeamLead;                                                // 0x0278   (0x0008)  
	UProgressBar*                                      pbHealth;                                                   // 0x0280   (0x0008)  
	UTextBlock*                                        tbLevel;                                                    // 0x0288   (0x0008)  
	UBorder*                                           bHealth;                                                    // 0x0290   (0x0008)  
};

/// Class /Script/WTL.WTLAchievementSystem
/// Size: 0x0008 (0x000028 - 0x000030)
class UWTLAchievementSystem : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0028   (0x0008)  MISSED
};

/// Class /Script/WTL.WTLActionGameplayActivity
/// Size: 0x0030 (0x000220 - 0x000250)
class AWTLActionGameplayActivity : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0220   (0x0008)  MISSED
	TWeakObjectPtr<UClass*>                            ItemPreview;                                                // 0x0228   (0x0028)  
};

/// Class /Script/WTL.WTLFortificationObject
/// Size: 0x0050 (0x000220 - 0x000270)
class AWTLFortificationObject : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x20];                                      // 0x0220   (0x0020)  MISSED
	int32_t                                            ID;                                                         // 0x0240   (0x0004)  
	EWTLFortificationObjectType                        Type;                                                       // 0x0244   (0x0001)  
	char                                               SlotCount;                                                  // 0x0245   (0x0001)  
	bool                                               NeedSaveState;                                              // 0x0246   (0x0001)  
	unsigned char                                      UnknownData01_5[0x1];                                       // 0x0247   (0x0001)  MISSED
	float                                              SaveInterval;                                               // 0x0248   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x024C   (0x0004)  MISSED
	uint64_t                                           CharacterID;                                                // 0x0250   (0x0008)  
	uint64_t                                           CharacterGroupID;                                           // 0x0258   (0x0008)  
	uint16_t                                           CharacterClanID;                                            // 0x0260   (0x0002)  
	EWTLFaction                                        Faction;                                                    // 0x0262   (0x0001)  
	unsigned char                                      UnknownData03_5[0x1];                                       // 0x0263   (0x0001)  MISSED
	int32_t                                            Condition;                                                  // 0x0264   (0x0004)  
	float                                              Energy;                                                     // 0x0268   (0x0004)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x026C   (0x0004)  MISSED
};

/// Class /Script/WTL.WTLActionGameplayMachinegun
/// Size: 0x0190 (0x000270 - 0x000400)
class AWTLActionGameplayMachinegun : public AWTLFortificationObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0270   (0x0010)  MISSED
	FWTLStorageContent                                 m_StorageContent;                                           // 0x0280   (0x00A8)  
	FRotator                                           MachinegunRotation;                                         // 0x0328   (0x000C)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0334   (0x0004)  MISSED
	UStaticMeshComponent*                              StandMesh;                                                  // 0x0338   (0x0008)  
	USkeletalMeshComponent*                            Mesh;                                                       // 0x0340   (0x0008)  
	UFMODAudioComponent*                               ShootAudioComponent;                                        // 0x0348   (0x0008)  
	FText                                              MachinegunName;                                             // 0x0350   (0x0018)  
	int32_t                                            WeaponID;                                                   // 0x0368   (0x0004)  
	int32_t                                            FireRate;                                                   // 0x036C   (0x0004)  
	float                                              TemperatureIncreasingPerShot;                               // 0x0370   (0x0004)  
	float                                              OverheatTemperature;                                        // 0x0374   (0x0004)  
	float                                              TemperatureToStartFire;                                     // 0x0378   (0x0004)  
	float                                              TemperatureCooldownPerSecond;                               // 0x037C   (0x0004)  
	float                                              OverheatAccuracy;                                           // 0x0380   (0x0004)  
	float                                              RotationSpeed;                                              // 0x0384   (0x0004)  
	int32_t                                            MaxAmmoWeight;                                              // 0x0388   (0x0004)  
	FWTLCameraLimits                                   CameraLimits;                                               // 0x038C   (0x000C)  
	unsigned char                                      UnknownData02_5[0x10];                                      // 0x0398   (0x0010)  MISSED
	AWTLCharacter*                                     m_CurrentCharacter;                                         // 0x03A8   (0x0008)  
	unsigned char                                      UnknownData03_5[0x10];                                      // 0x03B0   (0x0010)  MISSED
	float                                              m_CurrentTemperatureOverheat;                               // 0x03C0   (0x0004)  
	bool                                               m_bIsCoolingDown;                                           // 0x03C4   (0x0001)  
	unsigned char                                      UnknownData04_5[0x13];                                      // 0x03C5   (0x0013)  MISSED
	bool                                               bIsInUse;                                                   // 0x03D8   (0x0001)  
	bool                                               bIsInAction;                                                // 0x03D9   (0x0001)  
	unsigned char                                      UnknownData05_6[0x26];                                      // 0x03DA   (0x0026)  MISSED


	/// Functions
	// Function /Script/WTL.WTLActionGameplayMachinegun.SetEnabled
	void SetEnabled(bool Value);                                                                                             // [0x1773b90] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLActionGameplayMachinegun.OnUse
	void OnUse();                                                                                                            // [0x1773ed0] Final|Native|Private 
	// Function /Script/WTL.WTLActionGameplayMachinegun.OnStorageCheck
	void OnStorageCheck();                                                                                                   // [0x1773d70] Final|Native|Private 
	// Function /Script/WTL.WTLActionGameplayMachinegun.OnRep_StorageContent
	void OnRep_StorageContent();                                                                                             // [0x1774050] Final|Native|Private 
	// Function /Script/WTL.WTLActionGameplayMachinegun.OnRep_MachinegunRortation
	void OnRep_MachinegunRortation();                                                                                        // [0xe77850] Final|Native|Private 
	// Function /Script/WTL.WTLActionGameplayMachinegun.OnRep_IsInUse
	void OnRep_IsInUse();                                                                                                    // [0xe77850] Final|Native|Private 
	// Function /Script/WTL.WTLActionGameplayMachinegun.OnRep_bIsAction
	void OnRep_bIsAction();                                                                                                  // [0x1773d50] Final|Native|Private 
	// Function /Script/WTL.WTLActionGameplayMachinegun.OnLocalClientAcion
	void OnLocalClientAcion();                                                                                               // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLActionGameplayMachinegun.OnClientUsageStop
	void OnClientUsageStop();                                                                                                // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLActionGameplayMachinegun.OnClientUsageStart
	void OnClientUsageStart();                                                                                               // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLActionGameplayMachinegun.GetPauseBetweenShots
	float GetPauseBetweenShots();                                                                                            // [0x1773c50] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLActionGameplayMachinegun.GetOverheatSafeTemperature
	float GetOverheatSafeTemperature();                                                                                      // [0x1773c90] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLActionGameplayMachinegun.GetOverheatPercent
	float GetOverheatPercent();                                                                                              // [0x1773cc0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLActionGameplayMachinegun.GetMesh
	USkeletalMeshComponent* GetMesh();                                                                                       // [0x1773d30] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLActionGameplayMachinegun.GetIsInAction
	bool GetIsInAction();                                                                                                    // [0x1773cf0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLActionGameplayMachinegun.GetIsCoolingDown
	bool GetIsCoolingDown();                                                                                                 // [0x1773c70] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLActionGameplayMachinegun.GetCurrentCharacter
	AWTLCharacter* GetCurrentCharacter();                                                                                    // [0x1773a30] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLActionGameplayMachinegun.FillAmmo
	void FillAmmo(int32_t AmmoID, int32_t Count);                                                                            // [0x1773a50] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/WTL.WTLActionGameplayObjectInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UWTLActionGameplayObjectInterface : public UInterface
{ 
public:
};

/// Class /Script/WTL.WTLAnomaly
/// Size: 0x0010 (0x000220 - 0x000230)
class AWTLAnomaly : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0220   (0x0008)  MISSED
	bool                                               CharacterCanUseVehicleInside;                               // 0x0228   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0229   (0x0007)  MISSED


	/// Functions
	// Function /Script/WTL.WTLAnomaly.TeleportCharacterToRandomPointInRange
	void TeleportCharacterToRandomPointInRange(AWTLCharacter* Character, float MinRange, float MaxRange, EWTLAnomalyActionResult& Result); // [0x177e610] Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/WTL.WTLAnomaly.TeleportCharacterToRandomPointArray
	void TeleportCharacterToRandomPointArray(AWTLCharacter* Character, TArray<FVector> Locations, EWTLAnomalyActionResult& Result); // [0x177e850] Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/WTL.WTLAnomaly.TeleportCharacterToPoint
	void TeleportCharacterToPoint(AWTLCharacter* Character, FVector Location, EWTLAnomalyActionResult& Result);              // [0x177eac0] Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/WTL.WTLAnomaly.OnEMPGrenadeExplosion
	void OnEMPGrenadeExplosion();                                                                                            // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLAnomaly.IsCharacterHoldingBreath
	void IsCharacterHoldingBreath(AWTLCharacter* Character, EWTLAnomalyCheckResult& Result);                                 // [0x177fd60] Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/WTL.WTLAnomaly.ApplyRadialDamage
	void ApplyRadialDamage(float DamageValue, FVector DamageOrigin, float DamageRadius, UClass* DamageTypeClass, EWTLAnomalyActionResult& Result); // [0x177ec80] Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/WTL.WTLAnomaly.AddEffectToCharacterWithFalloff
	void AddEffectToCharacterWithFalloff(AWTLCharacter* Character, EWTLCharacterEffectType EffectType, float EffectValue, FVector Origin, float FalloffRadius, float MinEffectValue, EWTLAnomalyActionResult& Result); // [0x177f460] Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/WTL.WTLAnomaly.AddEffectToCharactersWithFalloff
	void AddEffectToCharactersWithFalloff(TArray<AWTLCharacter*> Characters, EWTLCharacterEffectType EffectType, float EffectValue, FVector Origin, float FalloffRadius, float MinEffectValue, EWTLAnomalyActionResult& Result); // [0x177f010] Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/WTL.WTLAnomaly.AddEffectToCharacters
	void AddEffectToCharacters(TArray<AWTLCharacter*> Characters, EWTLCharacterEffectType EffectType, float EffectValue, EWTLAnomalyActionResult& Result); // [0x177f820] Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/WTL.WTLAnomaly.AddEffectToCharacter
	void AddEffectToCharacter(AWTLCharacter* Character, EWTLCharacterEffectType EffectType, float EffectValue, EWTLAnomalyActionResult& Result); // [0x177fb10] Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/WTL.WTLStaticAnomaly
/// Size: 0x0030 (0x000230 - 0x000260)
class AWTLStaticAnomaly : public AWTLAnomaly
{ 
public:
	unsigned char                                      UnknownData00_2[0x28];                                      // 0x0230   (0x0028)  MISSED
	UStaticMeshComponent*                              ActivationVolume;                                           // 0x0258   (0x0008)  


	/// Functions
	// Function /Script/WTL.WTLStaticAnomaly.OnThrowingDeviceProjectileEnter
	void OnThrowingDeviceProjectileEnter(AWTLThrowingDeviceProjectile* ThrowingDeviceProjectile);                            // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLStaticAnomaly.OnNutLeave
	void OnNutLeave(AWTLNut* Nut);                                                                                           // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLStaticAnomaly.OnNutEnter
	void OnNutEnter(AWTLNut* Nut);                                                                                           // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLStaticAnomaly.OnMonsterLeave
	void OnMonsterLeave(AWTLMonsterPawn* Monster);                                                                           // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLStaticAnomaly.OnMonsterEnter
	void OnMonsterEnter(AWTLMonsterPawn* Monster);                                                                           // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLStaticAnomaly.OnEndOverlap
	void OnEndOverlap(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // [0x17dfe30] Final|Native|Private 
	// Function /Script/WTL.WTLStaticAnomaly.OnCharacterLeave
	void OnCharacterLeave(AWTLCharacter* Character);                                                                         // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLStaticAnomaly.OnCharacterEnter
	void OnCharacterEnter(AWTLCharacter* Character);                                                                         // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLStaticAnomaly.OnBeginOverlap
	void OnBeginOverlap(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x17e0080] Final|Native|Private|HasOutParms 
	// Function /Script/WTL.WTLStaticAnomaly.GetMonstersInVolume
	TArray<AWTLMonsterPawn*> GetMonstersInVolume();                                                                          // [0x1864d80] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLStaticAnomaly.GetCharactersInVolume
	TArray<AWTLCharacter*> GetCharactersInVolume();                                                                          // [0x1864e40] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/WTL.WTLActivatableAnomaly
/// Size: 0x0038 (0x000260 - 0x000298)
class AWTLActivatableAnomaly : public AWTLStaticAnomaly
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0260   (0x0010)  MISSED
	float                                              MinEnergy;                                                  // 0x0270   (0x0004)  
	float                                              MaxEnergy;                                                  // 0x0274   (0x0004)  
	float                                              EnergyPerSecond;                                            // 0x0278   (0x0004)  
	float                                              Energy;                                                     // 0x027C   (0x0004)  
	EWTLActivatableAnomalyState                        State;                                                      // 0x0280   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0281   (0x0003)  MISSED
	float                                              EnergyToActivate;                                           // 0x0284   (0x0004)  
	float                                              ActivationDelay;                                            // 0x0288   (0x0004)  
	float                                              StayActivatedTime;                                          // 0x028C   (0x0004)  
	float                                              EnergyDecrementAfterActivation;                             // 0x0290   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0294   (0x0004)  MISSED


	/// Functions
	// Function /Script/WTL.WTLActivatableAnomaly.ServerOnActivated
	void ServerOnActivated();                                                                                                // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLActivatableAnomaly.OnRep_State
	void OnRep_State();                                                                                                      // [0x17756e0] Final|Native|Private 
	// Function /Script/WTL.WTLActivatableAnomaly.OnRep_Energy
	void OnRep_Energy();                                                                                                     // [0x1775750] Final|Native|Private 
	// Function /Script/WTL.WTLActivatableAnomaly.OnEnergyChanged
	void OnEnergyChanged(float EnergyValue);                                                                                 // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLActivatableAnomaly.ClientOnBeginActivate
	void ClientOnBeginActivate();                                                                                            // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLActivatableAnomaly.ClientOnActivated
	void ClientOnActivated();                                                                                                // [0x1ad0090] Event|Public|BlueprintEvent 
};

/// Class /Script/WTL.WTLMovingAnomaly
/// Size: 0x0098 (0x000230 - 0x0002C8)
class AWTLMovingAnomaly : public AWTLAnomaly
{ 
public:
	unsigned char                                      UnknownData00_2[0x40];                                      // 0x0230   (0x0040)  MISSED
	TArray<FVector>                                    WayPoints;                                                  // 0x0270   (0x0010)  
	AWTLAnomalyWayPoint*                               StartWayPoint;                                              // 0x0280   (0x0008)  
	EWTLWayPointMovingType                             MovingType;                                                 // 0x0288   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0289   (0x0003)  MISSED
	float                                              MinSpeed;                                                   // 0x028C   (0x0004)  
	float                                              MaxSpeed;                                                   // 0x0290   (0x0004)  
	float                                              PositionSynchronizationInterval;                            // 0x0294   (0x0004)  
	unsigned char                                      UnknownData02_5[0x8];                                       // 0x0298   (0x0008)  MISSED
	FVector_NetQuantize                                m_CurrentWayPointPosition;                                  // 0x02A0   (0x000C)  
	float                                              m_CurrentSpeed;                                             // 0x02AC   (0x0004)  
	FVector                                            m_SynchronizationPosition;                                  // 0x02B0   (0x000C)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x02BC   (0x0004)  MISSED
	UStaticMeshComponent*                              ActivationVolume;                                           // 0x02C0   (0x0008)  


	/// Functions
	// Function /Script/WTL.WTLMovingAnomaly.OnRep_SynchronizationPosition
	void OnRep_SynchronizationPosition();                                                                                    // [0x1864f00] Final|Native|Protected 
	// Function /Script/WTL.WTLMovingAnomaly.OnNutLeave
	void OnNutLeave(AWTLNut* Nut);                                                                                           // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLMovingAnomaly.OnNutEnter
	void OnNutEnter(AWTLNut* Nut);                                                                                           // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLMovingAnomaly.OnNPCLeave
	void OnNPCLeave(AWTLEnemyNPC* NPC);                                                                                      // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLMovingAnomaly.OnNPCEnter
	void OnNPCEnter(AWTLEnemyNPC* NPC);                                                                                      // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLMovingAnomaly.OnMonsterLeave
	void OnMonsterLeave(AWTLMonsterPawn* Monster);                                                                           // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLMovingAnomaly.OnMonsterEnter
	void OnMonsterEnter(AWTLMonsterPawn* Monster);                                                                           // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLMovingAnomaly.OnEndOverlap
	void OnEndOverlap(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // [0x17dfe30] Final|Native|Private 
	// Function /Script/WTL.WTLMovingAnomaly.OnCharacterLeave
	void OnCharacterLeave(AWTLCharacter* Character);                                                                         // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLMovingAnomaly.OnCharacterEnter
	void OnCharacterEnter(AWTLCharacter* Character);                                                                         // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLMovingAnomaly.OnBeginOverlap
	void OnBeginOverlap(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x17e0080] Final|Native|Private|HasOutParms 
	// Function /Script/WTL.WTLMovingAnomaly.GetNPCInVolume
	TArray<AWTLEnemyNPC*> GetNPCInVolume();                                                                                  // [0x1864cc0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLMovingAnomaly.GetMonstersInVolume
	TArray<AWTLMonsterPawn*> GetMonstersInVolume();                                                                          // [0x1864d80] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLMovingAnomaly.GetCharactersInVolume
	TArray<AWTLCharacter*> GetCharactersInVolume();                                                                          // [0x1864e40] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLMovingAnomaly.GetActorsInVolume
	TArray<AActor*> GetActorsInVolume();                                                                                     // [0x1864c00] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/WTL.WTLActivatableMovingAnomaly
/// Size: 0x0038 (0x0002C8 - 0x000300)
class AWTLActivatableMovingAnomaly : public AWTLMovingAnomaly
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x02C8   (0x0010)  MISSED
	float                                              MinEnergy;                                                  // 0x02D8   (0x0004)  
	float                                              MaxEnergy;                                                  // 0x02DC   (0x0004)  
	float                                              EnergyPerSecond;                                            // 0x02E0   (0x0004)  
	float                                              Energy;                                                     // 0x02E4   (0x0004)  
	EWTLActivatableAnomalyState                        State;                                                      // 0x02E8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x02E9   (0x0003)  MISSED
	float                                              EnergyToActivate;                                           // 0x02EC   (0x0004)  
	float                                              ActivationDelay;                                            // 0x02F0   (0x0004)  
	float                                              StayActivatedTime;                                          // 0x02F4   (0x0004)  
	float                                              EnergyDecrementAfterActivation;                             // 0x02F8   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x02FC   (0x0004)  MISSED


	/// Functions
	// Function /Script/WTL.WTLActivatableMovingAnomaly.ServerOnActivated
	void ServerOnActivated();                                                                                                // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLActivatableMovingAnomaly.OnRep_State
	void OnRep_State();                                                                                                      // [0x1775af0] Final|Native|Private 
	// Function /Script/WTL.WTLActivatableMovingAnomaly.OnRep_Energy
	void OnRep_Energy();                                                                                                     // [0x1775b60] Final|Native|Private 
	// Function /Script/WTL.WTLActivatableMovingAnomaly.OnEnergyChanged
	void OnEnergyChanged(float EnergyValue);                                                                                 // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLActivatableMovingAnomaly.ClientOnBeginActivate
	void ClientOnBeginActivate();                                                                                            // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLActivatableMovingAnomaly.ClientOnActivated
	void ClientOnActivated();                                                                                                // [0x1ad0090] Event|Public|BlueprintEvent 
};

/// Class /Script/WTL.WTLActivatableObject
/// Size: 0x0020 (0x000220 - 0x000240)
class AWTLActivatableObject : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x18];                                      // 0x0220   (0x0018)  MISSED
	float                                              PostActivationCooldown;                                     // 0x0238   (0x0004)  
	float                                              ActivationDelay;                                            // 0x023C   (0x0004)  


	/// Functions
	// Function /Script/WTL.WTLActivatableObject.BP_NotifyActivationStarted
	void BP_NotifyActivationStarted(AWTLCharacter* Activator);                                                               // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLActivatableObject.BP_DeactivateObject
	void BP_DeactivateObject(AWTLCharacter* Activator);                                                                      // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLActivatableObject.BP_CanBeActivated
	bool BP_CanBeActivated();                                                                                                // [0x1775fb0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/WTL.WTLActivatableObject.BP_ActivateObject
	void BP_ActivateObject(AWTLCharacter* Activator);                                                                        // [0x1ad0090] Event|Public|BlueprintEvent 
};

/// Class /Script/WTL.WTLActivatableObjectInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UWTLActivatableObjectInterface : public UInterface
{ 
public:
};

/// Class /Script/WTL.WTLActivatorVolume
/// Size: 0x0028 (0x000258 - 0x000280)
class AWTLActivatorVolume : public AVolume
{ 
public:
	TArray<AWTLActivatableObject*>                     ObjectsToActivate;                                          // 0x0258   (0x0010)  
	int32_t                                            CharactersCountToActivate;                                  // 0x0268   (0x0004)  
	unsigned char                                      UnknownData00_6[0x14];                                      // 0x026C   (0x0014)  MISSED


	/// Functions
	// Function /Script/WTL.WTLActivatorVolume.OnEndOverlap
	void OnEndOverlap(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // [0x1776210] Final|Native|Private 
	// Function /Script/WTL.WTLActivatorVolume.OnBeginOverlap
	void OnBeginOverlap(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x1776590] Final|Native|Private|HasOutParms 
};

/// Class /Script/WTL.WTLAIAnimInstance
/// Size: 0x0040 (0x0002C0 - 0x000300)
class UWTLAIAnimInstance : public UAnimInstance
{ 
public:
	float                                              VelocitySpeed;                                              // 0x02C0   (0x0004)  
	float                                              ForwardSpeed;                                               // 0x02C4   (0x0004)  
	float                                              RightSpeed;                                                 // 0x02C8   (0x0004)  
	float                                              UpSpeed;                                                    // 0x02CC   (0x0004)  
	FVector                                            Direction;                                                  // 0x02D0   (0x000C)  
	FRotator                                           RotationDelta;                                              // 0x02DC   (0x000C)  
	FVector                                            VectorDelta;                                                // 0x02E8   (0x000C)  
	unsigned char                                      UnknownData00_6[0xC];                                       // 0x02F4   (0x000C)  MISSED
};

/// Class /Script/WTL.WTLAICharacter
/// Size: 0x04B0 (0x0004C0 - 0x000970)
class AWTLAICharacter : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_2[0x1D8];                                     // 0x04C0   (0x01D8)  MISSED
	TMap<EWTLWeaponType, float>                        WeaponTypeDamageMultipliers;                                // 0x0698   (0x0050)  
	TEnumAsByte<EPhysicalSurface>                      PhysicalSurface;                                            // 0x06E8   (0x0001)  
	char                                               Level;                                                      // 0x06E9   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x06EA   (0x0002)  MISSED
	float                                              HeadArmor;                                                  // 0x06EC   (0x0004)  
	float                                              BodyArmor;                                                  // 0x06F0   (0x0004)  
	float                                              ArmsArmor;                                                  // 0x06F4   (0x0004)  
	float                                              LegsArmor;                                                  // 0x06F8   (0x0004)  
	float                                              FeetArmor;                                                  // 0x06FC   (0x0004)  
	float                                              LifespanAfterDeath;                                         // 0x0700   (0x0004)  
	bool                                               IsBurst;                                                    // 0x0704   (0x0001)  
	char                                               PercentDamageBurst;                                         // 0x0705   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x0706   (0x0002)  MISSED
	float                                              TakeDamageBurst;                                            // 0x0708   (0x0004)  
	char                                               MinLevelBurst;                                              // 0x070C   (0x0001)  
	char                                               MaxLevelBurst;                                              // 0x070D   (0x0001)  
	unsigned char                                      UnknownData03_5[0x2];                                       // 0x070E   (0x0002)  MISSED
	FWTLStorageContent                                 m_PublicStorageContent;                                     // 0x0710   (0x00A8)  
	FWTLStorageContent                                 m_SummaryStorageContent;                                    // 0x07B8   (0x00A8)  
	FWTLStorageContent                                 m_PrivateStorageContent;                                    // 0x0860   (0x00A8)  
	TArray<FWTLItemDropInfo>                           AdditionalLoot;                                             // 0x0908   (0x0010)  
	char                                               MaxLevel;                                                   // 0x0918   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x0919   (0x0003)  MISSED
	float                                              ExperienceDropCountMultiplierDelta;                         // 0x091C   (0x0004)  
	float                                              ExperienceDropChanceMultiplierDelta;                        // 0x0920   (0x0004)  
	float                                              m_MultiplierParameters;                                     // 0x0924   (0x0004)  
	FVector                                            m_LocationDead;                                             // 0x0928   (0x000C)  
	float                                              m_Health;                                                   // 0x0934   (0x0004)  
	bool                                               m_bIsInStealthMode;                                         // 0x0938   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x0939   (0x0003)  MISSED
	int32_t                                            AICharacterID;                                              // 0x093C   (0x0004)  
	char                                               IDIcon;                                                     // 0x0940   (0x0001)  
	unsigned char                                      UnknownData06_5[0x7];                                       // 0x0941   (0x0007)  MISSED
	UPhysicsAsset*                                     MeshPhysicsAsset;                                           // 0x0948   (0x0008)  
	FRotator                                           OffsetRotationMesh;                                         // 0x0950   (0x000C)  
	float                                              DangerLevel;                                                // 0x095C   (0x0004)  
	float                                              KillZ;                                                      // 0x0960   (0x0004)  
	unsigned char                                      UnknownData07_6[0xC];                                       // 0x0964   (0x000C)  MISSED


	/// Functions
	// Function /Script/WTL.WTLAICharacter.SetStealthMode
	void SetStealthMode(bool Value);                                                                                         // [0x1777f60] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLAICharacter.SetSpawn
	void SetSpawn(AWTLSpawnAICharacter* Value);                                                                              // [0x17775a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLAICharacter.SetLifetime
	void SetLifetime(float Delta);                                                                                           // [0x17776a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLAICharacter.SetLifespanAfterDeath
	void SetLifespanAfterDeath(float Value);                                                                                 // [0x17774d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLAICharacter.SetApplyWeaponTypeDamageMultipliers
	void SetApplyWeaponTypeDamageMultipliers(bool Value);                                                                    // [0x1777830] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLAICharacter.OnRep_StorageContent
	void OnRep_StorageContent();                                                                                             // [0x1778070] Final|Native|Public  
	// Function /Script/WTL.WTLAICharacter.OnRep_IsInStealthMode
	void OnRep_IsInStealthMode();                                                                                            // [0x1778090] Final|Native|Public  
	// Function /Script/WTL.WTLAICharacter.OnRep_Health
	void OnRep_Health();                                                                                                     // [0xe77850] Final|Native|Public  
	// Function /Script/WTL.WTLAICharacter.NetMulticast_OnToDeath
	void NetMulticast_OnToDeath(FVector DeathPosition, FVector_NetQuantize ActorRotation, FVector_NetQuantize MeshRotation, FWTLAICharacterDeathData DeathData); // [0x1777940] Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults 
	// Function /Script/WTL.WTLAICharacter.NetMulticast_OnDeath
	void NetMulticast_OnDeath(FVector DeathPosition, FVector_NetQuantize ActorRotation, FVector_NetQuantize MeshRotation, FWTLAICharacterDeathData DeathData); // [0x1777c20] Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults 
	// Function /Script/WTL.WTLAICharacter.KillAiCharacter
	void KillAiCharacter();                                                                                                  // [0x1777f00] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLAICharacter.K2_OnToDeathEvent
	void K2_OnToDeathEvent(FVector& DeathPosition, FVector_NetQuantize ActorRotation, FVector_NetQuantize MeshRotation, FWTLAICharacterDeathData DeathData); // [0x1ad0090] Event|Public|HasOutParms|HasDefaults|BlueprintEvent 
	// Function /Script/WTL.WTLAICharacter.K2_OnStealthModeChanged
	void K2_OnStealthModeChanged(bool Value);                                                                                // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLAICharacter.K2_OnDeathEvent
	void K2_OnDeathEvent(FWTLAICharacterDeathData DeathData);                                                                // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLAICharacter.K2_OnBurst
	void K2_OnBurst(FWTLAICharacterDeathData DeathData);                                                                     // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLAICharacter.IsVisible
	bool IsVisible();                                                                                                        // [0x1777910] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLAICharacter.IsApplyWeaponTypeDamageMultipliers
	bool IsApplyWeaponTypeDamageMultipliers();                                                                               // [0x1777810] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLAICharacter.IsAlive
	bool IsAlive();                                                                                                          // [0x17777e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLAICharacter.GetSpawn
	AWTLSpawnAICharacter* GetSpawn();                                                                                        // [0x1777680] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/WTL.WTLAICharacter.GetMaxHealth
	float GetMaxHealth();                                                                                                    // [0x1186200] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLAICharacter.GetHealth
	float GetHealth();                                                                                                       // [0x1777780] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLAICharacter.GetDangerLevel
	float GetDangerLevel();                                                                                                  // [0x17777a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLAICharacter.GetAICharacterID
	int32_t GetAICharacterID();                                                                                              // [0x17777c0] Final|Native|Public|BlueprintCallable|BlueprintPure 
};

/// Class /Script/WTL.WTLAICharacterController
/// Size: 0x01F8 (0x000328 - 0x000520)
class AWTLAICharacterController : public AAIController
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0328   (0x0008)  MISSED
	TEnumAsByte<ETraceTypeQuery>                       CollisionTraceQuery;                                        // 0x0330   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0331   (0x0003)  MISSED
	float                                              PredictionUpdatePeriod;                                     // 0x0334   (0x0004)  
	unsigned char                                      UnknownData02_6[0x1E8];                                     // 0x0338   (0x01E8)  MISSED


	/// Functions
	// Function /Script/WTL.WTLAICharacterController.OnTouchSenseUpdated
	void OnTouchSenseUpdated(AActor* StimulusInstigator, FVector StimulusLocation, bool State);                              // [0x1ad0090] Event|Public|HasDefaults|BlueprintEvent 
	// Function /Script/WTL.WTLAICharacterController.OnTeamSenseUpdated
	void OnTeamSenseUpdated(AActor* StimulusInstigator, FVector StimulusLocation, bool State);                               // [0x1ad0090] Event|Public|HasDefaults|BlueprintEvent 
	// Function /Script/WTL.WTLAICharacterController.OnSightSenseUpdated
	void OnSightSenseUpdated(AActor* StimulusInstigator, FVector StimulusLocation, bool State);                              // [0x1ad0090] Event|Public|HasDefaults|BlueprintEvent 
	// Function /Script/WTL.WTLAICharacterController.OnPredictionUpdate
	void OnPredictionUpdate();                                                                                               // [0x17794e0] Final|Native|Public  
	// Function /Script/WTL.WTLAICharacterController.OnPredictionSenseUpdated
	void OnPredictionSenseUpdated(AActor* StimulusInstigator, FVector StimulusLocation, bool State);                         // [0x1ad0090] Event|Public|HasDefaults|BlueprintEvent 
	// Function /Script/WTL.WTLAICharacterController.OnPerceptionUpdated
	void OnPerceptionUpdated(TArray<AActor*>& UpdatedActors);                                                                // [0x1779410] Final|Native|Public|HasOutParms 
	// Function /Script/WTL.WTLAICharacterController.OnHearingSenseUpdated
	void OnHearingSenseUpdated(AActor* StimulusInstigator, FVector StimulusLocation, bool State);                            // [0x1ad0090] Event|Public|HasDefaults|BlueprintEvent 
	// Function /Script/WTL.WTLAICharacterController.OnDamageSenseUpdated
	void OnDamageSenseUpdated(AActor* StimulusInstigator, FVector StimulusLocation, bool State, float Value);                // [0x1ad0090] Event|Public|HasDefaults|BlueprintEvent 
	// Function /Script/WTL.WTLAICharacterController.OnActorPerceptionUpdated
	void OnActorPerceptionUpdated(AActor* Actor, FAIStimulus Stimulus);                                                      // [0x17791f0] Final|Native|Public  
	// Function /Script/WTL.WTLAICharacterController.GetMyPawn
	AWTLAICharacter* GetMyPawn();                                                                                            // [0x1779500] Final|Native|Public|BlueprintCallable|BlueprintPure 
};

/// Class /Script/WTL.WTLAIDestroyObject
/// Size: 0x0020 (0x000220 - 0x000240)
class AWTLAIDestroyObject : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0220   (0x0010)  MISSED
	float                                              m_Condition;                                                // 0x0230   (0x0004)  
	float                                              m_MaxCondition;                                             // 0x0234   (0x0004)  
	bool                                               m_ObjectIsDestroyed;                                        // 0x0238   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0239   (0x0003)  MISSED
	float                                              ActivationTime;                                             // 0x023C   (0x0004)  


	/// Functions
	// Function /Script/WTL.WTLAIDestroyObject.OnChangeCondition
	void OnChangeCondition(float DeltaCondition);                                                                            // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLAIDestroyObject.BPUse
	void BPUse(AWTLCharacter* Character);                                                                                    // [0x1779a60] Native|Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLAIDestroyObject.BPSetHighlightState
	void BPSetHighlightState(bool Value);                                                                                    // [0x1779890] Native|Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLAIDestroyObject.BPGetDisplayText
	FString BPGetDisplayText(AWTLCharacter* Character);                                                                      // [0x1779760] Native|Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLAIDestroyObject.BPCanBeUsed
	bool BPCanBeUsed(AWTLCharacter* Character);                                                                              // [0x1779970] Native|Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLAIDestroyObject.AIInterface_IsInSafeZone
	bool AIInterface_IsInSafeZone();                                                                                         // [0x1779c20] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLAIDestroyObject.AIInterface_IsCanBeAttacked
	bool AIInterface_IsCanBeAttacked(EWTLFaction InstigatorFaction);                                                         // [0x1779b40] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLAIDestroyObject.AIInterface_IsAlive
	bool AIInterface_IsAlive();                                                                                              // [0x1779d30] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLAIDestroyObject.AIInterface_GetVelocity
	FVector AIInterface_GetVelocity();                                                                                       // [0x1779ca0] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLAIDestroyObject.AIInterface_GetGroupID
	int32_t AIInterface_GetGroupID();                                                                                        // [0x1779cf0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLAIDestroyObject.AIInterface_GetFaction
	EWTLFaction AIInterface_GetFaction();                                                                                    // [0x1779c60] Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/WTL.WTLAIFlying
/// Size: 0x0000 (0x000970 - 0x000970)
class AWTLAIFlying : public AWTLAICharacter
{ 
public:
};

/// Class /Script/WTL.WTLAIFlyingController
/// Size: 0x0000 (0x000520 - 0x000520)
class AWTLAIFlyingController : public AWTLAICharacterController
{ 
public:
};

/// Class /Script/WTL.WTLAIMonsterPawn
/// Size: 0x0000 (0x0004C0 - 0x0004C0)
class AWTLAIMonsterPawn : public ACharacter
{ 
public:
};

/// Class /Script/WTL.WTLAIPerceptionComponent
/// Size: 0x0000 (0x000190 - 0x000190)
class UWTLAIPerceptionComponent : public UAIPerceptionComponent
{ 
public:
};

/// Class /Script/WTL.WTLAIPerceptionSystem
/// Size: 0x0000 (0x000130 - 0x000130)
class UWTLAIPerceptionSystem : public UAIPerceptionSystem
{ 
public:
};

/// Class /Script/WTL.WTLInteractiveObject
/// Size: 0x0040 (0x000220 - 0x000260)
class AWTLInteractiveObject : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0220   (0x0008)  MISSED
	FText                                              m_LocalizationDisplayText;                                  // 0x0228   (0x0018)  
	FString                                            m_DisplayText;                                              // 0x0240   (0x0010)  
	float                                              ActivationTime;                                             // 0x0250   (0x0004)  
	float                                              MaxDistanceToStartUse;                                      // 0x0254   (0x0004)  
	UAnimMontage*                                      CharacterUsingAnimMontage;                                  // 0x0258   (0x0008)  


	/// Functions
	// Function /Script/WTL.WTLInteractiveObject.BPUse
	void BPUse(AWTLCharacter* Character);                                                                                    // [0x1779a60] Native|Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLInteractiveObject.BPSetHighlightState
	void BPSetHighlightState(bool Value);                                                                                    // [0x1779890] Native|Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLInteractiveObject.BPGetDisplayText
	FString BPGetDisplayText(AWTLCharacter* Character);                                                                      // [0x1779760] Native|Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLInteractiveObject.BPCanBeUsed
	bool BPCanBeUsed(AWTLCharacter* Character);                                                                              // [0x1779970] Native|Event|Public|BlueprintEvent 
};

/// Class /Script/WTL.WTLStorageBox
/// Size: 0x03D0 (0x000260 - 0x000630)
class AWTLStorageBox : public AWTLInteractiveObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0260   (0x0008)  MISSED
	UStaticMeshComponent*                              Mesh;                                                       // 0x0268   (0x0008)  
	unsigned char                                      UnknownData01_5[0x170];                                     // 0x0270   (0x0170)  MISSED
	FWTLStorageContent                                 m_PublicStorageContent;                                     // 0x03E0   (0x00A8)  
	FWTLStorageContent                                 m_PrivateStorageContent;                                    // 0x0488   (0x00A8)  
	FWTLStorageContent                                 m_SummaryStorageContent;                                    // 0x0530   (0x00A8)  
	unsigned char                                      UnknownData02_5[0x20];                                      // 0x05D8   (0x0020)  MISSED
	FText                                              Name;                                                       // 0x05F8   (0x0018)  
	char                                               SlotsCount;                                                 // 0x0610   (0x0001)  
	bool                                               CanStoreItems;                                              // 0x0611   (0x0001)  
	unsigned char                                      UnknownData03_5[0x6];                                       // 0x0612   (0x0006)  MISSED
	TArray<FWTLItemSpawnInfo>                          SpawnItems;                                                 // 0x0618   (0x0010)  
	bool                                               CanUseLocationItemsSpawn;                                   // 0x0628   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x0629   (0x0003)  MISSED
	int32_t                                            MaxLocationItemsSpawnQuality;                               // 0x062C   (0x0004)  


	/// Functions
	// Function /Script/WTL.WTLStorageBox.SetCharacterDropChanceMultiplier
	void SetCharacterDropChanceMultiplier(AWTLCharacter* Character, float Multiplier);                                       // [0x192d740] Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLStorageBox.OnRep_StorageContent
	void OnRep_StorageContent();                                                                                             // [0x192db20] Final|Native|Protected 
	// Function /Script/WTL.WTLStorageBox.AllowSpecialLootForCharacter
	void AllowSpecialLootForCharacter(AWTLCharacter* Character, float SpecialValue);                                         // [0x192d360] Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable 
};

/// Class /Script/WTL.WTLAirDropStorage
/// Size: 0x00A0 (0x000630 - 0x0006D0)
class AWTLAirDropStorage : public AWTLStorageBox
{ 
public:
	UWTLRadialForceComponent*                          RadialForce;                                                // 0x0630   (0x0008)  
	UParticleSystemComponent*                          Highlighting;                                               // 0x0638   (0x0008)  
	unsigned char                                      UnknownData00_5[0x10];                                      // 0x0640   (0x0010)  MISSED
	float                                              m_NewLifeTime;                                              // 0x0650   (0x0004)  
	unsigned char                                      UnknownData01_5[0x28];                                      // 0x0654   (0x0028)  MISSED
	bool                                               m_bShowAll;                                                 // 0x067C   (0x0001)  
	bool                                               m_bShowPositionOnLocation;                                  // 0x067D   (0x0001)  
	bool                                               m_bSpawned;                                                 // 0x067E   (0x0001)  
	bool                                               UseCameraShake;                                             // 0x067F   (0x0001)  
	UClass*                                            CameraShake;                                                // 0x0680   (0x0008)  
	float                                              MaxDistance;                                                // 0x0688   (0x0004)  
	float                                              CameraShakeValue;                                           // 0x068C   (0x0004)  
	bool                                               HideUsableItem;                                             // 0x0690   (0x0001)  
	bool                                               RemoveAiming;                                               // 0x0691   (0x0001)  
	bool                                               NeedToKillCharacters;                                       // 0x0692   (0x0001)  
	unsigned char                                      UnknownData02_5[0x1];                                       // 0x0693   (0x0001)  MISSED
	float                                              KillCharactersMaxDistance;                                  // 0x0694   (0x0004)  
	TWeakObjectPtr<UClass*>                            DestroyFX;                                                  // 0x0698   (0x0028)  
	float                                              TimeBeforeShowBox;                                          // 0x06C0   (0x0004)  
	float                                              LocationHighlightingTime;                                   // 0x06C4   (0x0004)  
	bool                                               CanSpawnGuard;                                              // 0x06C8   (0x0001)  
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x06C9   (0x0007)  MISSED


	/// Functions
	// Function /Script/WTL.WTLAirDropStorage.OnRep_NewLifeTime
	void OnRep_NewLifeTime();                                                                                                // [0x177b2f0] Final|Native|Private 
	// Function /Script/WTL.WTLAirDropStorage.OnRep_bShowPosition
	void OnRep_bShowPosition();                                                                                              // [0x177b290] Final|Native|Private 
	// Function /Script/WTL.WTLAirDropStorage.OnRep_bShowAll
	void OnRep_bShowAll();                                                                                                   // [0x177b2d0] Final|Native|Private 
	// Function /Script/WTL.WTLAirDropStorage.NetMulsticast_Destroy
	void NetMulsticast_Destroy();                                                                                            // [0x177b270] Final|Net|Native|Event|NetMulticast|Private 
	// Function /Script/WTL.WTLAirDropStorage.BPShowAll
	void BPShowAll(bool ShowAll);                                                                                            // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLAirDropStorage.BPDestroy
	void BPDestroy();                                                                                                        // [0x1ad0090] Event|Public|BlueprintEvent 
};

/// Class /Script/WTL.WTLAITargetInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UWTLAITargetInterface : public UInterface
{ 
public:
};

/// Class /Script/WTL.WTLAmbientSound
/// Size: 0x0010 (0x000228 - 0x000238)
class AWTLAmbientSound : public AAmbientSound
{ 
public:
	unsigned char                                      UnknownData00_2[0xC];                                       // 0x0228   (0x000C)  MISSED
	EWTLAmbientSoundLocationType                       LocationType;                                               // 0x0234   (0x0001)  
	EWTLAmbientSoundDayTimeType                        DayTimeType;                                                // 0x0235   (0x0001)  
	unsigned char                                      UnknownData01_6[0x2];                                       // 0x0236   (0x0002)  MISSED
};

/// Class /Script/WTL.WTLAmmoCase
/// Size: 0x0040 (0x000220 - 0x000260)
class AWTLAmmoCase : public AActor
{ 
public:
	UCapsuleComponent*                                 CollisionComp;                                              // 0x0220   (0x0008)  
	UStaticMeshComponent*                              Mesh;                                                       // 0x0228   (0x0008)  
	float                                              DropLifeSpan;                                               // 0x0230   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0234   (0x0004)  MISSED
	TWeakObjectPtr<UFMODEvent*>                        DropSoundEvent;                                             // 0x0238   (0x0028)  


	/// Functions
	// Function /Script/WTL.WTLAmmoCase.OnHit
	void OnHit(UPrimitiveComponent* HitComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, FVector NormalImpulse, FHitResult& Hit); // [0x177be60] Final|Native|Public|HasOutParms|HasDefaults 
};

/// Class /Script/WTL.WTLAnimalBase
/// Size: 0x0000 (0x000220 - 0x000220)
class AWTLAnimalBase : public AActor
{ 
public:
};

/// Class /Script/WTL.WTLAnimNotifyAmmoCaseEject
/// Size: 0x0048 (0x000038 - 0x000080)
class UWTLAnimNotifyAmmoCaseEject : public UAnimNotify
{ 
public:
	TWeakObjectPtr<UClass*>                            AmmoCaseClass;                                              // 0x0038   (0x0028)  
	float                                              AmmoCaseForce;                                              // 0x0060   (0x0004)  
	float                                              ForceRandomMultiplierValue;                                 // 0x0064   (0x0004)  
	FVector                                            AngularImpulse;                                             // 0x0068   (0x000C)  
	float                                              RandomRotationHalfCone;                                     // 0x0074   (0x0004)  
	FName                                              SocketName;                                                 // 0x0078   (0x0008)  
};

/// Class /Script/WTL.WTLAnimNotifyParticleAmmoCaseEject
/// Size: 0x0018 (0x000038 - 0x000050)
class UWTLAnimNotifyParticleAmmoCaseEject : public UAnimNotify
{ 
public:
	FVector                                            AmmoCaseInitialVelocity;                                    // 0x0038   (0x000C)  
	FName                                              InitialVelocityParamName;                                   // 0x0044   (0x0008)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x004C   (0x0004)  MISSED
};

/// Class /Script/WTL.WTLAnimNotifyParticleEffect
/// Size: 0x0078 (0x000038 - 0x0000B0)
class UWTLAnimNotifyParticleEffect : public UAnimNotify
{ 
public:
	TWeakObjectPtr<UParticleSystem*>                   PSTemplate;                                                 // 0x0038   (0x0028)  
	FVector                                            LocationOffset;                                             // 0x0060   (0x000C)  
	FRotator                                           RotationOffset;                                             // 0x006C   (0x000C)  
	FVector                                            EmitterScale;                                               // 0x0078   (0x000C)  
	unsigned char                                      UnknownData00_5[0x1C];                                      // 0x0084   (0x001C)  MISSED
	bool                                               Attached;                                                   // 0x00A0:0 (0x0001)  
	unsigned char                                      UnknownData01_4[0x3];                                       // 0x00A1   (0x0003)  MISSED
	FName                                              SocketName;                                                 // 0x00A4   (0x0008)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x00AC   (0x0004)  MISSED
};

/// Class /Script/WTL.WTLAnimNotifyGunshot
/// Size: 0x0060 (0x000038 - 0x000098)
class UWTLAnimNotifyGunshot : public UAnimNotify
{ 
public:
	TWeakObjectPtr<UFMODEvent*>                        EditorEvent;                                                // 0x0038   (0x0028)  
	TWeakObjectPtr<UParticleSystem*>                   EditParticleSystem;                                         // 0x0060   (0x0028)  
	FVector                                            EditorParticlesScale;                                       // 0x0088   (0x000C)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0094   (0x0004)  MISSED
};

/// Class /Script/WTL.WTLAnimNotifyFootstep
/// Size: 0x0028 (0x000038 - 0x000060)
class UWTLAnimNotifyFootstep : public UAnimNotify
{ 
public:
	TWeakObjectPtr<UFMODEvent*>                        EditorEvent;                                                // 0x0038   (0x0028)  
};

/// Class /Script/WTL.WTLAnimNotifyCharacterBreath
/// Size: 0x0028 (0x000038 - 0x000060)
class UWTLAnimNotifyCharacterBreath : public UAnimNotify
{ 
public:
	TWeakObjectPtr<UFMODEvent*>                        EditorEvent;                                                // 0x0038   (0x0028)  
};

/// Class /Script/WTL.WTLAnimNotifyPlayCharacterSound
/// Size: 0x0000 (0x000058 - 0x000058)
class UWTLAnimNotifyPlayCharacterSound : public UAnimNotify_PlaySound
{ 
public:
};

/// Class /Script/WTL.WTLCharacterAdditionalMeshNotifyState
/// Size: 0x0070 (0x000030 - 0x0000A0)
class UWTLCharacterAdditionalMeshNotifyState : public UAnimNotifyState
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0030   (0x0008)  MISSED
	FName                                              MeshComponentName;                                          // 0x0038   (0x0008)  
	TWeakObjectPtr<UStaticMesh*>                       Mesh;                                                       // 0x0040   (0x0028)  
	FName                                              AttachBoneName;                                             // 0x0068   (0x0008)  
	FTransform                                         MeshRelativeTransform;                                      // 0x0070   (0x0030)  
};

/// Class /Script/WTL.WTLCharacterAddStaticMeshNotify
/// Size: 0x0078 (0x000038 - 0x0000B0)
class UWTLCharacterAddStaticMeshNotify : public UAnimNotify
{ 
public:
	UStaticMeshComponent*                              m_MeshComponent;                                            // 0x0038   (0x0008)  
	FName                                              MeshComponentName;                                          // 0x0040   (0x0008)  
	TWeakObjectPtr<UStaticMesh*>                       Mesh;                                                       // 0x0048   (0x0028)  
	FName                                              AttachBoneName;                                             // 0x0070   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0078   (0x0008)  MISSED
	FTransform                                         MeshRelativeTransform;                                      // 0x0080   (0x0030)  
};

/// Class /Script/WTL.WTLCharacterRemoveStaticMeshNotify
/// Size: 0x0008 (0x000038 - 0x000040)
class UWTLCharacterRemoveStaticMeshNotify : public UAnimNotify
{ 
public:
	FName                                              MeshComponentName;                                          // 0x0038   (0x0008)  
};

/// Class /Script/WTL.WTLCharacterHandsNotifyState
/// Size: 0x0008 (0x000030 - 0x000038)
class UWTLCharacterHandsNotifyState : public UAnimNotifyState
{ 
public:
	EWTLHandsState                                     StartHandsState;                                            // 0x0030   (0x0001)  
	EWTLHandsState                                     EndHandsState;                                              // 0x0031   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0032   (0x0006)  MISSED
};

/// Class /Script/WTL.WTLCharacterHandsStateChange
/// Size: 0x0008 (0x000038 - 0x000040)
class UWTLCharacterHandsStateChange : public UAnimNotify
{ 
public:
	EWTLHandsState                                     HandsState;                                                 // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0039   (0x0007)  MISSED
};

/// Class /Script/WTL.WTLReloadingStateChange
/// Size: 0x0008 (0x000038 - 0x000040)
class UWTLReloadingStateChange : public UAnimNotify
{ 
public:
	EWTLReloadingNotifyType                            NotifyType;                                                 // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0039   (0x0007)  MISSED
};

/// Class /Script/WTL.WTLUsableItemStateChange
/// Size: 0x0008 (0x000038 - 0x000040)
class UWTLUsableItemStateChange : public UAnimNotify
{ 
public:
	EWTLUsableItemState                                State;                                                      // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0039   (0x0007)  MISSED
};

/// Class /Script/WTL.WTLUsableItemCustomTrigger
/// Size: 0x0008 (0x000038 - 0x000040)
class UWTLUsableItemCustomTrigger : public UAnimNotify
{ 
public:
	FName                                              TriggerName;                                                // 0x0038   (0x0008)  
};

/// Class /Script/WTL.WTLVehicleStateChange
/// Size: 0x0008 (0x000038 - 0x000040)
class UWTLVehicleStateChange : public UAnimNotify
{ 
public:
	EWTLVehicleState                                   State;                                                      // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0039   (0x0007)  MISSED
};

/// Class /Script/WTL.WTLVehicleCustomTrigger
/// Size: 0x0008 (0x000038 - 0x000040)
class UWTLVehicleCustomTrigger : public UAnimNotify
{ 
public:
	FName                                              TriggerName;                                                // 0x0038   (0x0008)  
};

/// Class /Script/WTL.WTLPlaceableStuffCustomTrigger
/// Size: 0x0008 (0x000038 - 0x000040)
class UWTLPlaceableStuffCustomTrigger : public UAnimNotify
{ 
public:
	FName                                              TriggerName;                                                // 0x0038   (0x0008)  
};

/// Class /Script/WTL.WTLNPCCustomTrigger
/// Size: 0x0008 (0x000038 - 0x000040)
class UWTLNPCCustomTrigger : public UAnimNotify
{ 
public:
	FName                                              TriggerName;                                                // 0x0038   (0x0008)  
};

/// Class /Script/WTL.WTLMonsterActionTrigger
/// Size: 0x0008 (0x000038 - 0x000040)
class UWTLMonsterActionTrigger : public UAnimNotify
{ 
public:
	FName                                              TriggerName;                                                // 0x0038   (0x0008)  
};

/// Class /Script/WTL.WTLMonsterAnimationTrigger
/// Size: 0x0010 (0x000038 - 0x000048)
class UWTLMonsterAnimationTrigger : public UAnimNotify
{ 
public:
	FName                                              TriggerName;                                                // 0x0038   (0x0008)  
	bool                                               Value;                                                      // 0x0040   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0041   (0x0003)  MISSED
	int32_t                                            ID;                                                         // 0x0044   (0x0004)  
};

/// Class /Script/WTL.WTLNPCActionTrigger
/// Size: 0x0008 (0x000038 - 0x000040)
class UWTLNPCActionTrigger : public UAnimNotify
{ 
public:
	FName                                              TriggerName;                                                // 0x0038   (0x0008)  
};

/// Class /Script/WTL.WTLMonsterEffect
/// Size: 0x0050 (0x000038 - 0x000088)
class UWTLMonsterEffect : public UAnimNotify
{ 
public:
	TMap<uint16_t, FWTLMonsterAction>                  ActionsPerMonsterID;                                        // 0x0038   (0x0050)  
};

/// Class /Script/WTL.WTLAnomalyWayPoint
/// Size: 0x0008 (0x000220 - 0x000228)
class AWTLAnomalyWayPoint : public AActor
{ 
public:
	AWTLAnomalyWayPoint*                               NextWayPoint;                                               // 0x0220   (0x0008)  
};

/// Class /Script/WTL.WTLArenaState
/// Size: 0x00A8 (0x000220 - 0x0002C8)
class AWTLArenaState : public AInfo
{ 
public:
	unsigned char                                      UnknownData00_2[0x28];                                      // 0x0220   (0x0028)  MISSED
	EWTLArenaMatchState                                m_MatchState;                                               // 0x0248   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0249   (0x0003)  MISSED
	float                                              m_NextMatchStateChangeServerTime;                           // 0x024C   (0x0004)  
	TArray<FWTLArenaFactionScore>                      m_FactionScores;                                            // 0x0250   (0x0010)  
	unsigned char                                      UnknownData02_5[0x10];                                      // 0x0260   (0x0010)  MISSED
	TArray<FWTLArenaLeaderboardRecord>                 m_Leaderboard;                                              // 0x0270   (0x0010)  
	TArray<FWTLArenaReward>                            Rewards;                                                    // 0x0280   (0x0010)  
	unsigned char                                      UnknownData03_5[0x20];                                      // 0x0290   (0x0020)  MISSED
	FTimespan                                          MatchWaitDuration;                                          // 0x02B0   (0x0008)  
	FTimespan                                          MatchDuration;                                              // 0x02B8   (0x0008)  
	FTimespan                                          MatchDoneDuration;                                          // 0x02C0   (0x0008)  


	/// Functions
	// Function /Script/WTL.WTLArenaState.OnRep_MatchState
	void OnRep_MatchState();                                                                                                 // [0x17802d0] Final|Native|Protected 
};

/// Class /Script/WTL.WTLBallisticsSystem
/// Size: 0x0158 (0x000028 - 0x000180)
class UWTLBallisticsSystem : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x148];                                     // 0x0028   (0x0148)  MISSED
	bool                                               bDrawActualTrajectory;                                      // 0x0170   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0171   (0x0003)  MISSED
	float                                              DebugInfoLifetime;                                          // 0x0174   (0x0004)  
	float                                              ActualTrajectoryThickness;                                  // 0x0178   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x017C   (0x0004)  MISSED
};

/// Class /Script/WTL.WTLBPLibraryCharacter
/// Size: 0x0000 (0x000028 - 0x000028)
class UWTLBPLibraryCharacter : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/WTL.WTLBPLibraryCommon
/// Size: 0x0000 (0x000028 - 0x000028)
class UWTLBPLibraryCommon : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/WTL.WTLBPLibraryQuestSystem
/// Size: 0x0000 (0x000028 - 0x000028)
class UWTLBPLibraryQuestSystem : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/WTL.WTLBTService_AICheckForAttack
/// Size: 0x0000 (0x000098 - 0x000098)
class UWTLBTService_AICheckForAttack : public UBTService_BlackboardBase
{ 
public:
};

/// Class /Script/WTL.WTLBTService_BlueprintBase
/// Size: 0x0000 (0x000098 - 0x000098)
class UWTLBTService_BlueprintBase : public UBTService_BlueprintBase
{ 
public:
};

/// Class /Script/WTL.WTLBTService_CheckEnemy
/// Size: 0x0018 (0x000098 - 0x0000B0)
class UWTLBTService_CheckEnemy : public UBTService_BlackboardBase
{ 
public:
	unsigned char                                      UnknownData00_2[0x14];                                      // 0x0098   (0x0014)  MISSED
	EWTLMonsterState                                   SetState;                                                   // 0x00AC   (0x0001)  
	bool                                               ClearKeyVisibleEnemy;                                       // 0x00AD   (0x0001)  
	unsigned char                                      UnknownData01_6[0x2];                                       // 0x00AE   (0x0002)  MISSED
};

/// Class /Script/WTL.WTLBTService_CheckForFarAttack
/// Size: 0x0000 (0x000098 - 0x000098)
class UWTLBTService_CheckForFarAttack : public UBTService_BlackboardBase
{ 
public:
};

/// Class /Script/WTL.WTLBTService_CheckForJump
/// Size: 0x0008 (0x000098 - 0x0000A0)
class UWTLBTService_CheckForJump : public UBTService_BlackboardBase
{ 
public:
	EWTLMonsterState                                   SetState;                                                   // 0x0098   (0x0001)  
	EWTLMonsterStateFollowTarget                       SetStateFollowTarget;                                       // 0x0099   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x009A   (0x0006)  MISSED
};

/// Class /Script/WTL.WTLBTService_Enemy_Sensing
/// Size: 0x0070 (0x000070 - 0x0000E0)
class UWTLBTService_Enemy_Sensing : public UBTService
{ 
public:
	bool                                               bSensePlayers;                                              // 0x0070   (0x0001)  
	bool                                               bSenseOtherEnemies;                                         // 0x0071   (0x0001)  
	bool                                               bHearNoises;                                                // 0x0072   (0x0001)  
	bool                                               bInterruptCurrentTaskOnSpotted;                             // 0x0073   (0x0001)  
	float                                              SightRadius;                                                // 0x0074   (0x0004)  
	float                                              PeripheralVisionAngle;                                      // 0x0078   (0x0004)  
	float                                              HearingMaxSoundAge;                                         // 0x007C   (0x0004)  
	float                                              HearingThreshold;                                           // 0x0080   (0x0004)  
	float                                              LOSHearingThreshold;                                        // 0x0084   (0x0004)  
	TEnumAsByte<ECollisionChannel>                     SoundOcclusionChannel;                                      // 0x0088   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0089   (0x0007)  MISSED
	FBlackboardKeySelector                             TargetSpottedKey;                                           // 0x0090   (0x0028)  
	FBlackboardKeySelector                             RemoteLocationListenedKey;                                  // 0x00B8   (0x0028)  
};

/// Class /Script/WTL.WTLBTService_FrightRadius
/// Size: 0x0018 (0x000098 - 0x0000B0)
class UWTLBTService_FrightRadius : public UBTService_BlackboardBase
{ 
public:
	EWTLMonsterState                                   SetState;                                                   // 0x0098   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0099   (0x0003)  MISSED
	float                                              ApplyRadius;                                                // 0x009C   (0x0004)  
	float                                              DelayExecution;                                             // 0x00A0   (0x0004)  
	float                                              RandomDelayExecution;                                       // 0x00A4   (0x0004)  
	float                                              m_CurrentDelayExecution;                                    // 0x00A8   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x00AC   (0x0004)  MISSED
};

/// Class /Script/WTL.WTLBTService_MonsterMovementMode
/// Size: 0x0008 (0x000070 - 0x000078)
class UWTLBTService_MonsterMovementMode : public UBTService
{ 
public:
	EWTLMonsterMovementMode                            MovementMode;                                               // 0x0070   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0071   (0x0007)  MISSED
};

/// Class /Script/WTL.WTLBTService_SightAI
/// Size: 0x0008 (0x000098 - 0x0000A0)
class UWTLBTService_SightAI : public UBTService_BlackboardBase
{ 
public:
	EWTLMonsterState                                   SetState;                                                   // 0x0098   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0099   (0x0007)  MISSED
};

/// Class /Script/WTL.WTLBTService_StateIfHealthLess
/// Size: 0x0010 (0x000098 - 0x0000A8)
class UWTLBTService_StateIfHealthLess : public UBTService_BlackboardBase
{ 
public:
	EWTLMonsterState                                   SetState;                                                   // 0x0098   (0x0001)  
	EWTMonsterSecondaryState                           SetSecondaryState;                                          // 0x0099   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x009A   (0x0002)  MISSED
	float                                              HealthPercent;                                              // 0x009C   (0x0004)  
	bool                                               InverseCondition;                                           // 0x00A0   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x00A1   (0x0007)  MISSED
};

/// Class /Script/WTL.WTLBTTask_ActionFromBlackBoard
/// Size: 0x0000 (0x000098 - 0x000098)
class UWTLBTTask_ActionFromBlackBoard : public UBTTask_BlackboardBase
{ 
public:
};

/// Class /Script/WTL.WTLBTTask_AvailableAction
/// Size: 0x0008 (0x000070 - 0x000078)
class UWTLBTTask_AvailableAction : public UBTTaskNode
{ 
public:
	bool                                               bExceptMainAction;                                          // 0x0070   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0071   (0x0007)  MISSED
};

/// Class /Script/WTL.WTLBTTask_BlueprintBase
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UWTLBTTask_BlueprintBase : public UBTTask_BlueprintBase
{ 
public:
};

/// Class /Script/WTL.WTLBTTask_EnemyNPC_MoveTo
/// Size: 0x0040 (0x000098 - 0x0000D8)
class UWTLBTTask_EnemyNPC_MoveTo : public UBTTask_BlackboardBase
{ 
public:
	float                                              AcceptableRadius;                                           // 0x0098   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x009C   (0x0004)  MISSED
	UClass*                                            FilterClass;                                                // 0x00A0   (0x0008)  
	float                                              ObservedBlackboardValueTolerance;                           // 0x00A8   (0x0004)  
	bool                                               bObserveBlackboardValue;                                    // 0x00AC:0 (0x0001)  
	bool                                               bAllowStrafe;                                               // 0x00AC:1 (0x0001)  
	bool                                               bAllowPartialPath;                                          // 0x00AC:2 (0x0001)  
	bool                                               bTrackMovingGoal;                                           // 0x00AC:3 (0x0001)  
	bool                                               bProjectGoalLocation;                                       // 0x00AC:4 (0x0001)  
	bool                                               bReachTestIncludesAgentRadius;                              // 0x00AC:5 (0x0001)  
	bool                                               bReachTestIncludesGoalRadius;                               // 0x00AC:6 (0x0001)  
	bool                                               bStopOnOverlap;                                             // 0x00AC:7 (0x0001)  
	bool                                               bStopOnOverlapNeedsUpdate;                                  // 0x00AD:0 (0x0001)  
	unsigned char                                      UnknownData01_4[0x2];                                       // 0x00AE   (0x0002)  MISSED
	FBlackboardKeySelector                             AcceptableRadiusKey;                                        // 0x00B0   (0x0028)  
};

/// Class /Script/WTL.WTLBTTask_FindClosestMonster
/// Size: 0x0008 (0x000070 - 0x000078)
class UWTLBTTask_FindClosestMonster : public UBTTaskNode
{ 
public:
	float                                              ApplyRadius;                                                // 0x0070   (0x0004)  
	bool                                               EdibleForMonster;                                           // 0x0074   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0075   (0x0003)  MISSED
};

/// Class /Script/WTL.WTLBTTask_FrightRadius
/// Size: 0x0008 (0x000070 - 0x000078)
class UWTLBTTask_FrightRadius : public UBTTaskNode
{ 
public:
	float                                              ApplyRadius;                                                // 0x0070   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0074   (0x0004)  MISSED
};

/// Class /Script/WTL.WTLBTTask_Idle
/// Size: 0x0000 (0x000070 - 0x000070)
class UWTLBTTask_Idle : public UBTTaskNode
{ 
public:
};

/// Class /Script/WTL.WTLBTTask_MonsterAction
/// Size: 0x0008 (0x000070 - 0x000078)
class UWTLBTTask_MonsterAction : public UBTTaskNode
{ 
public:
	EWTLMonsterActionType                              Action;                                                     // 0x0070   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0071   (0x0007)  MISSED
};

/// Class /Script/WTL.WTLBTTask_MoveDirectlyToward
/// Size: 0x0030 (0x0000B8 - 0x0000E8)
class UWTLBTTask_MoveDirectlyToward : public UBTTask_MoveDirectlyToward
{ 
public:
	bool                                               bUseAcceptableRadiusFromBlackboard;                         // 0x00B8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x00B9   (0x0007)  MISSED
	FBlackboardKeySelector                             AcceptableRadiusBlackboardKey;                              // 0x00C0   (0x0028)  
};

/// Class /Script/WTL.WTLBTTask_RunBehaviorStealth
/// Size: 0x0010 (0x000078 - 0x000088)
class UWTLBTTask_RunBehaviorStealth : public UBTTask_RunBehavior
{ 
public:
	TArray<EWTLMonsterState>                           StatesForExecute;                                           // 0x0078   (0x0010)  
};

/// Class /Script/WTL.WTLBTTask_SetAIState
/// Size: 0x0008 (0x000070 - 0x000078)
class UWTLBTTask_SetAIState : public UBTTaskNode
{ 
public:
	EWTLMonsterState                                   SetState;                                                   // 0x0070   (0x0001)  
	EWTMonsterSecondaryState                           SetSecondaryState;                                          // 0x0071   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0072   (0x0006)  MISSED
};

/// Class /Script/WTL.WTLBTTask_SetMovementMode
/// Size: 0x0008 (0x000070 - 0x000078)
class UWTLBTTask_SetMovementMode : public UBTTaskNode
{ 
public:
	EWTLMonsterMovementMode                            MovementMode;                                               // 0x0070   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0071   (0x0007)  MISSED
};

/// Class /Script/WTL.WTLBTTask_SetStealthMode
/// Size: 0x0008 (0x000070 - 0x000078)
class UWTLBTTask_SetStealthMode : public UBTTaskNode
{ 
public:
	bool                                               Value;                                                      // 0x0070   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0071   (0x0007)  MISSED
};

/// Class /Script/WTL.WTLBTTask_WTLMoveTo
/// Size: 0x0030 (0x0000B0 - 0x0000E0)
class UWTLBTTask_WTLMoveTo : public UBTTask_MoveTo
{ 
public:
	bool                                               bUseAcceptableRadiusFromBlackboard;                         // 0x00B0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x00B1   (0x0007)  MISSED
	FBlackboardKeySelector                             AcceptableRadiusBlackboardKey;                              // 0x00B8   (0x0028)  
};

/// Class /Script/WTL.WTLBulletHellBase
/// Size: 0x0220 (0x000220 - 0x000440)
class AWTLBulletHellBase : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x100];                                     // 0x0220   (0x0100)  MISSED
	UProceduralMeshComponent*                          m_ProcMesh;                                                 // 0x0320   (0x0008)  
	bool                                               UseBillboard;                                               // 0x0328   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0329   (0x0007)  MISSED
	UMaterialInterface*                                Material;                                                   // 0x0330   (0x0008)  
	UStaticMesh*                                       RenderMesh;                                                 // 0x0338   (0x0008)  
	UMaterialInterface*                                TailMaterial;                                               // 0x0340   (0x0008)  
	bool                                               AutoDestroy;                                                // 0x0348   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0349   (0x0003)  MISSED
	int32_t                                            AttackMode;                                                 // 0x034C   (0x0004)  
	FVector                                            SpawnAxisX;                                                 // 0x0350   (0x000C)  
	float                                              PhysicsFps;                                                 // 0x035C   (0x0004)  
	float                                              ServerStartDelay;                                           // 0x0360   (0x0004)  
	float                                              ClientStartDelay;                                           // 0x0364   (0x0004)  
	float                                              MeshUpdateRate;                                             // 0x0368   (0x0004)  
	float                                              LoopDuration;                                               // 0x036C   (0x0004)  
	float                                              SpawnRate;                                                  // 0x0370   (0x0004)  
	FRotator                                           RotateSpawnAxisX;                                           // 0x0374   (0x000C)  
	float                                              SpawnCountBurst;                                            // 0x0380   (0x0004)  
	bool                                               IsLinearSpawn;                                              // 0x0384   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0385   (0x0003)  MISSED
	FVector2D                                          BulletSpeed;                                                // 0x0388   (0x0008)  
	FVector2D                                          LifeTime;                                                   // 0x0390   (0x0008)  
	FVector2D                                          BounceCount;                                                // 0x0398   (0x0008)  
	bool                                               OnlyNegativeZ;                                              // 0x03A0   (0x0001)  
	bool                                               UseConeSpread;                                              // 0x03A1   (0x0001)  
	unsigned char                                      UnknownData04_5[0x2];                                       // 0x03A2   (0x0002)  MISSED
	FVector2D                                          ConeSpread;                                                 // 0x03A4   (0x0008)  
	FVector2D                                          ConeSpreadRadius;                                           // 0x03AC   (0x0008)  
	FVector                                            Drag;                                                       // 0x03B4   (0x000C)  
	FVector                                            Gravity;                                                    // 0x03C0   (0x000C)  
	bool                                               UseCurveBulletSpeed;                                        // 0x03CC   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x03CD   (0x0003)  MISSED
	UCurveFloat*                                       CurveBulletSpeed;                                           // 0x03D0   (0x0008)  
	bool                                               UseCurveScaleLocation;                                      // 0x03D8   (0x0001)  
	unsigned char                                      UnknownData06_5[0x7];                                       // 0x03D9   (0x0007)  MISSED
	UCurveVector*                                      CurveScaleLocation;                                         // 0x03E0   (0x0008)  
	float                                              CurveSpeedScale;                                            // 0x03E8   (0x0004)  
	bool                                               UseTail;                                                    // 0x03EC   (0x0001)  
	unsigned char                                      UnknownData07_5[0x3];                                       // 0x03ED   (0x0003)  MISSED
	float                                              DistFromVelocity;                                           // 0x03F0   (0x0004)  
	FVector2D                                          Damage;                                                     // 0x03F4   (0x0008)  
	float                                              CollisionTime;                                              // 0x03FC   (0x0004)  
	float                                              SphereTraceRadius;                                          // 0x0400   (0x0004)  
	unsigned char                                      UnknownData08_5[0x4];                                       // 0x0404   (0x0004)  MISSED
	TArray<TEnumAsByte>                                CollisionTraceQuery;                                        // 0x0408   (0x0010)  
	bool                                               SpawnActorOnHit;                                            // 0x0418   (0x0001)  
	unsigned char                                      UnknownData09_5[0x7];                                       // 0x0419   (0x0007)  MISSED
	UClass*                                            SpawnActor;                                                 // 0x0420   (0x0008)  
	float                                              DrawDebugTime;                                              // 0x0428   (0x0004)  
	TEnumAsByte<EDrawDebugTrace>                       ServerDrawDebugTrace;                                       // 0x042C   (0x0001)  
	TEnumAsByte<EDrawDebugTrace>                       ClientDrawDebugTrace;                                       // 0x042D   (0x0001)  
	unsigned char                                      UnknownData10_5[0x2];                                       // 0x042E   (0x0002)  MISSED
	float                                              BulletRadius;                                               // 0x0430   (0x0004)  
	float                                              StartTime;                                                  // 0x0434   (0x0004)  
	unsigned char                                      UnknownData11_6[0x8];                                       // 0x0438   (0x0008)  MISSED
};

/// Class /Script/WTL.WTLBulletHellBillboardComponent
/// Size: 0x0010 (0x000470 - 0x000480)
class UWTLBulletHellBillboardComponent : public UMeshComponent
{ 
public:
	TArray<FWTLMaterialSpriteElement>                  Elements;                                                   // 0x0468   (0x0010)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0478   (0x0008)  MISSED


	/// Functions
	// Function /Script/WTL.WTLBulletHellBillboardComponent.SetElements
	void SetElements(TArray<FWTLMaterialSpriteElement>& NewElements);                                                        // [0x17a40a0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/WTL.WTLBulletHellBillboardComponent.AddElement
	void AddElement(UMaterialInterface* Material, UCurveFloat* DistanceToOpacityCurve, bool bSizeIsInScreenSpace, float BaseSizeX, float BaseSizeY, UCurveFloat* DistanceToSizeCurve); // [0x17a3ca0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/WTL.WTLBulletinBoard
/// Size: 0x00B8 (0x000220 - 0x0002D8)
class AWTLBulletinBoard : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x20];                                      // 0x0220   (0x0020)  MISSED
	UStaticMeshComponent*                              Mesh;                                                       // 0x0240   (0x0008)  
	UStaticMeshComponent*                              BulletinMesh1;                                              // 0x0248   (0x0008)  
	UStaticMeshComponent*                              BulletinMesh2;                                              // 0x0250   (0x0008)  
	UStaticMeshComponent*                              BulletinMesh3;                                              // 0x0258   (0x0008)  
	FVector                                            Bulletin1CenterLocation;                                    // 0x0260   (0x000C)  
	FVector                                            Bulletin2CenterLocation;                                    // 0x026C   (0x000C)  
	FVector                                            Bulletin3CenterLocation;                                    // 0x0278   (0x000C)  
	float                                              BulletinHorizontalLocationDelta;                            // 0x0284   (0x0004)  
	float                                              BulletinVerticalLocationDelta;                              // 0x0288   (0x0004)  
	float                                              BulletinRotationDelta;                                      // 0x028C   (0x0004)  
	FVector                                            BulletinOriginalScale;                                      // 0x0290   (0x000C)  
	float                                              BulletinScaleDelta;                                         // 0x029C   (0x0004)  
	TArray<UMaterialInstance*>                         BulletinMaterials;                                          // 0x02A0   (0x0010)  
	TArray<int32_t>                                    QuestList;                                                  // 0x02B0   (0x0010)  
	EWTLFaction                                        Faction;                                                    // 0x02C0   (0x0001)  
	bool                                               m_IsActive;                                                 // 0x02C1   (0x0001)  
	unsigned char                                      UnknownData01_6[0x16];                                      // 0x02C2   (0x0016)  MISSED


	/// Functions
	// Function /Script/WTL.WTLBulletinBoard.SetIsActive
	void SetIsActive(bool Value);                                                                                            // [0x1773b90] Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLBulletinBoard.OnRep_IsActive
	void OnRep_IsActive();                                                                                                   // [0x17a5a70] Final|Native|Private 
	// Function /Script/WTL.WTLBulletinBoard.OnIsActiveChanged
	void OnIsActiveChanged(bool IsActive);                                                                                   // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLBulletinBoard.GetIsActive
	bool GetIsActive();                                                                                                      // [0x17a5a50] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/WTL.WTLProjectile
/// Size: 0x0028 (0x000220 - 0x000248)
class AWTLProjectile : public AActor
{ 
public:
	USphereComponent*                                  CollisionComp;                                              // 0x0220   (0x0008)  
	UWTLProjectileMovementComponent*                   ProjectileMovement;                                         // 0x0228   (0x0008)  
	EProjectileType                                    Type;                                                       // 0x0230   (0x0001)  
	bool                                               bShowDebugInfo;                                             // 0x0231   (0x0001)  
	bool                                               bDrawAimingTrajectory;                                      // 0x0232   (0x0001)  
	unsigned char                                      UnknownData00_5[0x1];                                       // 0x0233   (0x0001)  MISSED
	FColor                                             AimingTrajectoryColor;                                      // 0x0234   (0x0004)  
	float                                              AimingTrajectoryThickness;                                  // 0x0238   (0x0004)  
	bool                                               bDrawActualTrajectory;                                      // 0x023C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x023D   (0x0003)  MISSED
	float                                              ActualTrajectoryThickness;                                  // 0x0240   (0x0004)  
	float                                              DebugInfoLifetime;                                          // 0x0244   (0x0004)  
};

/// Class /Script/WTL.WTLBulletProjectile
/// Size: 0x00F0 (0x000248 - 0x000338)
class AWTLBulletProjectile : public AWTLProjectile
{ 
public:
	unsigned char                                      UnknownData00_2[0xB1];                                      // 0x0248   (0x00B1)  MISSED
	bool                                               CanRicochet;                                                // 0x02F9   (0x0001)  
	char                                               RicochetChance;                                             // 0x02FA   (0x0001)  
	char                                               MaxRicochetCount;                                           // 0x02FB   (0x0001)  
	float                                              MinRicochetAngle;                                           // 0x02FC   (0x0004)  
	float                                              MinRicochetVelocity;                                        // 0x0300   (0x0004)  
	float                                              MinRicochetVelocityDelta;                                   // 0x0304   (0x0004)  
	float                                              MaxRicochetVelocityDelta;                                   // 0x0308   (0x0004)  
	float                                              PenetrationEndRandomHalfCone;                               // 0x030C   (0x0004)  
	float                                              InitialDamage;                                              // 0x0310   (0x0004)  
	bool                                               bDrawHitPoints;                                             // 0x0314   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0315   (0x0003)  MISSED
	FColor                                             HitPointsColor;                                             // 0x0318   (0x0004)  
	bool                                               bDrawPenetrationExitPoints;                                 // 0x031C   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x031D   (0x0003)  MISSED
	FColor                                             PenetrationExitPointsColor;                                 // 0x0320   (0x0004)  
	bool                                               bDrawRicochetPoints;                                        // 0x0324   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0325   (0x0003)  MISSED
	FColor                                             RicochetPointsColor;                                        // 0x0328   (0x0004)  
	bool                                               bDrawDestroyPoint;                                          // 0x032C   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x032D   (0x0003)  MISSED
	FColor                                             DestroyPointColor;                                          // 0x0330   (0x0004)  
	unsigned char                                      UnknownData05_6[0x4];                                       // 0x0334   (0x0004)  MISSED


	/// Functions
	// Function /Script/WTL.WTLBulletProjectile.OnProjectileBounce
	void OnProjectileBounce(FHitResult& ImpactResult, FVector& ImpactVelocity);                                              // [0x17a5d20] Final|Native|Public|HasOutParms|HasDefaults 
	// Function /Script/WTL.WTLBulletProjectile.OnHit
	void OnHit(UPrimitiveComponent* HitComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, FVector NormalImpulse, FHitResult& Hit); // [0x17a5ef0] Final|Native|Public|HasOutParms|HasDefaults 
};

/// Class /Script/WTL.WTLBulletTracer
/// Size: 0x0090 (0x000220 - 0x0002B0)
class AWTLBulletTracer : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x60];                                      // 0x0220   (0x0060)  MISSED
	UWTLProjectileMovementComponent*                   ProjectileMovement;                                         // 0x0280   (0x0008)  
	float                                              InitialVelocity;                                            // 0x0288   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x028C   (0x0004)  MISSED
	UCurveFloat*                                       VelocityCurve;                                              // 0x0290   (0x0008)  
	UCurveFloat*                                       GravityCurve;                                               // 0x0298   (0x0008)  
	bool                                               DrawDebugInfo;                                              // 0x02A0   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x02A1   (0x0003)  MISSED
	float                                              DebugInfoLifetime;                                          // 0x02A4   (0x0004)  
	float                                              DebugInfoLineThickness;                                     // 0x02A8   (0x0004)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x02AC   (0x0004)  MISSED


	/// Functions
	// Function /Script/WTL.WTLBulletTracer.OnTracerDestroyed
	void OnTracerDestroyed(AActor* DestroyedActor);                                                                          // [0x17a6330] Final|Native|Private 
};

/// Class /Script/WTL.WTLUsable
/// Size: 0x01A0 (0x000220 - 0x0003C0)
class AWTLUsable : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x18];                                      // 0x0220   (0x0018)  MISSED
	int64_t                                            m_ItemID;                                                   // 0x0238   (0x0008)  
	int16_t                                            m_ItemTypeID;                                               // 0x0240   (0x0002)  
	unsigned char                                      UnknownData01_5[0x50];                                      // 0x0242   (0x0050)  MISSED
	bool                                               m_bIsSnuggled;                                              // 0x0292   (0x0001)  
	unsigned char                                      UnknownData02_5[0x25];                                      // 0x0293   (0x0025)  MISSED
	float                                              PauseBetweenUse;                                            // 0x02B8   (0x0004)  
	int32_t                                            m_FastAccessSlotIndex;                                      // 0x02BC   (0x0004)  
	USkeletalMeshComponent*                            SkeletalMesh;                                               // 0x02C0   (0x0008)  
	unsigned char                                      UnknownData03_5[0x8];                                       // 0x02C8   (0x0008)  MISSED
	bool                                               HideFastAccessSlots;                                        // 0x02D0   (0x0001)  
	unsigned char                                      UnknownData04_5[0xF];                                       // 0x02D1   (0x000F)  MISSED
	FItemAnimationSet                                  EquipSequenceSet;                                           // 0x02E0   (0x0018)  
	float                                              EquipTimeWithoutAnimation;                                  // 0x02F8   (0x0004)  
	unsigned char                                      UnknownData05_5[0x4];                                       // 0x02FC   (0x0004)  MISSED
	FItemAnimationSet                                  UnequipSequenceSet;                                         // 0x0300   (0x0018)  
	float                                              UnequipTimeWithoutAnimation;                                // 0x0318   (0x0004)  
	unsigned char                                      UnknownData06_5[0x4];                                       // 0x031C   (0x0004)  MISSED
	UAnimationAsset*                                   MaleIdleStateAnimation;                                     // 0x0320   (0x0008)  
	UAnimationAsset*                                   FemaleIdleStateAnimation;                                   // 0x0328   (0x0008)  
	UAnimationAsset*                                   MaleSnuggleAnimation;                                       // 0x0330   (0x0008)  
	UAnimationAsset*                                   FemaleSnuggleAnimation;                                     // 0x0338   (0x0008)  
	UAimOffsetBlendSpace1D*                            MaleAimOffsetBlendSpace;                                    // 0x0340   (0x0008)  
	UAimOffsetBlendSpace1D*                            FemaleAimOffsetBlendSpace;                                  // 0x0348   (0x0008)  
	TArray<FItemAnimationSet>                          IdleSequenceSetArray;                                       // 0x0350   (0x0010)  
	float                                              IdleAnimationTimeoutMin;                                    // 0x0360   (0x0004)  
	float                                              IdleAnimationTimeoutMax;                                    // 0x0364   (0x0004)  
	bool                                               bCanBeSnuggled;                                             // 0x0368   (0x0001)  
	unsigned char                                      UnknownData07_5[0x3];                                       // 0x0369   (0x0003)  MISSED
	float                                              SnuggleTraceRange;                                          // 0x036C   (0x0004)  
	TArray<float>                                      AnimationFloatParameters;                                   // 0x0370   (0x0010)  
	TArray<FVector>                                    AnimationVectorParameters;                                  // 0x0380   (0x0010)  
	TArray<float>                                      FemaleAnimationFloatParameters;                             // 0x0390   (0x0010)  
	TArray<FVector>                                    FemaleAnimationVectorParameters;                            // 0x03A0   (0x0010)  
	FVector                                            HandsOffset;                                                // 0x03B0   (0x000C)  
	unsigned char                                      UnknownData08_6[0x4];                                       // 0x03BC   (0x0004)  MISSED


	/// Functions
	// Function /Script/WTL.WTLUsable.NetMulticast_PutToInventory
	void NetMulticast_PutToInventory();                                                                                      // [0x17ee270] Net|NetReliableNative|Event|NetMulticast|Public 
	// Function /Script/WTL.WTLUsable.GetMesh
	USkeletalMeshComponent* GetMesh();                                                                                       // [0x19461e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLUsable.BP_CustomActionTrigger
	void BP_CustomActionTrigger(FName Name);                                                                                 // [0x1ad0090] Event|Public|BlueprintEvent 
};

/// Class /Script/WTL.WTLStuff
/// Size: 0x0098 (0x0003C0 - 0x000458)
class AWTLStuff : public AWTLUsable
{ 
public:
	unsigned char                                      UnknownData00_2[0x28];                                      // 0x03C0   (0x0028)  MISSED
	FItemAnimationSet                                  UseSequenceSet;                                             // 0x03E8   (0x0018)  
	FItemAnimationSet                                  AlternateUseSequenceSet;                                    // 0x0400   (0x0018)  
	FItemAnimationSet                                  RechargeSequenceSet;                                        // 0x0418   (0x0018)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0430   (0x0004)  MISSED
	bool                                               UseActivity;                                                // 0x0434   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0435   (0x0003)  MISSED
	float                                              ActivityUpInterpSpeed;                                      // 0x0438   (0x0004)  
	float                                              ActivityDownInterpSpeed;                                    // 0x043C   (0x0004)  
	FVector                                            AimingHandsTranslationMale;                                 // 0x0440   (0x000C)  
	FVector                                            AimingHandsTranslationFemale;                               // 0x044C   (0x000C)  


	/// Functions
	// Function /Script/WTL.WTLStuff.Server_OnCharge
	void Server_OnCharge();                                                                                                  // [0x192dd70] Net|NetReliableNative|Event|Public|NetServer|NetValidate 
	// Function /Script/WTL.WTLStuff.OnReload
	void OnReload();                                                                                                         // [0x10fc6a0] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/WTL.WTLStuff.NetMulticast_Recharge
	void NetMulticast_Recharge();                                                                                            // [0x191d950] Net|NetReliableNative|Event|NetMulticast|Public 
};

/// Class /Script/WTL.WTLCameraDisplay
/// Size: 0x0080 (0x000458 - 0x0004D8)
class AWTLCameraDisplay : public AWTLStuff
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0458   (0x0010)  MISSED
	float                                              DesiredFOV;                                                 // 0x0468   (0x0004)  
	float                                              FOVChangeSpeed;                                             // 0x046C   (0x0004)  
	UWidgetComponent*                                  ScreenWidget;                                               // 0x0470   (0x0008)  
	float                                              CameraPitchDesiredValue;                                    // 0x0478   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x047C   (0x0004)  MISSED
	TArray<FWTLDisplayAnimationSet>                    AnimationsList;                                             // 0x0480   (0x0010)  
	unsigned char                                      UnknownData02_5[0x20];                                      // 0x0490   (0x0020)  MISSED
	UAnimMontage*                                      CharacterUsingMontage;                                      // 0x04B0   (0x0008)  
	UAnimMontage*                                      TabletUsingMontage;                                         // 0x04B8   (0x0008)  
	UAnimMontage*                                      CharacterButtonMontage;                                     // 0x04C0   (0x0008)  
	UAnimMontage*                                      TabletButtonMontage;                                        // 0x04C8   (0x0008)  
	UAnimationAsset*                                   TabletWithOpenedAntennasAnim;                               // 0x04D0   (0x0008)  


	/// Functions
	// Function /Script/WTL.WTLCameraDisplay.K2_StickInputDirection
	void K2_StickInputDirection(float InputUp, float InputRight);                                                            // [0x1ad0090] Event|Public|BlueprintEvent 
};

/// Class /Script/WTL.WTLStaticReplicatedActor
/// Size: 0x0000 (0x000220 - 0x000220)
class AWTLStaticReplicatedActor : public AActor
{ 
public:
};

/// Class /Script/WTL.WTLPlaceableStuff
/// Size: 0x0178 (0x000220 - 0x000398)
class AWTLPlaceableStuff : public AWTLStaticReplicatedActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x70];                                      // 0x0220   (0x0070)  MISSED
	uint64_t                                           m_CharacterID;                                              // 0x0290   (0x0008)  
	FString                                            m_CharacterName;                                            // 0x0298   (0x0010)  
	uint64_t                                           m_CharacterGroupID;                                         // 0x02A8   (0x0008)  
	uint16_t                                           m_CharacterClanID;                                          // 0x02B0   (0x0002)  
	EWTLFaction                                        m_CharacterFaction;                                         // 0x02B2   (0x0001)  
	unsigned char                                      UnknownData01_5[0xAD];                                      // 0x02B3   (0x00AD)  MISSED
	bool                                               CanTakeDamageFromFactionMembers;                            // 0x0360   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0361   (0x0003)  MISSED
	float                                              DamageToConditionMultiplier;                                // 0x0364   (0x0004)  
	float                                              ExplosionDamageMultiplier;                                  // 0x0368   (0x0004)  
	uint32_t                                           m_Condition;                                                // 0x036C   (0x0004)  
	int32_t                                            StuffID;                                                    // 0x0370   (0x0004)  
	bool                                               SaveStateToDB;                                              // 0x0374   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0375   (0x0003)  MISSED
	float                                              SaveStateToDBInterval;                                      // 0x0378   (0x0004)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x037C   (0x0004)  MISSED
	FText                                              FullStuffName;                                              // 0x0380   (0x0018)  


	/// Functions
	// Function /Script/WTL.WTLPlaceableStuff.OnTakedBack
	void OnTakedBack(AWTLCharacter* EventInstigator);                                                                        // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLPlaceableStuff.OnRep_Condition
	void OnRep_Condition();                                                                                                  // [0xba4570] Native|Protected     
	// Function /Script/WTL.WTLPlaceableStuff.OnPlaced
	void OnPlaced(AWTLCharacter* EventInstigator);                                                                           // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLPlaceableStuff.OnEnergyChanged
	void OnEnergyChanged(float EnergyValue);                                                                                 // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLPlaceableStuff.OnConditionChanged
	void OnConditionChanged(float ConditionValue);                                                                           // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLPlaceableStuff.NetMulticast_OnDestroyed
	void NetMulticast_OnDestroyed();                                                                                         // [0x17ee270] Net|NetReliableNative|Event|NetMulticast|Protected 
	// Function /Script/WTL.WTLPlaceableStuff.K2_OnDestroyed
	void K2_OnDestroyed();                                                                                                   // [0x1ad0090] Event|Protected|BlueprintEvent 
	// Function /Script/WTL.WTLPlaceableStuff.BPCustomAnimTrigger
	void BPCustomAnimTrigger(FName TriggerName);                                                                             // [0x1ad0090] Event|Protected|BlueprintEvent 
	// Function /Script/WTL.WTLPlaceableStuff.BP_GetMaxCondition
	int32_t BP_GetMaxCondition();                                                                                            // [0x1898480] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLPlaceableStuff.BP_GetCondition
	int32_t BP_GetCondition();                                                                                               // [0x18984a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/WTL.WTLCampfire
/// Size: 0x01B8 (0x000398 - 0x000550)
class AWTLCampfire : public AWTLPlaceableStuff
{ 
public:
	unsigned char                                      UnknownData00_2[0xA8];                                      // 0x0398   (0x00A8)  MISSED
	float                                              m_Energy;                                                   // 0x0440   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0444   (0x0004)  MISSED
	FWTLStorageContent                                 m_StorageContent;                                           // 0x0448   (0x00A8)  
	unsigned char                                      UnknownData02_5[0x30];                                      // 0x04F0   (0x0030)  MISSED
	UStaticMeshComponent*                              Mesh;                                                       // 0x0520   (0x0008)  
	TArray<TEnumAsByte>                                WarmzoneObjectTypes;                                        // 0x0528   (0x0010)  
	float                                              WarmzoneRadius;                                             // 0x0538   (0x0004)  
	float                                              WarmzoneHealingPercentPerSecond;                            // 0x053C   (0x0004)  
	float                                              StartEnergy;                                                // 0x0540   (0x0004)  
	float                                              MaxEnergy;                                                  // 0x0544   (0x0004)  
	float                                              EnergyDecrementPerSecond;                                   // 0x0548   (0x0004)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x054C   (0x0004)  MISSED


	/// Functions
	// Function /Script/WTL.WTLCampfire.OnRep_StorageContent
	void OnRep_StorageContent();                                                                                             // [0x17a6930] Final|Native|Private 
	// Function /Script/WTL.WTLCampfire.OnRep_Energy
	void OnRep_Energy();                                                                                                     // [0x17a68b0] Final|Native|Private 
};

/// Class /Script/WTL.WTLCanvasDrawableInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UWTLCanvasDrawableInterface : public UInterface
{ 
public:
};

/// Class /Script/WTL.WTLCaptureComponent2D
/// Size: 0x0000 (0x0008B0 - 0x0008B0)
class UWTLCaptureComponent2D : public USceneCaptureComponent2D
{ 
public:
};

/// Class /Script/WTL.WTLCharacter
/// Size: 0x1510 (0x0004C0 - 0x0019D0)
class AWTLCharacter : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_2[0x70];                                      // 0x04C0   (0x0070)  MISSED
	bool                                               bIsMovementEnabled;                                         // 0x0530   (0x0001)  
	unsigned char                                      UnknownData01_5[0x1F];                                      // 0x0531   (0x001F)  MISSED
	float                                              m_ReplicatedStamina;                                        // 0x0550   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0554   (0x0004)  MISSED
	float                                              m_ReplicatedOxygen;                                         // 0x0558   (0x0004)  
	unsigned char                                      UnknownData03_5[0xBC];                                      // 0x055C   (0x00BC)  MISSED
	bool                                               m_FlashlightEnabled;                                        // 0x0618   (0x0001)  
	bool                                               m_IsInvulnerable;                                           // 0x0619   (0x0001)  
	bool                                               m_IsInSafeZone;                                             // 0x061A   (0x0001)  
	bool                                               m_CanSpawnOnSafeZone;                                       // 0x061B   (0x0001)  
	bool                                               m_IsInMobileResurectionPointWorkZone;                       // 0x061C   (0x0001)  
	bool                                               m_IsInPVPZone;                                              // 0x061D   (0x0001)  
	bool                                               m_IsTraveling;                                              // 0x061E   (0x0001)  
	unsigned char                                      UnknownData04_5[0x61];                                      // 0x061F   (0x0061)  MISSED
	AWTLEventPoint*                                    m_LastEventPoint;                                           // 0x0680   (0x0008)  
	bool                                               m_AdminSprintMode;                                          // 0x0688   (0x0001)  
	unsigned char                                      UnknownData05_5[0x2F];                                      // 0x0689   (0x002F)  MISSED
	bool                                               m_IsHoldingBreath;                                          // 0x06B8   (0x0001)  
	unsigned char                                      UnknownData06_5[0x1F];                                      // 0x06B9   (0x001F)  MISSED
	bool                                               m_AgressorFlag;                                             // 0x06D8   (0x0001)  
	unsigned char                                      UnknownData07_5[0x17];                                      // 0x06D9   (0x0017)  MISSED
	bool                                               bIsInFishingZone;                                           // 0x06F0   (0x0001)  
	bool                                               bIsPlacingItem;                                             // 0x06F1   (0x0001)  
	unsigned char                                      UnknownData08_5[0x1];                                       // 0x06F2   (0x0001)  MISSED
	bool                                               m_bIsInQuickThrowingState;                                  // 0x06F3   (0x0001)  
	unsigned char                                      UnknownData09_5[0x24];                                      // 0x06F4   (0x0024)  MISSED
	float                                              m_CurrentRadiationLevel;                                    // 0x0718   (0x0004)  
	unsigned char                                      UnknownData10_5[0xBC];                                      // 0x071C   (0x00BC)  MISSED
	FSpeedModifiers                                    m_SpeedModifiers;                                           // 0x07D8   (0x0008)  
	float                                              ScopeOccluderDelta;                                         // 0x07E0   (0x0004)  
	float                                              MonocularOccluderDelta;                                     // 0x07E4   (0x0004)  
	TWeakObjectPtr<UFMODEvent*>                        DeathBreathSoundEvent;                                      // 0x07E8   (0x0028)  
	TWeakObjectPtr<UFMODEvent*>                        StartHoldingBreathSoundEvent;                               // 0x0810   (0x0028)  
	TWeakObjectPtr<UFMODEvent*>                        StopHoldingBreathSoundEvent;                                // 0x0838   (0x0028)  
	TWeakObjectPtr<UFMODEvent*>                        TeleportSoundEvent;                                         // 0x0860   (0x0028)  
	TWeakObjectPtr<UFMODEvent*>                        HearingDamageEvent;                                         // 0x0888   (0x0028)  
	TWeakObjectPtr<USoundMix*>                         DrunkSoundMix;                                              // 0x08B0   (0x0028)  
	float                                              WalkFootstepMinInterval;                                    // 0x08D8   (0x0004)  
	float                                              WalkFootstepVolume;                                         // 0x08DC   (0x0004)  
	float                                              SprintFootstepMinInterval;                                  // 0x08E0   (0x0004)  
	float                                              SprintFootstepVolume;                                       // 0x08E4   (0x0004)  
	float                                              CrouchFootstepMinInterval;                                  // 0x08E8   (0x0004)  
	float                                              CrouchFootstepVolume;                                       // 0x08EC   (0x0004)  
	float                                              AimFootstepVolumeMultiplier;                                // 0x08F0   (0x0004)  
	unsigned char                                      UnknownData11_5[0xC];                                       // 0x08F4   (0x000C)  MISSED
	USkeletalMeshComponent*                            MeshTorso;                                                  // 0x0900   (0x0008)  
	USkeletalMeshComponent*                            MeshLegs;                                                   // 0x0908   (0x0008)  
	USkeletalMeshComponent*                            MeshFeet;                                                   // 0x0910   (0x0008)  
	USkeletalMeshComponent*                            MeshHead;                                                   // 0x0918   (0x0008)  
	USkeletalMeshComponent*                            MeshNeck;                                                   // 0x0920   (0x0008)  
	USkeletalMeshComponent*                            MeshHeadSlot;                                               // 0x0928   (0x0008)  
	USkeletalMeshComponent*                            MeshTorsoSlot;                                              // 0x0930   (0x0008)  
	USkeletalMeshComponent*                            MeshLegsSlot;                                               // 0x0938   (0x0008)  
	USkeletalMeshComponent*                            MeshFeetSlot;                                               // 0x0940   (0x0008)  
	USkeletalMeshComponent*                            BackpackSlot;                                               // 0x0948   (0x0008)  
	USkeletalMeshComponent*                            GlassesSlot;                                                // 0x0950   (0x0008)  
	USkeletalMeshComponent*                            WatchesSlot;                                                // 0x0958   (0x0008)  
	USkeletalMeshComponent*                            EquipmentSlot1;                                             // 0x0960   (0x0008)  
	USkeletalMeshComponent*                            EquipmentSlot2;                                             // 0x0968   (0x0008)  
	USkeletalMeshComponent*                            EquipmentSlot3;                                             // 0x0970   (0x0008)  
	USkeletalMeshComponent*                            EquipmentSlot4;                                             // 0x0978   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponPreviewSlot0;                                 // 0x0980   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponPreviewSlot0MuzzleMount;                      // 0x0988   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponPreviewSlot0MuzzleAttachment;                 // 0x0990   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponPreviewSlot0FlashlightMount;                  // 0x0998   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponPreviewSlot0FlashlightAttachment;             // 0x09A0   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponPreviewSlot0ScopeMount;                       // 0x09A8   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponPreviewSlot0ScopeAttachment;                  // 0x09B0   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponPreviewSlot1;                                 // 0x09B8   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponPreviewSlot1MuzzleMount;                      // 0x09C0   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponPreviewSlot1MuzzleAttachment;                 // 0x09C8   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponPreviewSlot1FlashlightMount;                  // 0x09D0   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponPreviewSlot1FlashlightAttachment;             // 0x09D8   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponPreviewSlot1ScopeMount;                       // 0x09E0   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponPreviewSlot1ScopeAttachment;                  // 0x09E8   (0x0008)  
	UStaticMeshComponent*                              EquippedStuffPreviewSlot5;                                  // 0x09F0   (0x0008)  
	UStaticMeshComponent*                              HolsterSlot;                                                // 0x09F8   (0x0008)  
	UStaticMeshComponent*                              EquippedPistolPreviewSlot;                                  // 0x0A00   (0x0008)  
	UStaticMeshComponent*                              SheathSlot;                                                 // 0x0A08   (0x0008)  
	UStaticMeshComponent*                              SheathPreviewSlot;                                          // 0x0A10   (0x0008)  
	UWTLFlashlightMountComponent*                      FlashlightComponent;                                        // 0x0A18   (0x0008)  
	USpotLightComponent*                               LightComponent;                                             // 0x0A20   (0x0008)  
	UStaticMeshComponent*                              FlashlightMesh;                                             // 0x0A28   (0x0008)  
	UStaticMeshComponent*                              ScopeOccluderMesh;                                          // 0x0A30   (0x0008)  
	USphereComponent*                                  BulletFlyNearVolume;                                        // 0x0A38   (0x0008)  
	UAudioComponent*                                   HeartbeatAudioComponent;                                    // 0x0A40   (0x0008)  
	UFMODAudioComponent*                               CharacterVoiceComponent;                                    // 0x0A48   (0x0008)  
	UFMODAudioComponent*                               NDPDetectorAudioComponent;                                  // 0x0A50   (0x0008)  
	UFMODAudioComponent*                               RadiationDetectorAudioComponent;                            // 0x0A58   (0x0008)  
	UWTLFMODCharacterVoiceComponent*                   VOIPComponent;                                              // 0x0A60   (0x0008)  
	UWTLCharacterIdentityComponent*                    IdentityComponent;                                          // 0x0A68   (0x0008)  
	UMaterialBillboardComponent*                       VOIPIndicatorSprite;                                        // 0x0A70   (0x0008)  
	unsigned char                                      UnknownData12_5[0x8];                                       // 0x0A78   (0x0008)  MISSED
	UPawnNoiseEmitterComponent*                        NoiseEmitterComponent;                                      // 0x0A80   (0x0008)  
	UWidgetInteractionComponent*                       WidgetInteraction;                                          // 0x0A88   (0x0008)  
	unsigned char                                      UnknownData13_5[0x4];                                       // 0x0A90   (0x0004)  MISSED
	bool                                               bIsDying;                                                   // 0x0A94   (0x0001)  
	bool                                               bIsAimToggle;                                               // 0x0A95   (0x0001)  
	bool                                               bIsCrouchToggle;                                            // 0x0A96   (0x0001)  
	bool                                               bIsSprintToggle;                                            // 0x0A97   (0x0001)  
	bool                                               bAllowRebasing;                                             // 0x0A98   (0x0001)  
	unsigned char                                      UnknownData14_5[0x3];                                       // 0x0A99   (0x0003)  MISSED
	float                                              RebasingDistance;                                           // 0x0A9C   (0x0004)  
	FTakeHitInfo                                       LastTakeHitInfo;                                            // 0x0AA0   (0x0220)  
	unsigned char                                      UnknownData15_5[0x21];                                      // 0x0CC0   (0x0021)  MISSED
	EWTLHandsState                                     HandsState;                                                 // 0x0CE1   (0x0001)  
	unsigned char                                      UnknownData16_5[0x6];                                       // 0x0CE2   (0x0006)  MISSED
	AWTLUsable*                                        UsableItemInHands;                                          // 0x0CE8   (0x0008)  
	AWTLUsable*                                        QuickItemInHands;                                           // 0x0CF0   (0x0008)  
	bool                                               bIsAiming;                                                  // 0x0CF8   (0x0001)  
	bool                                               bIsSprinting;                                               // 0x0CF9   (0x0001)  
	unsigned char                                      UnknownData17_5[0x2];                                       // 0x0CFA   (0x0002)  MISSED
	bool                                               bIsJumping;                                                 // 0x0CFC   (0x0001)  
	EWTLCharacterPose                                  CurrentPose;                                                // 0x0CFD   (0x0001)  
	unsigned char                                      UnknownData18_5[0x2];                                       // 0x0CFE   (0x0002)  MISSED
	float                                              SprintSpeed;                                                // 0x0D00   (0x0004)  
	float                                              WalkSpeed;                                                  // 0x0D04   (0x0004)  
	float                                              CrouchSpeed;                                                // 0x0D08   (0x0004)  
	float                                              ProneSpeed;                                                 // 0x0D0C   (0x0004)  
	float                                              SwimSpeed;                                                  // 0x0D10   (0x0004)  
	float                                              AimSpeedMultiplier;                                         // 0x0D14   (0x0004)  
	float                                              MaxStamina;                                                 // 0x0D18   (0x0004)  
	float                                              StaminaNotMovingIncrement;                                  // 0x0D1C   (0x0004)  
	float                                              StaminaMovingIncrement;                                     // 0x0D20   (0x0004)  
	float                                              StaminaSprintDecrement;                                     // 0x0D24   (0x0004)  
	float                                              StaminaPercentSprintAvailability;                           // 0x0D28   (0x0004)  
	float                                              StaminaJumpDecrementPercent;                                // 0x0D2C   (0x0004)  
	float                                              StaminaHoldingBreathDecrement;                              // 0x0D30   (0x0004)  
	float                                              StaminaWaterMovementDecrement;                              // 0x0D34   (0x0004)  
	float                                              StaminaUnderwaterDecrement;                                 // 0x0D38   (0x0004)  
	float                                              MaxOxygen;                                                  // 0x0D3C   (0x0004)  
	float                                              OxygenNoBreatheDecrement;                                   // 0x0D40   (0x0004)  
	float                                              OxygenBreatheIncrement;                                     // 0x0D44   (0x0004)  
	float                                              StandMinPitchAngle;                                         // 0x0D48   (0x0004)  
	float                                              StandMaxPitchAngle;                                         // 0x0D4C   (0x0004)  
	float                                              CrouchMinPitchAngle;                                        // 0x0D50   (0x0004)  
	float                                              CrouchMaxPitchAngle;                                        // 0x0D54   (0x0004)  
	float                                              ProneMinPitchAngle;                                         // 0x0D58   (0x0004)  
	float                                              ProneMaxPitchAngle;                                         // 0x0D5C   (0x0004)  
	float                                              SwimMinPitchAngle;                                          // 0x0D60   (0x0004)  
	float                                              SwimMaxPitchAngle;                                          // 0x0D64   (0x0004)  
	float                                              GravityScaleInWater;                                        // 0x0D68   (0x0004)  
	float                                              GravityScaleUnderWater;                                     // 0x0D6C   (0x0004)  
	float                                              GravityScaleOnLand;                                         // 0x0D70   (0x0004)  
	unsigned char                                      UnknownData19_5[0x18];                                      // 0x0D74   (0x0018)  MISSED
	float                                              m_CameraOffsetInterpSpeed;                                  // 0x0D8C   (0x0004)  
	unsigned char                                      UnknownData20_5[0x1A8];                                     // 0x0D90   (0x01A8)  MISSED
	AActor*                                            m_InteractiveObjectInFocus;                                 // 0x0F38   (0x0008)  
	unsigned char                                      UnknownData21_5[0x10];                                      // 0x0F40   (0x0010)  MISSED
	TArray<TEnumAsByte>                                InterestObjectTypes;                                        // 0x0F50   (0x0010)  
	float                                              InterestTraceRadius;                                        // 0x0F60   (0x0004)  
	unsigned char                                      UnknownData22_5[0x24];                                      // 0x0F64   (0x0024)  MISSED
	bool                                               bEnableHandsStateDebugging;                                 // 0x0F88   (0x0001)  
	unsigned char                                      UnknownData23_5[0x1F];                                      // 0x0F89   (0x001F)  MISSED
	bool                                               m_bIsUnderWater;                                            // 0x0FA8   (0x0001)  
	bool                                               m_bIsInWater;                                               // 0x0FA9   (0x0001)  
	bool                                               m_bMovesOnWater;                                            // 0x0FAA   (0x0001)  
	unsigned char                                      UnknownData24_5[0x5];                                       // 0x0FAB   (0x0005)  MISSED
	TWeakObjectPtr<UTexture2D*>                        m_CharacterEffectsTexture;                                  // 0x0FB0   (0x0028)  
	TMap<EWTLCharacterEffectType, FVector2D>           m_CharacterEffectIconsCoords;                               // 0x0FD8   (0x0050)  
	TMap<EWTLCharacterStateIndicatorType, FVector2D>   m_CharacterIndicatorIconsCoords;                            // 0x1028   (0x0050)  
	TWeakObjectPtr<UFont*>                             Font;                                                       // 0x1078   (0x0028)  
	TWeakObjectPtr<UTexture2D*>                        DotPointerTexture;                                          // 0x10A0   (0x0028)  
	unsigned char                                      UnknownData25_5[0x5C];                                      // 0x10C8   (0x005C)  MISSED
	float                                              m_DesiredTiltValue;                                         // 0x1124   (0x0004)  
	TWeakObjectPtr<UMaterialInterface*>                m_PlacementPreviewItemMaterial;                             // 0x1128   (0x0028)  
	FLinearColor                                       m_RightPlacementColor;                                      // 0x1150   (0x0010)  
	FLinearColor                                       m_WrongPlacementColor;                                      // 0x1160   (0x0010)  
	unsigned char                                      UnknownData26_5[0x10];                                      // 0x1170   (0x0010)  MISSED
	AStaticMeshActor*                                  M_PlacementPointer;                                         // 0x1180   (0x0008)  
	unsigned char                                      UnknownData27_5[0x10];                                      // 0x1188   (0x0010)  MISSED
	UMaterialInstanceDynamic*                          m_PlacementPreviewMaterialInstance;                         // 0x1198   (0x0008)  
	unsigned char                                      UnknownData28_5[0xC];                                       // 0x11A0   (0x000C)  MISSED
	float                                              UndergroundFlashlightIntensityMultiplier;                   // 0x11AC   (0x0004)  
	float                                              OtherCharacterFlashlightIntensityMultiplier;                // 0x11B0   (0x0004)  
	unsigned char                                      UnknownData29_5[0x1C];                                      // 0x11B4   (0x001C)  MISSED
	bool                                               m_bIsFishing;                                               // 0x11D0   (0x0001)  
	unsigned char                                      UnknownData30_5[0x3];                                       // 0x11D1   (0x0003)  MISSED
	FWTLQTEState                                       QTEState;                                                   // 0x11D4   (0x0010)  
	unsigned char                                      UnknownData31_5[0x74];                                      // 0x11E4   (0x0074)  MISSED
	EWTLSex                                            BlueprintSex;                                               // 0x1258   (0x0001)  
	unsigned char                                      UnknownData32_5[0x87];                                      // 0x1259   (0x0087)  MISSED
	AActor*                                            m_CurrentActionGameplayActor;                               // 0x12E0   (0x0008)  
	unsigned char                                      UnknownData33_5[0x2];                                       // 0x12E8   (0x0002)  MISSED
	uint16_t                                           m_CurrentEmotionKey;                                        // 0x12EA   (0x0002)  
	unsigned char                                      UnknownData34_5[0x9];                                       // 0x12EC   (0x0009)  MISSED
	bool                                               m_LeavingFromVehicle;                                       // 0x12F5   (0x0001)  
	unsigned char                                      UnknownData35_5[0x23];                                      // 0x12F6   (0x0023)  MISSED
	bool                                               PersonalEnergyShieldState;                                  // 0x1319   (0x0001)  
	unsigned char                                      UnknownData36_5[0xE];                                       // 0x131A   (0x000E)  MISSED
	AWTLDrone*                                         m_Drone;                                                    // 0x1328   (0x0008)  
	AWTLCameraDisplay*                                 m_DroneCameraDisplay;                                       // 0x1330   (0x0008)  
	FMulticastInlineDelegate                           OnCharacterDestroy;                                         // 0x1338   (0x0010)  
	FMulticastInlineDelegate                           OnTravelingResult;                                          // 0x1348   (0x0010)  
	FMulticastInlineDelegate                           OnCharacterDied;                                            // 0x1358   (0x0010)  
	FMulticastInlineDelegate                           OnCoreHackngResult;                                         // 0x1368   (0x0010)  
	FMulticastInlineDelegate                           OnCharacterLeavedFishingZone;                               // 0x1378   (0x0010)  
	FMulticastInlineDelegate                           OnCharacterEnteredInFishingZone;                            // 0x1388   (0x0010)  
	FMulticastInlineDelegate                           OnGameplayActionStarted;                                    // 0x1398   (0x0010)  
	FMulticastInlineDelegate                           OnGameplayActionFinished;                                   // 0x13A8   (0x0010)  
	unsigned char                                      UnknownData37_5[0x1];                                       // 0x13B8   (0x0001)  MISSED
	bool                                               m_bCanUseVehicleInAnomaly;                                  // 0x13B9   (0x0001)  
	unsigned char                                      UnknownData38_5[0x26];                                      // 0x13BA   (0x0026)  MISSED
	TWeakObjectPtr<UClass*>                            MaleAnimBlueprint;                                          // 0x13E0   (0x0028)  
	TWeakObjectPtr<UClass*>                            MaleWatchesAnimBlueprint;                                   // 0x1408   (0x0028)  
	TWeakObjectPtr<UClass*>                            FemaleAnimBlueprint;                                        // 0x1430   (0x0028)  
	TWeakObjectPtr<UClass*>                            FemaleWatchesAnimBlueprint;                                 // 0x1458   (0x0028)  
	FWTLLowerBodyAnimation                             StandLowerBodyRotation;                                     // 0x1480   (0x0010)  
	FWTLLowerBodyAnimation                             CrouchLowerBodyRotation;                                    // 0x1490   (0x0010)  
	UAnimMontage*                                      MaleTimeCheckAnimationMontage;                              // 0x14A0   (0x0008)  
	UAnimMontage*                                      FemaleTimeCheckAnimationMontage;                            // 0x14A8   (0x0008)  
	UAnimMontage*                                      LadderUpStartMontage;                                       // 0x14B0   (0x0008)  
	UAnimMontage*                                      LadderUpEndMontage;                                         // 0x14B8   (0x0008)  
	UAnimMontage*                                      LadderDownStartMontage;                                     // 0x14C0   (0x0008)  
	UAnimMontage*                                      LadderDownEndMontage;                                       // 0x14C8   (0x0008)  
	UAnimMontage*                                      ThrowNutMontage;                                            // 0x14D0   (0x0008)  
	UAnimMontage*                                      PickItemMontage;                                            // 0x14D8   (0x0008)  
	TMap<EWTLCharacterStunhitDirection, UAnimMontage*> StunhitAnimations;                                          // 0x14E0   (0x0050)  
	TArray<EWTLCharacterStunhitDirection>              DrunkAnimationStunhitSet;                                   // 0x1530   (0x0010)  
	TWeakObjectPtr<USkeletalMesh*>                     MaleNeckMesh;                                               // 0x1540   (0x0028)  
	TWeakObjectPtr<USkeletalMesh*>                     FemaleNeckMesh;                                             // 0x1568   (0x0028)  
	TWeakObjectPtr<USkeletalMesh*>                     MaleTorsoMeshFullArms;                                      // 0x1590   (0x0028)  
	TWeakObjectPtr<USkeletalMesh*>                     MaleTorsoMeshHalfArms;                                      // 0x15B8   (0x0028)  
	TWeakObjectPtr<USkeletalMesh*>                     MaleTorsoMeshHandsOnly;                                     // 0x15E0   (0x0028)  
	TWeakObjectPtr<USkeletalMesh*>                     FemaleTorsoMeshFullArms;                                    // 0x1608   (0x0028)  
	TWeakObjectPtr<USkeletalMesh*>                     FemaleTorsoMeshHalfArms;                                    // 0x1630   (0x0028)  
	TWeakObjectPtr<USkeletalMesh*>                     FemaleTorsoMeshHandsOnly;                                   // 0x1658   (0x0028)  
	TWeakObjectPtr<UClass*>                            CameraShakeMoveForward;                                     // 0x1680   (0x0028)  
	TWeakObjectPtr<UClass*>                            CameraShakeMoveForwardAiming;                               // 0x16A8   (0x0028)  
	TWeakObjectPtr<UClass*>                            CameraShakeMoveRight;                                       // 0x16D0   (0x0028)  
	TWeakObjectPtr<UClass*>                            CameraShakeMoveRightAiming;                                 // 0x16F8   (0x0028)  
	TWeakObjectPtr<UClass*>                            CameraShakeSprint;                                          // 0x1720   (0x0028)  
	TWeakObjectPtr<UClass*>                            CameraShakeConsternation;                                   // 0x1748   (0x0028)  
	TWeakObjectPtr<UClass*>                            NutClass;                                                   // 0x1770   (0x0028)  
	float                                              NutThrowForce;                                              // 0x1798   (0x0004)  
	unsigned char                                      UnknownData39_5[0x4];                                       // 0x179C   (0x0004)  MISSED
	FTransform                                         AdditionalNutTransform;                                     // 0x17A0   (0x0030)  
	FVector                                            AdditionalNutRotation;                                      // 0x17D0   (0x000C)  
	bool                                               bIsDead;                                                    // 0x17DC   (0x0001)  
	unsigned char                                      UnknownData40_5[0x3];                                       // 0x17DD   (0x0003)  MISSED
	float                                              NormalFOV;                                                  // 0x17E0   (0x0004)  
	float                                              SprintFOV;                                                  // 0x17E4   (0x0004)  
	float                                              NormalFOVChangeSpeed;                                       // 0x17E8   (0x0004)  
	float                                              OpticsFOVChangeSpeed;                                       // 0x17EC   (0x0004)  
	FName                                              CameraBoneName;                                             // 0x17F0   (0x0008)  
	unsigned char                                      UnknownData41_5[0x4];                                       // 0x17F8   (0x0004)  MISSED
	float                                              DissolveLifespanTrigger;                                    // 0x17FC   (0x0004)  
	unsigned char                                      UnknownData42_5[0x10];                                      // 0x1800   (0x0010)  MISSED
	bool                                               bIsClimbingLadder;                                          // 0x1810   (0x0001)  
	unsigned char                                      UnknownData43_5[0xB7];                                      // 0x1811   (0x00B7)  MISSED
	char                                               m_ChickenStatus;                                            // 0x18C8   (0x0001)  
	unsigned char                                      UnknownData44_5[0xF];                                       // 0x18C9   (0x000F)  MISSED
	float                                              BaseTurnRate;                                               // 0x18D8   (0x0004)  
	float                                              BaseLookUpRate;                                             // 0x18DC   (0x0004)  
	float                                              MouseSensivityMultiplier;                                   // 0x18E0   (0x0004)  
	unsigned char                                      UnknownData45_5[0x4];                                       // 0x18E4   (0x0004)  MISSED
	UDataTable*                                        WeaponDataTable;                                            // 0x18E8   (0x0008)  
	FVector                                            IKFloorTraceOffset;                                         // 0x18F0   (0x000C)  
	float                                              IKFloorTraceLenth;                                          // 0x18FC   (0x0004)  
	bool                                               bIKIsEnabled;                                               // 0x1900   (0x0001)  
	bool                                               bIKIsDebug;                                                 // 0x1901   (0x0001)  
	unsigned char                                      UnknownData46_5[0x2];                                       // 0x1902   (0x0002)  MISSED
	float                                              IKTraceDistance;                                            // 0x1904   (0x0004)  
	FName                                              IKRightFootSocketName;                                      // 0x1908   (0x0008)  
	FName                                              IKLeftFootSocketName;                                       // 0x1910   (0x0008)  
	float                                              IKScale;                                                    // 0x1918   (0x0004)  
	float                                              PronedEyeHeight;                                            // 0x191C   (0x0004)  
	bool                                               bIsProned;                                                  // 0x1920:0 (0x0001)  
	unsigned char                                      UnknownData47_4[0x3];                                       // 0x1921   (0x0003)  MISSED
	bool                                               bIsQuickItemChange;                                         // 0x1924   (0x0001)  
	unsigned char                                      UnknownData48_5[0x7];                                       // 0x1925   (0x0007)  MISSED
	float                                              DissolveInterpSpeed;                                        // 0x192C   (0x0004)  
	unsigned char                                      UnknownData49_5[0xD];                                       // 0x1930   (0x000D)  MISSED
	bool                                               m_bLockCameraRotation;                                      // 0x193D   (0x0001)  
	unsigned char                                      UnknownData50_5[0x5A];                                      // 0x193E   (0x005A)  MISSED
	AWTLLadder*                                        CurrentLadder;                                              // 0x1998   (0x0008)  
	char                                               RemoteViewYaw;                                              // 0x19A0   (0x0001)  
	unsigned char                                      UnknownData51_5[0x7];                                       // 0x19A1   (0x0007)  MISSED
	uint64_t                                           StandaloneCharacterID;                                      // 0x19A8   (0x0008)  
	unsigned char                                      UnknownData52_5[0x8];                                       // 0x19B0   (0x0008)  MISSED
	bool                                               bIsMonstersFollowing;                                       // 0x19B8   (0x0001)  
	unsigned char                                      UnknownData53_5[0x3];                                       // 0x19B9   (0x0003)  MISSED
	int32_t                                            MaxNumMonstersFollowing;                                    // 0x19BC   (0x0004)  
	float                                              RadiusMonsterNear;                                          // 0x19C0   (0x0004)  
	unsigned char                                      UnknownData54_6[0xC];                                       // 0x19C4   (0x000C)  MISSED


	/// Functions
	// Function /Script/WTL.WTLCharacter.UpdateEquipmentItemStates
	void UpdateEquipmentItemStates();                                                                                        // [0x17acb60] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.StopEmotion
	void StopEmotion();                                                                                                      // [0x17a8410] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.StopCameraShake
	void StopCameraShake(UClass* CameraShake);                                                                               // [0x17a9660] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.StartQTE
	void StartQTE(AActor* QTEInstigator);                                                                                    // [0x17aa910] Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.StartInteractionWithActionGameplayObject
	void StartInteractionWithActionGameplayObject(AActor* ActionGameplayActor);                                              // [0x17a8690] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.SpawnVehicle
	void SpawnVehicle(uint64_t ItemId, uint16_t VehicleID);                                                                  // [0x17b08b0] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.ShowSteamStoreInterface
	void ShowSteamStoreInterface();                                                                                          // [0x17a8620] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.ShowDeathScreen
	void ShowDeathScreen();                                                                                                  // [0xe77850] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.ShowAllMeshesVisibleOnClient
	void ShowAllMeshesVisibleOnClient(bool bVisible);                                                                        // [0x17a8c30] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.SetShowAllMeshes
	void SetShowAllMeshes(bool ShowAllMeshes);                                                                               // [0x17ad470] Final|Native|Private|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.SetDeathFromAnomaly
	void SetDeathFromAnomaly(bool DeathFromAnomaly, bool ShowAllMeshes, bool DeathSimulatePhysics);                          // [0x17ad980] Final|Native|Private|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.SetDeathByTimer
	void SetDeathByTimer(float DelayValue, UClass* DamageTypeClass, EWTLCharacterEffectType EffectType, AController* DeathInstigator, AActor* DeathCauser); // [0x17a7d90] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.SetCurrentPose
	void SetCurrentPose(EWTLCharacterPose Value);                                                                            // [0x17adb80] Final|Native|Private|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.SetAllMeshesVisible
	void SetAllMeshesVisible(bool bVisible);                                                                                 // [0x1773b90] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.Server_UseEquipmentSlot
	void Server_UseEquipmentSlot(char SlotNumber);                                                                           // [0x17ab600] Net|NetReliableNative|Event|Public|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_Use
	void Server_Use(AActor* Actor);                                                                                          // [0x17ab490] Net|NetReliableNative|Event|Public|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_ThrowNut
	void Server_ThrowNut();                                                                                                  // [0x17ab700] Net|NetReliableNative|Event|Public|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_SwitchFireMode
	void Server_SwitchFireMode();                                                                                            // [0x17afd50] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_Suicide
	void Server_Suicide();                                                                                                   // [0x17b1130] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_StopItemPlacement
	void Server_StopItemPlacement();                                                                                         // [0x17acd70] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_StopEmotion
	void Server_StopEmotion();                                                                                               // [0x17a8430] Net|NetReliableNative|Event|Public|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_StartItemPlacement
	void Server_StartItemPlacement();                                                                                        // [0x17acdd0] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_SetSprintMode
	void Server_SetSprintMode(bool Value);                                                                                   // [0x17b1020] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_SetHoldingBreath
	void Server_SetHoldingBreath(bool Value);                                                                                // [0x17b0d50] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_SetFlashlightEnabled
	void Server_SetFlashlightEnabled(bool Value);                                                                            // [0x17a7940] Net|NetReliableNative|Event|Public|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_SetDeathFromAnomaly
	void Server_SetDeathFromAnomaly(bool DeathFromAnomaly, bool ShowAllMeshes, bool DeathSimulatePhysics);                   // [0x17ad750] Final|Native|Private|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.Server_SetCurrentPose
	void Server_SetCurrentPose(EWTLCharacterPose Value);                                                                     // [0x17adc80] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_SetAppearanceProcessed
	void Server_SetAppearanceProcessed();                                                                                    // [0x17b13a0] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_SetAimMode
	void Server_SetAimMode(bool Value, bool IgnoreHandsState);                                                               // [0x17b0e80] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_SendQTEAction
	void Server_SendQTEAction(char ActionID);                                                                                // [0x17b1280] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_SelectSlot
	void Server_SelectSlot(char SlotNumber, bool AllowReselect, bool Force);                                                 // [0x17b0680] Net|NetReliableNative|Event|Public|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_RequestStuffPlacement
	void Server_RequestStuffPlacement(uint64_t StuffItemID);                                                                 // [0x17ad080] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_RequestSpecialStuffPlacement
	void Server_RequestSpecialStuffPlacement(uint16_t StuffID);                                                              // [0x17acf70] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_RequestActionGameplayActorToUse
	void Server_RequestActionGameplayActorToUse(AActor* ActionGameplayActor);                                                // [0x17ac840] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_RequestActionGameplayActorToStopUse
	void Server_RequestActionGameplayActorToStopUse();                                                                       // [0x17ac7e0] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_QuickThrow
	void Server_QuickThrow();                                                                                                // [0x17ab430] Net|NetReliableNative|Event|Public|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_QuickMeleeHit
	void Server_QuickMeleeHit();                                                                                             // [0x17ab5a0] Net|NetReliableNative|Event|Public|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_ProcessBulletFlyNear
	void Server_ProcessBulletFlyNear(FVector_NetQuantize Location, EWTLCaliber Caliber);                                     // [0x17ab190] Net|NetReliableNative|Event|Public|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_PlayEmotion
	void Server_PlayEmotion(int32_t EmotionTypeID, int32_t EmotionID);                                                       // [0x17a8490] Net|NetReliableNative|Event|Public|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_PlaceStuff
	void Server_PlaceStuff();                                                                                                // [0x17acd10] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_OnUse
	void Server_OnUse(AActor* InteractiveActor);                                                                             // [0x17affb0] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_OnTiltRight
	void Server_OnTiltRight();                                                                                               // [0x17afcf0] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_OnTiltLeft
	void Server_OnTiltLeft();                                                                                                // [0x17afc90] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_OnStopTilt
	void Server_OnStopTilt();                                                                                                // [0x17afc30] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_OnStartUse
	void Server_OnStartUse();                                                                                                // [0x17aff50] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_OnFinishUse
	void Server_OnFinishUse(AActor* InteractiveObject, bool Success);                                                        // [0x17afdb0] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_NotifyClientCheatState
	void Server_NotifyClientCheatState(EWTLCheatType CheatType, FString Info);                                               // [0x17b1400] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_MainUseStop
	void Server_MainUseStop(int32_t OptionalValue1, int32_t OptionalValue2);                                                 // [0x17b0ac0] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_MainUseStart
	void Server_MainUseStart(FVector2D AimOffset);                                                                           // [0x17b0c50] Final|Net|NetReliableNative|Event|Private|NetServer|HasDefaults|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_HideItem
	void Server_HideItem(bool Force);                                                                                        // [0x17ad270] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_HideDrone
	void Server_HideDrone();                                                                                                 // [0x17accb0] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_CoreHacking_Process
	void Server_CoreHacking_Process(char InputValue, AWTLFortificationCommandCore* CommandCore);                             // [0x17aa660] Net|Native|Event|Public|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_ClearCurrentSlot
	void Server_ClearCurrentSlot();                                                                                          // [0x17b0620] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_CancelStuffPlacementMode
	void Server_CancelStuffPlacementMode();                                                                                  // [0x17acf10] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_CancelQTE
	void Server_CancelQTE();                                                                                                 // [0x17b1220] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_AssignItemToFastAccessSlot
	void Server_AssignItemToFastAccessSlot(char SlotNumber, EWTLItemType ItemType, uint64_t ItemId);                         // [0x17b03f0] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_AlternativeUseStop
	void Server_AlternativeUseStop();                                                                                        // [0x17b0a00] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.Server_AlternativeUseStart
	void Server_AlternativeUseStart();                                                                                       // [0x17b0a60] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacter.ResetIdleTimer
	void ResetIdleTimer();                                                                                                   // [0x17a6fc0] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.PostDeath
	void PostDeath();                                                                                                        // [0x17ac3e0] Native|Public        
	// Function /Script/WTL.WTLCharacter.PlayStunhit
	void PlayStunhit(EWTLCharacterStunhitDirection StunhitDirection, bool IsHideUsableItem);                                 // [0x17a9280] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.PlaySoundEventAttached
	void PlaySoundEventAttached(UFMODEvent* Sound);                                                                          // [0x17a9a50] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.PlaySoundEvent2D
	void PlaySoundEvent2D(UFMODEvent* Sound);                                                                                // [0x17a9b30] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.PlayMontage
	void PlayMontage(UAnimMontage* MontageToPlay, bool BlockInput);                                                          // [0x17a9070] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.PlayCameraShake
	void PlayCameraShake(UClass* CameraShake, float Value, bool IsHideUsableItem, bool RemoveAiming);                        // [0x17a97b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.OnUnmuteCharacter
	void OnUnmuteCharacter();                                                                                                // [0x17ae260] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnTextChatUnmuteCharacter
	void OnTextChatUnmuteCharacter();                                                                                        // [0x17ae0c0] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnTextChatMuteCharacter
	void OnTextChatMuteCharacter();                                                                                          // [0x17ae240] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnShowInformationAboutCharacter
	void OnShowInformationAboutCharacter();                                                                                  // [0x17ae720] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnShortCharacterInfoChanged
	void OnShortCharacterInfoChanged();                                                                                      // [0x17ad190] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnSendTextChatMessageToCharacter
	void OnSendTextChatMessageToCharacter();                                                                                 // [0x17ae700] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnReportCharacter
	void OnReportCharacter();                                                                                                // [0x17adf60] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_UsableItemInHands
	void OnRep_UsableItemInHands();                                                                                          // [0x17afa90] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_Stamina
	void OnRep_Stamina();                                                                                                    // [0x17af620] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_QTEState
	void OnRep_QTEState();                                                                                                   // [0x17b1380] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_PersonalEnergyShieldState
	void OnRep_PersonalEnergyShieldState();                                                                                  // [0x17b1a70] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_Oxygen
	void OnRep_Oxygen();                                                                                                     // [0x17af580] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_LastTakeHitInfo
	void OnRep_LastTakeHitInfo();                                                                                            // [0x17afa70] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_LastEventPoint
	void OnRep_LastEventPoint();                                                                                             // [0x17af420] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_IsTraveling
	void OnRep_IsTraveling();                                                                                                // [0x17af960] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_IsProned
	void OnRep_IsProned();                                                                                                   // [0x17ac6e0] Native|Public        
	// Function /Script/WTL.WTLCharacter.OnRep_IsPlacingItem
	void OnRep_IsPlacingItem();                                                                                              // [0x17af440] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_IsInvulnerable
	void OnRep_IsInvulnerable();                                                                                             // [0x17afa50] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_IsInSafeZone
	void OnRep_IsInSafeZone();                                                                                               // [0x17afa30] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_IsInPVPZone
	void OnRep_IsInPVPZone();                                                                                                // [0x17af9c0] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_IsInMobileResurectionPointWorkZone
	void OnRep_IsInMobileResurectionPointWorkZone();                                                                         // [0x17af9c0] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_IsInFishingZone
	void OnRep_IsInFishingZone();                                                                                            // [0x17af560] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_IsHoldingBreath
	void OnRep_IsHoldingBreath();                                                                                            // [0x17af7e0] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_IsClimbingLadder
	void OnRep_IsClimbingLadder();                                                                                           // [0x17ac650] Final|Native|Public  
	// Function /Script/WTL.WTLCharacter.OnRep_HandsState
	void OnRep_HandsState(EWTLHandsState PreviousHandsState);                                                                // [0x17af710] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_FlashlightEnabled
	void OnRep_FlashlightEnabled();                                                                                          // [0x17af3e0] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_DroneRenderTargetActor
	void OnRep_DroneRenderTargetActor();                                                                                     // [0xe77850] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_Drone
	void OnRep_Drone();                                                                                                      // [0x17b1ac0] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_CurrentRadiationLevel
	void OnRep_CurrentRadiationLevel();                                                                                      // [0x17af400] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_CurrentPose
	void OnRep_CurrentPose(EWTLCharacterPose PrevValue);                                                                     // [0x17afab0] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_CurrentEmotionKey
	void OnRep_CurrentEmotionKey();                                                                                          // [0x17b15c0] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_CurrentActionGameplayActor
	void OnRep_CurrentActionGameplayActor(AActor* PrevActor);                                                                // [0x17b15e0] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_bIsSprinting
	void OnRep_bIsSprinting();                                                                                               // [0x17afbf0] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_bIsJumping
	void OnRep_bIsJumping();                                                                                                 // [0x17afb80] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnRep_bIsAiming
	void OnRep_bIsAiming();                                                                                                  // [0x17afc10] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnPickupPlaceableStuffConfirmed
	void OnPickupPlaceableStuffConfirmed();                                                                                  // [0x17ade60] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnPickupPlaceableStuff
	void OnPickupPlaceableStuff();                                                                                           // [0x17adf40] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnOfferBarterToCharacter
	void OnOfferBarterToCharacter();                                                                                         // [0x17ae600] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnOfferBarter
	void OnOfferBarter(FString Message);                                                                                     // [0x17ae510] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnMuteCharacter
	void OnMuteCharacter();                                                                                                  // [0x17ae380] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnMontageStarted
	void OnMontageStarted(UAnimMontage* Montage);                                                                            // [0x17ae8f0] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnMontageEnded
	void OnMontageEnded(UAnimMontage* Montage, bool bInterrupted);                                                           // [0x17ae9d0] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnInviteCharacterToGroup
	void OnInviteCharacterToGroup();                                                                                         // [0x17ae4f0] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnGiveTokensToCharacter
	void OnGiveTokensToCharacter();                                                                                          // [0x17ae620] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnCommendCharacter
	void OnCommendCharacter();                                                                                               // [0xe77850] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnChargePlaceableStuff
	void OnChargePlaceableStuff();                                                                                           // [0x17add80] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnCharacterInfoChanged
	void OnCharacterInfoChanged();                                                                                           // [0x17ad1f0] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.OnCapsuleEndOverlap
	void OnCapsuleEndOverlap(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // [0x17abdc0] Final|Native|Public  
	// Function /Script/WTL.WTLCharacter.OnCapsuleBeginOverlap
	void OnCapsuleBeginOverlap(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x17ac030] Final|Native|Public|HasOutParms 
	// Function /Script/WTL.WTLCharacter.OnBulletFlyNearVolumeBeginOverlap
	void OnBulletFlyNearVolumeBeginOverlap(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x17b16c0] Final|Native|Private|HasOutParms 
	// Function /Script/WTL.WTLCharacter.NetMulticast_ThrowNut
	void NetMulticast_ThrowNut();                                                                                            // [0x17ab9e0] Net|NetReliableNative|Event|NetMulticast|Public 
	// Function /Script/WTL.WTLCharacter.NetMulticast_ShowTeleportationDeviceEffect
	void NetMulticast_ShowTeleportationDeviceEffect();                                                                       // [0x17ab780] Net|NetReliableNative|Event|NetMulticast|Public 
	// Function /Script/WTL.WTLCharacter.NetMulticast_SetBrokenLight
	void NetMulticast_SetBrokenLight(bool Value);                                                                            // [0x17a7a50] Net|NetReliableNative|Event|NetMulticast|Public 
	// Function /Script/WTL.WTLCharacter.NetMulticast_PlayPickupAnimation
	void NetMulticast_PlayPickupAnimation(float Rate);                                                                       // [0x17ab910] Net|NetReliableNative|Event|NetMulticast|Public 
	// Function /Script/WTL.WTLCharacter.NetMulticast_PlayAnimMontage
	void NetMulticast_PlayAnimMontage(UAnimMontage* Montage, float Rate);                                                    // [0x17ab7a0] Net|NetReliableNative|Event|NetMulticast|Public 
	// Function /Script/WTL.WTLCharacter.NetMulticast_OnTeleportedWithDevice
	void NetMulticast_OnTeleportedWithDevice();                                                                              // [0x17ab760] Net|NetReliableNative|Event|NetMulticast|Public 
	// Function /Script/WTL.WTLCharacter.NetMulticast_OnStuffEquipmentStateChanged
	void NetMulticast_OnStuffEquipmentStateChanged(uint64_t CharacterID, uint16_t StuffID, bool State);                      // [0x17ac950] Final|Net|NetReliableNative|Event|NetMulticast|Private 
	// Function /Script/WTL.WTLCharacter.LevelLoadedAtStart
	void LevelLoadedAtStart();                                                                                               // [0x17b11f0] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.Kill
	void Kill(AController* Killer, AActor* DamageCauser, UClass* DamageTypeClass, EWTLCharacterEffectType EffectType);       // [0x17ac400] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.K2_ShowTeleportationDeviceEffect
	void K2_ShowTeleportationDeviceEffect();                                                                                 // [0x1ad0090] Event|Protected|BlueprintEvent 
	// Function /Script/WTL.WTLCharacter.K2_ShowExplosionEffectsAfterDeath
	void K2_ShowExplosionEffectsAfterDeath();                                                                                // [0x1ad0090] Event|Protected|BlueprintEvent 
	// Function /Script/WTL.WTLCharacter.K2_ShowEffectsAfterDeath
	void K2_ShowEffectsAfterDeath();                                                                                         // [0x1ad0090] Event|Protected|BlueprintEvent 
	// Function /Script/WTL.WTLCharacter.K2_SetMovementEnabled
	void K2_SetMovementEnabled(bool Value);                                                                                  // [0x17a72a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.K2_OnStartProne
	void K2_OnStartProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust);                                              // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLCharacter.K2_OnEndProne
	void K2_OnEndProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust);                                                // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLCharacter.K2_OnEffectRemoved
	void K2_OnEffectRemoved(EWTLCharacterEffectType EffectType);                                                             // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLCharacter.K2_OnEffectAdded
	void K2_OnEffectAdded(EWTLCharacterEffectType EffectType);                                                               // [0x1ad0090] Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLCharacter.K2_OnDeath
	void K2_OnDeath();                                                                                                       // [0x1ad0090] Event|Protected|BlueprintEvent 
	// Function /Script/WTL.WTLCharacter.K2_LockCameraRotation
	void K2_LockCameraRotation(bool Value);                                                                                  // [0x17a71c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.K2_GetGenericTeamID
	FGenericTeamId K2_GetGenericTeamID();                                                                                    // [0x17aa550] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.K2_GetCharacterClass
	EWTLCharacterClass K2_GetCharacterClass();                                                                               // [0x17aa2c0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.K2_CanBeSeenFrom
	bool K2_CanBeSeenFrom(FVector& ObserverLocation, FVector& OutSeenLocation, int32_t& NumberOfLoSChecksPerformed, float& OutSightStrength, AActor* IgnoreActor); // [0x17a8070] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.IsReadyToSpawnVehicle
	bool IsReadyToSpawnVehicle();                                                                                            // [0x17a74d0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.IsPVPEnabled
	bool IsPVPEnabled();                                                                                                     // [0x17aa0f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.IsPlayingEmotion
	bool IsPlayingEmotion();                                                                                                 // [0x17a83e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.IsInSafeZone
	bool IsInSafeZone();                                                                                                     // [0x17aa1c0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.IsInPVPZone
	bool IsInPVPZone();                                                                                                      // [0x17aa120] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.IsInMobileResurectionPointWorkZone
	bool IsInMobileResurectionPointWorkZone();                                                                               // [0x17aa180] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.IsInFortificationScoreZone
	bool IsInFortificationScoreZone();                                                                                       // [0x17aa160] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.IsInFishingZone
	bool IsInFishingZone();                                                                                                  // [0x17a7d70] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.IsInExactSafeZone
	bool IsInExactSafeZone(AWTLSafeZone* SafeZone);                                                                          // [0x17a9ff0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.IsInAir
	bool IsInAir();                                                                                                          // [0x17a7120] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.IncrementMonstersNear
	void IncrementMonstersNear(int32_t Value);                                                                               // [0x17a7790] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.IncrementMonstersFollowing
	void IncrementMonstersFollowing(int32_t Value);                                                                          // [0x17a7860] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.HideAllMeshes
	void HideAllMeshes();                                                                                                    // [0x17ad380] Final|Native|Private|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.GetSkeletalMeshComponentsByRef
	void GetSkeletalMeshComponentsByRef(TArray<USkeletalMeshComponent*>& Meshes);                                            // [0x17a7b30] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.GetSkeletalMeshComponents
	TArray<USkeletalMeshComponent*> GetSkeletalMeshComponents();                                                             // [0x17a7cb0] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.GetPercentHealth
	float GetPercentHealth();                                                                                                // [0x17aa4a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.GetLastEventPoint
	AWTLEventPoint* GetLastEventPoint();                                                                                     // [0x17a8770] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.GetIsInQTE
	bool GetIsInQTE();                                                                                                       // [0x17a9e40] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.GetHUD
	AWTLHUD* GetHUD();                                                                                                       // [0x17aa4d0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.GetDeathFromAnomaly
	bool GetDeathFromAnomaly();                                                                                              // [0x17a71a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.GetCurrentPose
	EWTLCharacterPose GetCurrentPose();                                                                                      // [0x17aa500] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.GetCurrentActionGameplayObject
	AActor* GetCurrentActionGameplayObject();                                                                                // [0x17a8660] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.GetComplexion
	char GetComplexion();                                                                                                    // [0x17abd50] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.GetChickenStatusAlpha
	float GetChickenStatusAlpha();                                                                                           // [0x17a70c0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.GetChickenStatus
	char GetChickenStatus();                                                                                                 // [0x17a7100] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.GetCharacterRankName
	FString GetCharacterRankName();                                                                                          // [0x17aab50] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.GetCharacterRank
	char GetCharacterRank();                                                                                                 // [0x17aabd0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.GetCharacterLevel
	char GetCharacterLevel();                                                                                                // [0x17aac00] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.GetAITeam
	EWTLAITeam GetAITeam();                                                                                                  // [0x17aa520] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.FinishInteractionWithActionGameplayObject
	void FinishInteractionWithActionGameplayObject();                                                                        // [0x17a8640] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.FailQTE
	void FailQTE();                                                                                                          // [0x17aa7f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.DecrementMonstersNear
	void DecrementMonstersNear(int32_t Value);                                                                               // [0x17a75a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.DecrementMonstersFollowing
	void DecrementMonstersFollowing(int32_t Value);                                                                          // [0x17a7690] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.Client_WrongPlacementSpotMessage
	void Client_WrongPlacementSpotMessage(FText Message);                                                                    // [0x17acb80] Final|Net|NetReliableNative|Event|Private|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_UpdateEquipmentItemStates
	void Client_UpdateEquipmentItemStates();                                                                                 // [0x17acb40] Final|Net|NetReliableNative|Event|Private|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_ShowWarningText
	void Client_ShowWarningText(FText WarningText, bool IsPlaySound);                                                        // [0x17aba00] Net|NetReliableNative|Event|Protected|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_ShowWarning
	void Client_ShowWarning(EWTLWarningTitleWidgetType WarningTitleWidgetType, bool IsPlaySound);                            // [0x17abbd0] Net|NetReliableNative|Event|Protected|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_ShowTeleportationDeviceWindowWidget
	void Client_ShowTeleportationDeviceWindowWidget(uint64_t TeleportationDeviceItemID);                                     // [0x17ac700] Final|Net|NetReliableNative|Event|Private|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_ShowSteamStoreInterface
	void Client_ShowSteamStoreInterface();                                                                                   // [0x17abd30] Net|NetReliableNative|Event|Protected|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_ShowContentInventory
	void Client_ShowContentInventory(AActor* Actor);                                                                         // [0x17ab350] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_ShowActionTimerWidget
	void Client_ShowActionTimerWidget(float Timeout, EWTLActionTimerWidgetType Type, EWTLCountdownSliderWidgetFillingType FillingType); // [0x17aefb0] Final|Net|NetReliableNative|Event|Private|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_SetDeathFromAnomaly
	void Client_SetDeathFromAnomaly(bool DeathFromAnomaly, bool ShowAllMeshes, bool DeathSimulatePhysics);                   // [0x17ad550] Final|Net|Native|Event|Private|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_SetAllMeshesVisible
	void Client_SetAllMeshesVisible(bool bVisible);                                                                          // [0x17a8d50] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_SetAdminGodMode
	void Client_SetAdminGodMode(bool Value);                                                                                 // [0x17a9d60] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_SetAdminDropMode
	void Client_SetAdminDropMode(bool Value);                                                                                // [0x17a9c80] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_SelectSlot
	void Client_SelectSlot(char SlotNumber, bool AllowReselect, bool Force);                                                 // [0x17b01c0] Final|Net|NetReliableNative|Event|Private|NetClient|NetValidate 
	// Function /Script/WTL.WTLCharacter.Client_ResetCurrentInteractiveObjetHighlight
	void Client_ResetCurrentInteractiveObjetHighlight();                                                                     // [0x17a8c10] Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.Client_ResetAimMode
	void Client_ResetAimMode();                                                                                              // [0x17b0e60] Final|Net|NetReliableNative|Event|Private|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_RadiationDetectorSignal
	void Client_RadiationDetectorSignal(float Power);                                                                        // [0x17a8a70] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_OnUsePortalError
	void Client_OnUsePortalError();                                                                                          // [0x17aaf20] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_OnUsePortal
	void Client_OnUsePortal();                                                                                               // [0x17aaf40] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_OnStuffPlacementMode
	void Client_OnStuffPlacementMode(uint16_t StuffID);                                                                      // [0x17ace30] Final|Net|NetReliableNative|Event|Private|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_OnPostSelectSlot
	void Client_OnPostSelectSlot(char SlotNumber);                                                                           // [0x17b00c0] Final|Net|NetReliableNative|Event|Private|NetClient|NetValidate 
	// Function /Script/WTL.WTLCharacter.Client_OnPosses
	void Client_OnPosses(uint64_t PossesedCharacterID);                                                                      // [0x17af300] Final|Net|NetReliableNative|Event|Private|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_OnPlaceableStuffUsed
	void Client_OnPlaceableStuffUsed(AActor* Actor);                                                                         // [0x17ae7f0] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_OnMedicineApplied
	void Client_OnMedicineApplied(uint16_t MedicineID);                                                                      // [0x17a8990] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_OnItemUnequipped
	void Client_OnItemUnequipped();                                                                                          // [0x17ad210] Final|Net|NetReliableNative|Event|Private|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_OnItemEquipped
	void Client_OnItemEquipped();                                                                                            // [0x17ad230] Final|Net|NetReliableNative|Event|Private|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_OnHideItem
	void Client_OnHideItem();                                                                                                // [0x17ad250] Final|Net|NetReliableNative|Event|Private|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_OnEventZoneLeave
	void Client_OnEventZoneLeave(AWTLEventPoint* EventPoint);                                                                // [0x17aec90] Final|Net|NetReliableNative|Event|Private|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_OnEventZoneFinished
	void Client_OnEventZoneFinished(AWTLEventPoint* EventPoint, bool Successful);                                            // [0x17aeb30] Final|Net|NetReliableNative|Event|Private|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_OnEventZoneEnter
	void Client_OnEventZoneEnter(AWTLEventPoint* EventPoint, bool ShowInformer);                                             // [0x17aed70] Final|Net|NetReliableNative|Event|Private|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_OnEquipmentItemStateChanged
	void Client_OnEquipmentItemStateChanged(uint16_t StuffID, bool bIsEnabled);                                              // [0x17aa9f0] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_OnEffectRemoved
	void Client_OnEffectRemoved(EWTLCharacterEffectType EffectType);                                                         // [0x17aac30] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_OnEffectAdded
	void Client_OnEffectAdded(EWTLCharacterEffectType EffectType);                                                           // [0x17aad00] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_OnCharacterUsed
	void Client_OnCharacterUsed();                                                                                           // [0x17ae8d0] Final|Net|NetReliableNative|Event|Private|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_OnBulletFlyNear
	void Client_OnBulletFlyNear(FVector_NetQuantize Position, EWTLCaliber Caliber);                                          // [0x17af190] Final|Net|Native|Event|Private|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_NDPDetectorSignal
	void Client_NDPDetectorSignal(float Power);                                                                              // [0x17a8b40] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_LockInputUnequipUsableItemAndUse
	void Client_LockInputUnequipUsableItemAndUse();                                                                          // [0x17a9e60] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_HideActionTimerWidget
	void Client_HideActionTimerWidget(bool Success);                                                                         // [0x17aeed0] Final|Net|NetReliableNative|Event|Private|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_EffectCameraManager
	void Client_EffectCameraManager(float AddVingette, float AddFringe, bool IsHideUsableItem, bool RemoveAiming);           // [0x17a93d0] Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.Client_CoreHacking_Result
	void Client_CoreHacking_Result(char Result);                                                                             // [0x17aa590] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_ClearChat
	void Client_ClearChat();                                                                                                 // [0x17a6fe0] Net|Native|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_ApplyHearingDamage
	void Client_ApplyHearingDamage(float Duration, float Falloff);                                                           // [0x17a9e80] Net|NetReliableNative|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.Client_AddMarkers
	void Client_AddMarkers(TArray<FWTLMarkerMemoryElement> Markers);                                                         // [0x17a7380] Net|Native|Event|Public|NetClient 
	// Function /Script/WTL.WTLCharacter.CleanMotionVector
	void CleanMotionVector();                                                                                                // [0x17a8790] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.ChickenStatusDelta
	void ChickenStatusDelta(int32_t Delta);                                                                                  // [0x17a7000] Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.CharacterStunned
	bool CharacterStunned();                                                                                                 // [0x17a74f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.CanSpawnOnSafeZone
	bool CanSpawnOnSafeZone();                                                                                               // [0x17aa1a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.CancelQTE
	void CancelQTE(bool bIsFromClientside);                                                                                  // [0x17aa810] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.Broadcast_SetAllMeshesVisible
	void Broadcast_SetAllMeshesVisible(bool bVisible);                                                                       // [0x17a8e30] Net|NetReliableNative|Event|NetMulticast|Public 
	// Function /Script/WTL.WTLCharacter.Broadcast_PlayMontage
	void Broadcast_PlayMontage(UAnimMontage* MontageToPlay, bool BlockInput);                                                // [0x17a8f10] Net|NetReliableNative|Event|NetMulticast|Public 
	// Function /Script/WTL.WTLCharacter.Broadcast_OnStunhit
	void Broadcast_OnStunhit(EWTLCharacterStunhitDirection StunhitDirection);                                                // [0x17a91b0] Net|NetReliableNative|Event|NetMulticast|Public 
	// Function /Script/WTL.WTLCharacter.BPHavePremium
	bool BPHavePremium();                                                                                                    // [0x17aa1e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.BPGetCharacterName
	FString BPGetCharacterName();                                                                                            // [0x17aa330] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.BPGetCharacterID
	int64_t BPGetCharacterID();                                                                                              // [0x17aa420] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.AvailableNear
	bool AvailableNear();                                                                                                    // [0x17a7520] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.AvailableForPursuit
	bool AvailableForPursuit();                                                                                              // [0x17a7560] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.ApplyHearingDamage
	void ApplyHearingDamage(float Duration, float Falloff);                                                                  // [0x17a9e80] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.ApplyEffectToCharacter
	void ApplyEffectToCharacter(EWTLCharacterEffectType EffectType, float Value);                                            // [0x17aadd0] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacter.AllLevelsLoadedAtStart
	void AllLevelsLoadedAtStart();                                                                                           // [0x17b1190] Final|Native|Private 
	// Function /Script/WTL.WTLCharacter.AIInterface_IsInSafeZone
	bool AIInterface_IsInSafeZone();                                                                                         // [0x17ab040] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.AIInterface_IsCanBeAttacked
	bool AIInterface_IsCanBeAttacked(EWTLFaction InstigatorFaction);                                                         // [0x17aaf60] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.AIInterface_IsAlive
	bool AIInterface_IsAlive();                                                                                              // [0x17ab150] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.AIInterface_GetVelocity
	FVector AIInterface_GetVelocity();                                                                                       // [0x17ab0c0] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.AIInterface_GetGroupID
	int32_t AIInterface_GetGroupID();                                                                                        // [0x17ab110] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacter.AIInterface_GetFaction
	EWTLFaction AIInterface_GetFaction();                                                                                    // [0x17ab080] Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/WTL.WTLAnimationMetaData
/// Size: 0x0008 (0x000028 - 0x000030)
class UWTLAnimationMetaData : public UAnimMetaData
{ 
public:
	bool                                               bShouldReplaceAnimInstance;                                 // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0029   (0x0003)  MISSED
	float                                              RagdollBlendWeight;                                         // 0x002C   (0x0004)  
};

/// Class /Script/WTL.WTLRootMotionAnimationMetaData
/// Size: 0x0008 (0x000028 - 0x000030)
class UWTLRootMotionAnimationMetaData : public UAnimMetaData
{ 
public:
	EWTLRootMotionControlLockingType                   RootMotionControllerLockingType;                            // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0029   (0x0007)  MISSED
};

/// Class /Script/WTL.WTLCameraLimitsAnimationMetaData
/// Size: 0x0010 (0x000028 - 0x000038)
class UWTLCameraLimitsAnimationMetaData : public UAnimMetaData
{ 
public:
	float                                              YawLimit;                                                   // 0x0028   (0x0004)  
	float                                              MinPitchLimit;                                              // 0x002C   (0x0004)  
	float                                              MaxPitchLimit;                                              // 0x0030   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0034   (0x0004)  MISSED
};

/// Class /Script/WTL.WTLCameraStyleAnimationMetaData
/// Size: 0x0010 (0x000028 - 0x000038)
class UWTLCameraStyleAnimationMetaData : public UAnimMetaData
{ 
public:
	FName                                              CameraStyle;                                                // 0x0028   (0x0008)  
	float                                              FreeCameraDistance;                                         // 0x0030   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0034   (0x0004)  MISSED
};

/// Class /Script/WTL.WTLPawnRotationLockingAnimationMetaData
/// Size: 0x0008 (0x000028 - 0x000030)
class UWTLPawnRotationLockingAnimationMetaData : public UAnimMetaData
{ 
public:
	bool                                               bOverrideUseControllerPitch;                                // 0x0028   (0x0001)  
	bool                                               bNewUseControllerPitchValue;                                // 0x0029   (0x0001)  
	bool                                               bOverrideUseControllerYaw;                                  // 0x002A   (0x0001)  
	bool                                               bNewUseControllerYawValue;                                  // 0x002B   (0x0001)  
	bool                                               bOverrideUseControllerRoll;                                 // 0x002C   (0x0001)  
	bool                                               bNewUseControllerRollValue;                                 // 0x002D   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x002E   (0x0002)  MISSED
};

/// Class /Script/WTL.WTLSpecialStatesAnimationMetaData
/// Size: 0x0008 (0x000028 - 0x000030)
class UWTLSpecialStatesAnimationMetaData : public UAnimMetaData
{ 
public:
	bool                                               bOverrideCrouchState;                                       // 0x0028   (0x0001)  
	bool                                               bNewCrouchState;                                            // 0x0029   (0x0001)  
	bool                                               bLockMovement;                                              // 0x002A   (0x0001)  
	bool                                               BlockCameraRotation;                                        // 0x002B   (0x0001)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Class /Script/WTL.WTLPawnCapsuleCollisionRemover
/// Size: 0x0000 (0x000028 - 0x000028)
class UWTLPawnCapsuleCollisionRemover : public UAnimMetaData
{ 
public:
};

/// Class /Script/WTL.WTLPawnInVehicleMetaData
/// Size: 0x0008 (0x000028 - 0x000030)
class UWTLPawnInVehicleMetaData : public UAnimMetaData
{ 
public:
	bool                                               bShowCharacterMesh;                                         // 0x0028   (0x0001)  
	bool                                               bHideMeshIfMontageEnded;                                    // 0x0029   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x002A   (0x0006)  MISSED
};

/// Class /Script/WTL.WTLResetLowerBodyRotationAnimationMetaData
/// Size: 0x0000 (0x000028 - 0x000028)
class UWTLResetLowerBodyRotationAnimationMetaData : public UAnimMetaData
{ 
public:
};

/// Class /Script/WTL.WTLCharacterBodyAnimInstance
/// Size: 0x0CE0 (0x0002C0 - 0x000FA0)
class UWTLCharacterBodyAnimInstance : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_2[0x40];                                      // 0x02C0   (0x0040)  MISSED
	FWTLCharacterAnimInstanceProxy                     CharacterProxy;                                             // 0x0300   (0x0770)  
	TMap<uint16_t, uint16_t>                           WeaponItemRemap;                                            // 0x0A70   (0x0050)  
	TMap<uint16_t, uint16_t>                           StuffItemRemap;                                             // 0x0AC0   (0x0050)  
	bool                                               IsFirstPerson;                                              // 0x0B10   (0x0001)  
	EWTLSex                                            CharacterSex;                                               // 0x0B11   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x0B12   (0x0002)  MISSED
	FVector                                            LookDirection;                                              // 0x0B14   (0x000C)  
	float                                              CameraAimOffset;                                            // 0x0B20   (0x0004)  
	float                                              CameraAimOffsetInterpSpeedMultiplier;                       // 0x0B24   (0x0004)  
	float                                              MoveDirection;                                              // 0x0B28   (0x0004)  
	float                                              SnuggleValue;                                               // 0x0B2C   (0x0004)  
	float                                              MovementSpeed;                                              // 0x0B30   (0x0004)  
	float                                              VelocityZ;                                                  // 0x0B34   (0x0004)  
	float                                              BodyTilt;                                                   // 0x0B38   (0x0004)  
	bool                                               bIsInAir;                                                   // 0x0B3C   (0x0001)  
	bool                                               bIsUnderWater;                                              // 0x0B3D   (0x0001)  
	bool                                               bIsInWater;                                                 // 0x0B3E   (0x0001)  
	bool                                               bMovesOnWater;                                              // 0x0B3F   (0x0001)  
	bool                                               bIsAiming;                                                  // 0x0B40   (0x0001)  
	bool                                               bIsCrouch;                                                  // 0x0B41   (0x0001)  
	bool                                               bIsProne;                                                   // 0x0B42   (0x0001)  
	bool                                               bIsJumping;                                                 // 0x0B43   (0x0001)  
	bool                                               bIsSprinting;                                               // 0x0B44   (0x0001)  
	bool                                               bIsLadderClimbing;                                          // 0x0B45   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x0B46   (0x0002)  MISSED
	FVector                                            InputVector;                                                // 0x0B48   (0x000C)  
	float                                              MoveSpeedValue;                                             // 0x0B54   (0x0004)  
	float                                              MoveTurnValue;                                              // 0x0B58   (0x0004)  
	EWTLCharacterMoveState                             MovementState;                                              // 0x0B5C   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0B5D   (0x0003)  MISSED
	float                                              HoldingBreath;                                              // 0x0B60   (0x0004)  
	float                                              StaminaValue;                                               // 0x0B64   (0x0004)  
	float                                              TirednessValue;                                             // 0x0B68   (0x0004)  
	float                                              TirednessValueMultiplier;                                   // 0x0B6C   (0x0004)  
	UCurveVector*                                      AnimationCurve;                                             // 0x0B70   (0x0008)  
	FRotator                                           CurrentWeaponRotation;                                      // 0x0B78   (0x000C)  
	EWTLHandsState                                     HandsState;                                                 // 0x0B84   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x0B85   (0x0003)  MISSED
	float                                              ItemEquipTime;                                              // 0x0B88   (0x0004)  
	float                                              ItemUnequipTime;                                            // 0x0B8C   (0x0004)  
	float                                              LeftHandThumbInputUp;                                       // 0x0B90   (0x0004)  
	float                                              LeftHandThumbInputRight;                                    // 0x0B94   (0x0004)  
	bool                                               CanUseHandsLocomotion;                                      // 0x0B98   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x0B99   (0x0003)  MISSED
	FName                                              IKRightFootAlphaCurveName;                                  // 0x0B9C   (0x0008)  
	FName                                              IKLeftFootAlphaCurveName;                                   // 0x0BA4   (0x0008)  
	FName                                              IKRightKneeSocketName;                                      // 0x0BAC   (0x0008)  
	FName                                              IKLeftKneeSocketName;                                       // 0x0BB4   (0x0008)  
	float                                              IKHipInterpSpeed;                                           // 0x0BBC   (0x0004)  
	float                                              IKEffectorPositionInterpSpeed;                              // 0x0BC0   (0x0004)  
	float                                              IKAlphaInterpSpeed;                                         // 0x0BC4   (0x0004)  
	float                                              IKFootNormalInterpSpeed;                                    // 0x0BC8   (0x0004)  
	float                                              IKHipOffset;                                                // 0x0BCC   (0x0004)  
	unsigned char                                      UnknownData06_5[0x4];                                       // 0x0BD0   (0x0004)  MISSED
	float                                              IKFloorTraceValue;                                          // 0x0BD4   (0x0004)  
	FVector                                            IKHipTarget;                                                // 0x0BD8   (0x000C)  
	FVector                                            IKRightFootEffectorPosition;                                // 0x0BE4   (0x000C)  
	unsigned char                                      UnknownData07_5[0xC];                                       // 0x0BF0   (0x000C)  MISSED
	FVector                                            IKLeftFootEffectorPosition;                                 // 0x0BFC   (0x000C)  
	unsigned char                                      UnknownData08_5[0xC];                                       // 0x0C08   (0x000C)  MISSED
	FVector                                            IKRightKneePosition;                                        // 0x0C14   (0x000C)  
	FVector                                            IKLeftKneePosition;                                         // 0x0C20   (0x000C)  
	FVector                                            IKRightFootNormal;                                          // 0x0C2C   (0x000C)  
	unsigned char                                      UnknownData09_5[0xC];                                       // 0x0C38   (0x000C)  MISSED
	FVector                                            IKLeftFootNormal;                                           // 0x0C44   (0x000C)  
	unsigned char                                      UnknownData10_5[0xC];                                       // 0x0C50   (0x000C)  MISSED
	bool                                               bIKRightFootHit;                                            // 0x0C5C   (0x0001)  
	bool                                               bIKLeftFootHit;                                             // 0x0C5D   (0x0001)  
	unsigned char                                      UnknownData11_5[0x2];                                       // 0x0C5E   (0x0002)  MISSED
	float                                              IKRightFootAlpha;                                           // 0x0C60   (0x0004)  
	float                                              IKLeftFootAlpha;                                            // 0x0C64   (0x0004)  
	FName                                              IKHandsOffsetBoneName;                                      // 0x0C68   (0x0008)  
	FTransform                                         IKHandsOffsetBoneTransform;                                 // 0x0C70   (0x0030)  
	int32_t                                            UsableItemID;                                               // 0x0CA0   (0x0004)  
	int32_t                                            LastUsableItemID;                                           // 0x0CA4   (0x0004)  
	EWTLItemType                                       UsableItemType;                                             // 0x0CA8   (0x0001)  
	unsigned char                                      UnknownData12_5[0x7];                                       // 0x0CA9   (0x0007)  MISSED
	TArray<float>                                      UsableItemAnimationFloatParameters;                         // 0x0CB0   (0x0010)  
	TArray<FVector>                                    UsableItemAnimationVectorParameters;                        // 0x0CC0   (0x0010)  
	FVector                                            HandsOffset;                                                // 0x0CD0   (0x000C)  
	EWTLWeaponType                                     CurrentWeaponType;                                          // 0x0CDC   (0x0001)  
	unsigned char                                      UnknownData13_5[0x3];                                       // 0x0CDD   (0x0003)  MISSED
	float                                              RotationSpeedVertical;                                      // 0x0CE0   (0x0004)  
	FVector                                            RecoilTranslation;                                          // 0x0CE4   (0x000C)  
	FRotator                                           RecoilRotation;                                             // 0x0CF0   (0x000C)  
	unsigned char                                      UnknownData14_5[0x4];                                       // 0x0CFC   (0x0004)  MISSED
	UAnimSequence*                                     IdleAnimation;                                              // 0x0D00   (0x0008)  
	UAnimSequence*                                     SnuggleAnimation;                                           // 0x0D08   (0x0008)  
	UAimOffsetBlendSpace1D*                            AimOffsetBlendSpace;                                        // 0x0D10   (0x0008)  
	FVector                                            AimingHandsTranslation;                                     // 0x0D18   (0x000C)  
	FVector                                            AimingHandsOffset;                                          // 0x0D24   (0x000C)  
	FVector                                            MissileSocketOffset;                                        // 0x0D30   (0x000C)  
	FVector                                            ThumbLOffset;                                               // 0x0D3C   (0x000C)  
	FVector                                            ThumbROffset;                                               // 0x0D48   (0x000C)  
	float                                              FirstSwingingAnimAlphaScaleParameter;                       // 0x0D54   (0x0004)  
	float                                              SecondSwingingAnimAlphaScaleParameter;                      // 0x0D58   (0x0004)  
	float                                              ThirdPersonSwingingAnimAlphaParameter;                      // 0x0D5C   (0x0004)  
	float                                              FirstPersonSwingingAnimAlphaParameter;                      // 0x0D60   (0x0004)  
	float                                              CombatBreathAnimPlayRateScaleParameter;                     // 0x0D64   (0x0004)  
	float                                              CombatBreathAnimPlayRateMaxValueParameter;                  // 0x0D68   (0x0004)  
	float                                              CombatBreathAnimPlayRateMinValueParameter;                  // 0x0D6C   (0x0004)  
	float                                              ThirdPersonCombatBreathAnimAimingAlphaMaxValueParameter;    // 0x0D70   (0x0004)  
	float                                              ThirdPersonCombatBreathAnimAimingAlphaMinValueParameter;    // 0x0D74   (0x0004)  
	float                                              FirstPersonCombatBreathAnimAlphaParameter;                  // 0x0D78   (0x0004)  
	float                                              ThirdPersonWeaponRotationAnimAlphaParameter;                // 0x0D7C   (0x0004)  
	float                                              FirstPersonWeaponRotationAnimStaminaAlphaMinValueParameter; // 0x0D80   (0x0004)  
	float                                              FirstPersonWeaponRotationAnimStaminaAlphaMaxValueParameter; // 0x0D84   (0x0004)  
	float                                              FirstPersonWeaponRotationAnimAimingAlphaMinValueParameter;  // 0x0D88   (0x0004)  
	float                                              FirstPersonWeaponRotationAnimAimingAlphaMaxValueParameter;  // 0x0D8C   (0x0004)  
	float                                              WeaponRotationLocomotionAimingAlphaMinValueParameter;       // 0x0D90   (0x0004)  
	float                                              WeaponRotationLocomotionAimingAlphaMaxValueParameter;       // 0x0D94   (0x0004)  
	float                                              WeaponRotationLocomotionHoldingBreathAlphaMinValueParameter; // 0x0D98   (0x0004)  
	float                                              WeaponRotationLocomotionHoldingBreathAlphaMaxValueParameter; // 0x0D9C   (0x0004)  
	FName                                              RightPocketLocationSocketName;                              // 0x0DA0   (0x0008)  
	FName                                              LeftPocketLocationSocketName;                               // 0x0DA8   (0x0008)  
	FName                                              LeftJointTargetSocketName;                                  // 0x0DB0   (0x0008)  
	FName                                              RightJointTargetSocketName;                                 // 0x0DB8   (0x0008)  
	float                                              AimingRecoilAlphaMinValueParameter;                         // 0x0DC0   (0x0004)  
	float                                              AimingRecoilAlphaMaxValueParameter;                         // 0x0DC4   (0x0004)  
	float                                              ThirdPersonStaminaValueAnimPlayRateMinValueParameter;       // 0x0DC8   (0x0004)  
	float                                              ThirdPersonStaminaValueAnimPlayRateMaxValueParameter;       // 0x0DCC   (0x0004)  
	float                                              WeaponRotationAimOffsetVelocityMinValueParameter;           // 0x0DD0   (0x0004)  
	float                                              WeaponRotationAimOffsetVelocityMaxValueParameter;           // 0x0DD4   (0x0004)  
	float                                              StaminaInterpolationSpeed;                                  // 0x0DD8   (0x0004)  
	float                                              NonSprintingSpeedTreshold;                                  // 0x0DDC   (0x0004)  
	FVector                                            FloorNormal;                                                // 0x0DE0   (0x000C)  
	float                                              DotPCapsule;                                                // 0x0DEC   (0x0004)  
	float                                              DotPRightFoot;                                              // 0x0DF0   (0x0004)  
	float                                              DotPLeftFoot;                                               // 0x0DF4   (0x0004)  
	float                                              ForwardVelocity;                                            // 0x0DF8   (0x0004)  
	float                                              SideVelocity;                                               // 0x0DFC   (0x0004)  
	float                                              LowerBodyRelativeAngle;                                     // 0x0E00   (0x0004)  
	float                                              LowerBodyFixedRelativeAngle;                                // 0x0E04   (0x0004)  
	EWTLCharacterAnimationInstanceMovementState        LocomotionState;                                            // 0x0E08   (0x0001)  
	unsigned char                                      UnknownData15_5[0x3];                                       // 0x0E09   (0x0003)  MISSED
	float                                              RotationSpeedHorizontalWithDirection;                       // 0x0E0C   (0x0004)  
	float                                              OneMinusIsNoMovementCurveValue;                             // 0x0E10   (0x0004)  
	float                                              OneMinusEmptyHandsCurveValue;                               // 0x0E14   (0x0004)  
	float                                              AimingRecoilAlpha;                                          // 0x0E18   (0x0004)  
	float                                              ThirdPersonStaminaValueAnimPlayRate;                        // 0x0E1C   (0x0004)  
	float                                              IsNotFirstPersonAlpha;                                      // 0x0E20   (0x0004)  
	float                                              WeaponRotationAimOffsetForwardVelocity;                     // 0x0E24   (0x0004)  
	float                                              WeaponRotationAimOffsetSideVelocity;                        // 0x0E28   (0x0004)  
	float                                              CombatBreathAnimPlayRate;                                   // 0x0E2C   (0x0004)  
	float                                              CombatBreathAnimAlpha;                                      // 0x0E30   (0x0004)  
	float                                              WeaponRotationAnimAlpha;                                    // 0x0E34   (0x0004)  
	float                                              WeaponRotationLocomotionAlpha;                              // 0x0E38   (0x0004)  
	FRotator                                           AimOffsetBoneRotation;                                      // 0x0E3C   (0x000C)  
	float                                              AimingAlphaCurveValue;                                      // 0x0E48   (0x0004)  
	bool                                               bIsInCombatMode;                                            // 0x0E4C   (0x0001)  
	unsigned char                                      UnknownData16_5[0x3];                                       // 0x0E4D   (0x0003)  MISSED
	float                                              FirstSwingAnimAlpha;                                        // 0x0E50   (0x0004)  
	float                                              SecondSwingAnimAlpha;                                       // 0x0E54   (0x0004)  
	float                                              AimOffsetBoneRotationAlpha;                                 // 0x0E58   (0x0004)  
	FVector                                            HandsTranslationOffset;                                     // 0x0E5C   (0x000C)  
	float                                              OneMinusAimingAlphaCurveValue;                              // 0x0E68   (0x0004)  
	FVector                                            AimingHandsTranslationOffset;                               // 0x0E6C   (0x000C)  
	FVector                                            HandsAimOffsetDownTranslationOffset;                        // 0x0E78   (0x000C)  
	float                                              HandsAimOffsetDownAlpha;                                    // 0x0E84   (0x0004)  
	FVector                                            RightPocketLocation;                                        // 0x0E88   (0x000C)  
	FVector                                            LeftPocketLocation;                                         // 0x0E94   (0x000C)  
	FVector                                            LeftJointTargetLocation;                                    // 0x0EA0   (0x000C)  
	FVector                                            RightJointTargetLocation;                                   // 0x0EAC   (0x000C)  
	float                                              RightHandAlphaCurveValue;                                   // 0x0EB8   (0x0004)  
	float                                              LeftHandAlphaCurveValue;                                    // 0x0EBC   (0x0004)  
	FRotator                                           LowerBodyRotation;                                          // 0x0EC0   (0x000C)  
	FRotator                                           IKFootRootBoneRotation;                                     // 0x0ECC   (0x000C)  
	FVector                                            PelvisOffset;                                               // 0x0ED8   (0x000C)  
	FRotator                                           RightFootRotation;                                          // 0x0EE4   (0x000C)  
	FRotator                                           LeftFootRotation;                                           // 0x0EF0   (0x000C)  
	float                                              LadderLoopAnimPlayRate;                                     // 0x0EFC   (0x0004)  
	bool                                               IsLadderNoMovement;                                         // 0x0F00   (0x0001)  
	unsigned char                                      UnknownData17_5[0x3];                                       // 0x0F01   (0x0003)  MISSED
	FVector                                            ScaleRibCageVector;                                         // 0x0F04   (0x000C)  
	FVector                                            InvertScaleRibCageVector;                                   // 0x0F10   (0x000C)  
	FVector                                            ScaleNeckVector;                                            // 0x0F1C   (0x000C)  
	FVector                                            ScaleHeadVector;                                            // 0x0F28   (0x000C)  
	FVector                                            ScaleHandsVector;                                           // 0x0F34   (0x000C)  
	FVector                                            InvertScaleHandsVector;                                     // 0x0F40   (0x000C)  
	FVector                                            ScaleFeetVector;                                            // 0x0F4C   (0x000C)  
	FVector                                            InvertScaleFeetVector;                                      // 0x0F58   (0x000C)  
	bool                                               bIsUnequip;                                                 // 0x0F64   (0x0001)  
	unsigned char                                      UnknownData18_5[0x3];                                       // 0x0F65   (0x0003)  MISSED
	float                                              FIsUnequip;                                                 // 0x0F68   (0x0004)  
	float                                              FScaleNeck;                                                 // 0x0F6C   (0x0004)  
	float                                              FScaleHead;                                                 // 0x0F70   (0x0004)  
	float                                              FScaleRibCage;                                              // 0x0F74   (0x0004)  
	float                                              FScaleBody;                                                 // 0x0F78   (0x0004)  
	float                                              FScaleHands;                                                // 0x0F7C   (0x0004)  
	float                                              FScaleFeet;                                                 // 0x0F80   (0x0004)  
	float                                              FTiltXWithFishingRod;                                       // 0x0F84   (0x0004)  
	float                                              FTiltYWithFishingRod;                                       // 0x0F88   (0x0004)  
	float                                              FRodResistanceValue;                                        // 0x0F8C   (0x0004)  
	bool                                               InFishingMode;                                              // 0x0F90   (0x0001)  
	bool                                               NowIsFishing;                                               // 0x0F91   (0x0001)  
	bool                                               ShowCathedFish;                                             // 0x0F92   (0x0001)  
	unsigned char                                      UnknownData19_5[0x1];                                       // 0x0F93   (0x0001)  MISSED
	int32_t                                            Complexion;                                                 // 0x0F94   (0x0004)  
	unsigned char                                      UnknownData20_6[0x8];                                       // 0x0F98   (0x0008)  MISSED


	/// Functions
	// Function /Script/WTL.WTLCharacterBodyAnimInstance.UpdateComplexity
	void UpdateComplexity();                                                                                                 // [0x17b8d20] Native|Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Script/WTL.WTLCharacterBodyAnimInstance.K2_MortarLoadingInProccess
	bool K2_MortarLoadingInProccess();                                                                                       // [0x17b8680] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacterBodyAnimInstance.K2_GetMortarSocketLocationInComponentSpace
	FVector K2_GetMortarSocketLocationInComponentSpace(FName Socket);                                                        // [0x17b8a00] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacterBodyAnimInstance.K2_GetMortarSocketLocationInBoneSpace
	FVector K2_GetMortarSocketLocationInBoneSpace(FName Bone, FName Socket);                                                 // [0x17b87c0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacterBodyAnimInstance.K2_GetMortarSocketLocation
	FVector K2_GetMortarSocketLocation(FName Socket);                                                                        // [0x17b8bd0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacterBodyAnimInstance.K2_GetMortarInclineAlpha
	float K2_GetMortarInclineAlpha();                                                                                        // [0x17b8710] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacterBodyAnimInstance.GetUsableItemAnimationVectorParameter
	FVector GetUsableItemAnimationVectorParameter(int32_t Index);                                                            // [0x17b8e40] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacterBodyAnimInstance.GetUsableItemAnimationFloatParameter
	float GetUsableItemAnimationFloatParameter(int32_t Index);                                                               // [0x17b8d40] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/WTL.WTLCharacterCameraComponent
/// Size: 0x0010 (0x0007C0 - 0x0007D0)
class UWTLCharacterCameraComponent : public UCameraComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x07C0   (0x0010)  MISSED
};

/// Class /Script/WTL.WTLCharacterCustomizationHelper
/// Size: 0x0000 (0x000028 - 0x000028)
class UWTLCharacterCustomizationHelper : public UObject
{ 
public:
};

/// Class /Script/WTL.WTLCharacterDrop
/// Size: 0x0108 (0x000260 - 0x000368)
class AWTLCharacterDrop : public AWTLInteractiveObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0260   (0x0010)  MISSED
	uint64_t                                           m_CharacterID;                                              // 0x0270   (0x0008)  
	uint64_t                                           m_CharacterGroupID;                                         // 0x0278   (0x0008)  
	uint16_t                                           m_CharacterClanID;                                          // 0x0280   (0x0002)  
	EWTLFaction                                        m_CharacterFaction;                                         // 0x0282   (0x0001)  
	unsigned char                                      UnknownData01_5[0x1];                                       // 0x0283   (0x0001)  MISSED
	int32_t                                            m_SlotsCount;                                               // 0x0284   (0x0004)  
	FWTLStorageContent                                 m_StorageContent;                                           // 0x0288   (0x00A8)  
	USceneComponent*                                   m_SceneComponent;                                           // 0x0330   (0x0008)  
	UStaticMeshComponent*                              m_StaticMeshComponent;                                      // 0x0338   (0x0008)  
	bool                                               IsHighLighted;                                              // 0x0340   (0x0001)  
	unsigned char                                      UnknownData02_6[0x27];                                      // 0x0341   (0x0027)  MISSED


	/// Functions
	// Function /Script/WTL.WTLCharacterDrop.OnRep_StorageContent
	void OnRep_StorageContent();                                                                                             // [0x17b94c0] Final|Native|Public  
};

/// Class /Script/WTL.WTLCharacterEffectsSystem
/// Size: 0x0018 (0x000028 - 0x000040)
class UWTLCharacterEffectsSystem : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0028   (0x0018)  MISSED
};

/// Class /Script/WTL.WTLCharacterIdentityComponent
/// Size: 0x07D0 (0x0000B0 - 0x000880)
class UWTLCharacterIdentityComponent : public UActorComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x448];                                     // 0x00B0   (0x0448)  MISSED
	TMap<AActor*, FWTLIdentificationMemoryElement>     m_IdentificationMemory;                                     // 0x04F8   (0x0050)  
	TArray<FWTLMarkerMemoryElement>                    m_MarkersMemory;                                            // 0x0548   (0x0010)  
	UFont*                                             m_Font;                                                     // 0x0558   (0x0008)  
	UTexture2D*                                        m_IdentificationIconsAtlas;                                 // 0x0560   (0x0008)  
	UTexture2D*                                        m_IdentificationAIIconsAtlas;                               // 0x0568   (0x0008)  
	UTexture2D*                                        m_HealthbarSliceTexture;                                    // 0x0570   (0x0008)  
	UTexture2D*                                        m_BorderTexture;                                            // 0x0578   (0x0008)  
	UTexture2D*                                        m_MobileResurrectionPointIconTexture;                       // 0x0580   (0x0008)  
	UTexture2D*                                        m_MobileHealPointIconTexture;                               // 0x0588   (0x0008)  
	UTexture2D*                                        m_ElectronicBaitTexture;                                    // 0x0590   (0x0008)  
	UTexture2D*                                        m_FortificationSafeZoneJammerTexture;                       // 0x0598   (0x0008)  
	UTexture2D*                                        m_ConfederationIconTexture;                                 // 0x05A0   (0x0008)  
	UTexture2D*                                        m_BlackSunsetIconTexture;                                   // 0x05A8   (0x0008)  
	UTexture2D*                                        m_PVPEnabledIconTexture;                                    // 0x05B0   (0x0008)  
	UTexture2D*                                        m_FounderIconTexture;                                       // 0x05B8   (0x0008)  
	UTexture2D*                                        m_DroneIconTexture;                                         // 0x05C0   (0x0008)  
	UTexture2D*                                        m_MortarIconTexture;                                        // 0x05C8   (0x0008)  
	UTexture2D*                                        m_ConfederationHealthbarLogo;                               // 0x05D0   (0x0008)  
	UTexture2D*                                        m_BlackSunsetHealthbarLogo;                                 // 0x05D8   (0x0008)  
	UTexture2D*                                        m_HealthbarOnlyBackground;                                  // 0x05E0   (0x0008)  
	UTexture2D*                                        m_ClanMembersSimplifiedIcon;                                // 0x05E8   (0x0008)  
	UTexture2D*                                        m_ClanCommanderSimplifiedIcon;                              // 0x05F0   (0x0008)  
	TMap<EWTLCharacterClass, FCanvasIcon>              m_CharacterClassIcons;                                      // 0x05F8   (0x0050)  
	TMap<EWTLPlayerType, FCanvasIcon>                  m_CharacterStaffIcons;                                      // 0x0648   (0x0050)  
	TMap<EWTLCharacterEffectType, FCanvasIcon>         m_CharacterEffectIcons;                                     // 0x0698   (0x0050)  
	unsigned char                                      UnknownData01_5[0x58];                                      // 0x06E8   (0x0058)  MISSED
	UCurveFloat*                                       MemoryAlphaColorCurve;                                      // 0x0740   (0x0008)  
	FLinearColor                                       FriendTextColor;                                            // 0x0748   (0x0010)  
	FLinearColor                                       NeutralTextColor;                                           // 0x0758   (0x0010)  
	FLinearColor                                       EnemyTextColor;                                             // 0x0768   (0x0010)  
	FLinearColor                                       AgressorTextColor;                                          // 0x0778   (0x0010)  
	FLinearColor                                       FriendClanTextColor;                                        // 0x0788   (0x0010)  
	FLinearColor                                       NeutralClanTextColor;                                       // 0x0798   (0x0010)  
	FLinearColor                                       EnemyClanTextColor;                                         // 0x07A8   (0x0010)  
	FLinearColor                                       GroupMemberNameColor;                                       // 0x07B8   (0x0010)  
	FLinearColor                                       ClanMemberNameColor;                                        // 0x07C8   (0x0010)  
	UCurveLinearColor*                                 ReputationColorCurve;                                       // 0x07D8   (0x0008)  
	FLinearColor                                       IconTradeForExperienceColor;                                // 0x07E0   (0x0010)  
	FColor                                             MonsterDangerLevelColorNone;                                // 0x07F0   (0x0004)  
	FColor                                             MonsterDangerLevelColorLow;                                 // 0x07F4   (0x0004)  
	FColor                                             MonsterDangerLevelColorBelowNormal;                         // 0x07F8   (0x0004)  
	FColor                                             MonsterDangerLevelColorNormal;                              // 0x07FC   (0x0004)  
	FColor                                             MonsterDangerLevelColorAboveNormal;                         // 0x0800   (0x0004)  
	FColor                                             MonsterDangerLevelColorHigh;                                // 0x0804   (0x0004)  
	FColor                                             MonsterDangerLevelColorCritical;                            // 0x0808   (0x0004)  
	float                                              IdentityConeCheckInterval;                                  // 0x080C   (0x0004)  
	float                                              DistanceDependentIdentityWidgetOffset;                      // 0x0810   (0x0004)  
	float                                              IdentificationWidgetMinimumScale;                           // 0x0814   (0x0004)  
	float                                              IdentificationWidgetMaximumScale;                           // 0x0818   (0x0004)  
	float                                              IdentificationVerticalScreenPositionTreshold;               // 0x081C   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0820   (0x0004)  MISSED
	float                                              IdentityGainPerSec;                                         // 0x0824   (0x0004)  
	float                                              IdentityCooldownPerSec;                                     // 0x0828   (0x0004)  
	float                                              IdentityLimit;                                              // 0x082C   (0x0004)  
	float                                              IdentityLevelToSpot;                                        // 0x0830   (0x0004)  
	float                                              FarScreenRadiusStart;                                       // 0x0834   (0x0004)  
	float                                              FarScreenRadiusEnd;                                         // 0x0838   (0x0004)  
	bool                                               bIsDebugEnabled;                                            // 0x083C   (0x0001)  
	bool                                               bIsIdentityEnabled;                                         // 0x083D   (0x0001)  
	bool                                               bIsPlayersIdentityEnabled;                                  // 0x083E   (0x0001)  
	bool                                               bIsMonstersIdentityEnabled;                                 // 0x083F   (0x0001)  
	bool                                               bIsLevelObjectsIdentityEnabled;                             // 0x0840   (0x0001)  
	bool                                               bIsNPCIdentityEnabled;                                      // 0x0841   (0x0001)  
	bool                                               bIsEnemyNPCIdentityEnabled;                                 // 0x0842   (0x0001)  
	unsigned char                                      UnknownData03_5[0x1];                                       // 0x0843   (0x0001)  MISSED
	float                                              IdentityDistance;                                           // 0x0844   (0x0004)  
	float                                              FOVConeRadiusDivider;                                       // 0x0848   (0x0004)  
	float                                              IdentificationScaleup;                                      // 0x084C   (0x0004)  
	EWTLSimplifiedIdentificationType                   SimplifiedIdentificationType;                               // 0x0850   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x0851   (0x0003)  MISSED
	float                                              IdentificationTransparency;                                 // 0x0854   (0x0004)  
	TWeakObjectPtr<UCurveFloat*>                       IdentificationOverheadOffsetByDistanceCurve;                // 0x0858   (0x0028)  
};

/// Class /Script/WTL.WTLCharacterMovementComponent
/// Size: 0x0070 (0x000B00 - 0x000B70)
class UWTLCharacterMovementComponent : public UCharacterMovementComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x48];                                      // 0x0B00   (0x0048)  MISSED
	float                                              CrouchingSpeed;                                             // 0x0B48   (0x0004)  
	float                                              TiltAngle;                                                  // 0x0B4C   (0x0004)  
	float                                              TiltSpeed;                                                  // 0x0B50   (0x0004)  
	float                                              LadderClimbingSpeed;                                        // 0x0B54   (0x0004)  
	float                                              LadderClimbingFriction;                                     // 0x0B58   (0x0004)  
	float                                              LadderMovementFloorTraceDistance;                           // 0x0B5C   (0x0004)  
	float                                              PronedHalfHeight;                                           // 0x0B60   (0x0004)  
	float                                              SwimmedHalfHeight;                                          // 0x0B64   (0x0004)  
	bool                                               bTransportMovementMode;                                     // 0x0B68:0 (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0B69   (0x0007)  MISSED


	/// Functions
	// Function /Script/WTL.WTLCharacterMovementComponent.Server_SetLadderClimbing
	void Server_SetLadderClimbing(bool Value);                                                                               // [0x17ba560] Net|NetReliableNative|Event|Public|NetServer|NetValidate 
	// Function /Script/WTL.WTLCharacterMovementComponent.NetMulticast_PlayLadderMontage
	void NetMulticast_PlayLadderMontage(AWTLLadder* Ladder, EWTLLadderMontageType LadderMontageType);                        // [0x17ba400] Net|NetReliableNative|Event|NetMulticast|Public 
};

/// Class /Script/WTL.WTLCharacterPreview
/// Size: 0x03F0 (0x000220 - 0x000610)
class AWTLCharacterPreview : public AActor
{ 
public:
	USkeletalMeshComponent*                            Base;                                                       // 0x0220   (0x0008)  
	USkeletalMeshComponent*                            TorsoSlot;                                                  // 0x0228   (0x0008)  
	USkeletalMeshComponent*                            Head;                                                       // 0x0230   (0x0008)  
	USkeletalMeshComponent*                            HeadSlot;                                                   // 0x0238   (0x0008)  
	USkeletalMeshComponent*                            Legs;                                                       // 0x0240   (0x0008)  
	USkeletalMeshComponent*                            LegsSlot;                                                   // 0x0248   (0x0008)  
	USkeletalMeshComponent*                            Feet;                                                       // 0x0250   (0x0008)  
	USkeletalMeshComponent*                            FeetSlot;                                                   // 0x0258   (0x0008)  
	USkeletalMeshComponent*                            BackpackSlot;                                               // 0x0260   (0x0008)  
	USkeletalMeshComponent*                            GlassesSlot;                                                // 0x0268   (0x0008)  
	USkeletalMeshComponent*                            EquipmentSlot1;                                             // 0x0270   (0x0008)  
	USkeletalMeshComponent*                            EquipmentSlot2;                                             // 0x0278   (0x0008)  
	USkeletalMeshComponent*                            EquipmentSlot3;                                             // 0x0280   (0x0008)  
	USkeletalMeshComponent*                            EquipmentSlot4;                                             // 0x0288   (0x0008)  
	USkeletalMeshComponent*                            WatchesSlot;                                                // 0x0290   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponSlot0;                                        // 0x0298   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponSlot0MuzzleMount;                             // 0x02A0   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponSlot0MuzzleAttachment;                        // 0x02A8   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponSlot0FlashlightMount;                         // 0x02B0   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponSlot0FlashlightAttachment;                    // 0x02B8   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponSlot0ScopeMount;                              // 0x02C0   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponSlot0ScopeAttachment;                         // 0x02C8   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponSlot1;                                        // 0x02D0   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponSlot1MuzzleMount;                             // 0x02D8   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponSlot1MuzzleAttachment;                        // 0x02E0   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponSlot1FlashlightMount;                         // 0x02E8   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponSlot1FlashlightAttachment;                    // 0x02F0   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponSlot1ScopeMount;                              // 0x02F8   (0x0008)  
	UStaticMeshComponent*                              EquippedWeaponSlot1ScopeAttachment;                         // 0x0300   (0x0008)  
	UStaticMeshComponent*                              EquippedStuffSlot1;                                         // 0x0308   (0x0008)  
	UStaticMeshComponent*                              HolsterSlot;                                                // 0x0310   (0x0008)  
	UStaticMeshComponent*                              EquippedPistolPreviewSlot;                                  // 0x0318   (0x0008)  
	UStaticMeshComponent*                              SheathSlot;                                                 // 0x0320   (0x0008)  
	UStaticMeshComponent*                              SheathPreviewSlot;                                          // 0x0328   (0x0008)  
	UStaticMeshComponent*                              ItemInHands;                                                // 0x0330   (0x0008)  
	UStaticMeshComponent*                              ItemInHandsMuzzleMount;                                     // 0x0338   (0x0008)  
	UStaticMeshComponent*                              ItemInHandsMuzzleAttachmeht;                                // 0x0340   (0x0008)  
	UStaticMeshComponent*                              ItemInHandsFlashlightMount;                                 // 0x0348   (0x0008)  
	UStaticMeshComponent*                              ItemInHandsFlashlightAttachment;                            // 0x0350   (0x0008)  
	UStaticMeshComponent*                              ItemInHandsScopeMount;                                      // 0x0358   (0x0008)  
	UStaticMeshComponent*                              ItemInHandsScopeAttachment;                                 // 0x0360   (0x0008)  
	TWeakObjectPtr<USkeletalMesh*>                     MaleTorsoMeshFullArms;                                      // 0x0368   (0x0028)  
	TWeakObjectPtr<USkeletalMesh*>                     MaleTorsoMeshHalfArms;                                      // 0x0390   (0x0028)  
	TWeakObjectPtr<USkeletalMesh*>                     MaleTorsoMeshHandsOnly;                                     // 0x03B8   (0x0028)  
	TWeakObjectPtr<USkeletalMesh*>                     FemaleTorsoMeshFullArms;                                    // 0x03E0   (0x0028)  
	TWeakObjectPtr<USkeletalMesh*>                     FemaleTorsoMeshHalfArms;                                    // 0x0408   (0x0028)  
	TWeakObjectPtr<USkeletalMesh*>                     FemaleTorsoMeshHandsOnly;                                   // 0x0430   (0x0028)  
	AWTLCharacterPreviewRoom*                          m_CharacterPreviewRoom;                                     // 0x0458   (0x0008)  
	unsigned char                                      UnknownData00_6[0x1B0];                                     // 0x0460   (0x01B0)  MISSED


	/// Functions
	// Function /Script/WTL.WTLCharacterPreview.UpdateFromStore
	void UpdateFromStore(AWTLCharacter* Character, FWTLShortCharacterInfo& ShortCharacterInfo, EWTLItemType ArmsItemType, int32_t ArmsItemTypeID, char CustomizationScalar, char CustomizationColor, int32_t MuzzleAttachmentTypeID, int32_t FlashlightAttachmentTypeID, int32_t ScopeAttachmentTypeID); // [0x17ba880] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/WTL.WTLCharacterPreview.UpdateFromShortCharacterInfo
	void UpdateFromShortCharacterInfo(FWTLShortCharacterInfo& ShortCharacterInfo);                                           // [0x17bae00] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/WTL.WTLCharacterPreview.UpdateFromCharacter
	void UpdateFromCharacter(AWTLCharacter* Character);                                                                      // [0x17baf00] Final|Native|Public|BlueprintCallable 
	// Function /Script/WTL.WTLCharacterPreview.SetCharacterPreviewType
	void SetCharacterPreviewType(EWTLCharacterPreviewType PreviewType);                                                      // [0x17bafe0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/WTL.WTLCharacterPreviewAnimInstance
/// Size: 0x0090 (0x0002C0 - 0x000350)
class UWTLCharacterPreviewAnimInstance : public UAnimInstance
{ 
public:
	UAnimSequence*                                     SnuggleAnimation;                                           // 0x02B8   (0x0008)  
	UAnimSequence*                                     IdleAnimation;                                              // 0x02C0   (0x0008)  
	FVector                                            ScaleFeetVector;                                            // 0x02C8   (0x000C)  
	FVector                                            InvertScaleFeetVector;                                      // 0x02D4   (0x000C)  
	FVector                                            ScaleHandsVector;                                           // 0x02E0   (0x000C)  
	FVector                                            InvertScaleHandsVector;                                     // 0x02EC   (0x000C)  
	FVector                                            ScaleHeadVector;                                            // 0x02F8   (0x000C)  
	FVector                                            ScaleNeckVector;                                            // 0x0304   (0x000C)  
	FVector                                            InvertScaleRibCageVector;                                   // 0x0310   (0x000C)  
	FVector                                            ScaleRibCageVector;                                         // 0x031C   (0x000C)  
	float                                              FScaleHands;                                                // 0x0328   (0x0004)  
	float                                              FScaleRibCage;                                              // 0x032C   (0x0004)  
	float                                              FScaleFeet;                                                 // 0x0330   (0x0004)  
	float                                              FScaleHead;                                                 // 0x0334   (0x0004)  
	float                                              FScaleNeck;                                                 // 0x0338   (0x0004)  
	bool                                               bIsWeaponInHands;                                           // 0x033C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x033D   (0x0003)  MISSED
	FVector                                            IKHandParameter;                                            // 0x0340   (0x000C)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x034C   (0x0004)  MISSED


	/// Functions
	// Function /Script/WTL.WTLCharacterPreviewAnimInstance.UpdateComplexity
	void UpdateComplexity(char BodyType);                                                                                    // [0x17bb1e0] Native|Event|Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Script/WTL.WTLCharacterPreviewRoom
/// Size: 0x0048 (0x000220 - 0x000268)
class AWTLCharacterPreviewRoom : public AActor
{ 
public:
	USceneComponent*                                   Root;                                                       // 0x0220   (0x0008)  
	USceneCaptureComponent2D*                          CaptureComponent;                                           // 0x0228   (0x0008)  
	UChildActorComponent*                              CharacterPreview;                                           // 0x0230   (0x0008)  
	unsigned char                                      UnknownData00_5[0x14];                                      // 0x0238   (0x0014)  MISSED
	FVector                                            CharacterFaceCaptureComponentLocation;                      // 0x024C   (0x000C)  
	FVector                                            CharacterFaceWhenItemInHandsCaptureComponentLocation;       // 0x0258   (0x000C)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0264   (0x0004)  MISSED


	/// Functions
	// Function /Script/WTL.WTLCharacterPreviewRoom.GetCharacterPreview
	AWTLCharacterPreview* GetCharacterPreview();                                                                             // [0x17bb480] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/WTL.WTLCharacterTransportBase
/// Size: 0x0050 (0x0004C0 - 0x000510)
class AWTLCharacterTransportBase : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_2[0x38];                                      // 0x04C0   (0x0038)  MISSED
	TArray<TEnumAsByte>                                CollisionObjectTypes;                                       // 0x04F8   (0x0010)  
	float                                              SpeedRotation;                                              // 0x0508   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x050C   (0x0004)  MISSED


	/// Functions
	// Function /Script/WTL.WTLCharacterTransportBase.K2_Use
	void K2_Use(AWTLCharacter* Character);                                                                                   // [0xf3f2f0] Native|Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLCharacterTransportBase.K2_SetHighlightState
	void K2_SetHighlightState(bool Value);                                                                                   // [0x17bb7f0] Native|Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLCharacterTransportBase.K2_GetDisplayText
	FString K2_GetDisplayText(AWTLCharacter* Character);                                                                     // [0x17bb6c0] Native|Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLCharacterTransportBase.K2_CanBeUsed
	bool K2_CanBeUsed(AWTLCharacter* Character);                                                                             // [0x17bb8d0] Native|Event|Public|BlueprintEvent 
	// Function /Script/WTL.WTLCharacterTransportBase.IsUses
	bool IsUses();                                                                                                           // [0x17bb650] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacterTransportBase.GetMyController
	AWTLPlayerController* GetMyController();                                                                                 // [0x17bb680] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/WTL.WTLCharacterTransportBase.GetMyCharacter
	AWTLCharacter* GetMyCharacter();                                                                                         // [0x17bb6a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/WTL.WTLCharacterWatchAnimInstance
/// Size: 0x0010 (0x0002C0 - 0x0002D0)
class UWTLCharacterWatchAnimInstance : public UAnimInstance
{ 
public:
	float                                              HourHandAngle;                                              // 0x02C0   (0x0004)  
	float                                              MinuteHandAngle;                                            // 0x02C4   (0x0004)  
	float                                              SecondHandAngle;                                            // 0x02C8   (0x0004)  
	int32_t                                            Complexion;                                                 // 0x02CC   (0x0004)  
};

/// Class /Script/WTL.WTLChargeablePlaceableStuff
/// Size: 0x0028 (0x000398 - 0x0003C0)
class AWTLChargeablePlaceableStuff : public AWTLPlaceableStuff
{ 
public:
	unsigned char                                      UnknownData00_2[0x1C];                                      // 0x0398   (0x001C)  MISSED
	float                                              ChargeRange;                                                // 0x03B4   (0x0004)  
	float                                              EnergyChargePerSecond;                                      // 0x03B8   (0x0004)  
	float                                              m_Energy;                                                   // 0x03BC   (0x0004)  


	/// Functions
	// Function /Script/WTL.WTLChargeablePlaceableStuff.OnRep_Energy
	void OnRep_Energy();                                                                                                     // [0x17bbd00] Native|Protected     
	// Function /Script/WTL.WTLChargeablePlaceableStuff.BPGetEnergy
	float BPGetEnergy();                                                                                                     // [0x17bbce0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/WTL.WTLChargeablePlaceableStuff.BPGetCondition
