#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x1F8 - 0x1F8)
// Class WTL.EQSTest_AwayFromAllPawns
class UEQSTest_AwayFromAllPawns : public UEnvQueryTest
{
public:

	static class UClass* StaticClass();
	static class UEQSTest_AwayFromAllPawns* GetDefaultObj();

};

// 0x8 (0x200 - 0x1F8)
// Class WTL.EQSTest_IsAlive
class UEQSTest_IsAlive : public UEnvQueryTest
{
public:
	bool                                         IsAITargetInterface;                               // 0x1F8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_99E[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UEQSTest_IsAlive* GetDefaultObj();

};

// 0x0 (0x1F8 - 0x1F8)
// Class WTL.EQSTest_IsOnTheGround
class UEQSTest_IsOnTheGround : public UEnvQueryTest
{
public:

	static class UClass* StaticClass();
	static class UEQSTest_IsOnTheGround* GetDefaultObj();

};

// 0x0 (0x1F8 - 0x1F8)
// Class WTL.EQSTest_PointBehindTheEnemy
class UEQSTest_PointBehindTheEnemy : public UEnvQueryTest
{
public:

	static class UClass* StaticClass();
	static class UEQSTest_PointBehindTheEnemy* GetDefaultObj();

};

// 0xE0 (0x2D8 - 0x1F8)
// Class WTL.EQSTest_TraceChannel
class UEQSTest_TraceChannel : public UEnvQueryTest
{
public:
	struct FEnvTraceData                         TraceData;                                         // 0x1F8(0x30)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAIDataProviderBoolValue              TraceFromContext;                                  // 0x228(0x38)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue             ItemHeightOffset;                                  // 0x260(0x38)(Edit, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue             ContextHeightOffset;                               // 0x298(0x38)(Edit, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)
	TSubclassOf<class UEnvQueryContext>          Context;                                           // 0x2D0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UEQSTest_TraceChannel* GetDefaultObj();

};

// 0x0 (0x1F8 - 0x1F8)
// Class WTL.EQSTest_VisibilityCone
class UEQSTest_VisibilityCone : public UEnvQueryTest
{
public:

	static class UClass* StaticClass();
	static class UEQSTest_VisibilityCone* GetDefaultObj();

};

// 0x38 (0x298 - 0x260)
// Class WTL.WTL3DActorHealth
class UWTL3DActorHealth : public UUserWidget
{
public:
	class UProgressBar*                          PbActorHealth;                                     // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                          HealthBarFillNormalColor;                          // 0x268(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          HealthBarFillWarningColor;                         // 0x278(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          HealthBarFillDangerColor;                          // 0x288(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTL3DActorHealth* GetDefaultObj();

	void SetActorHealth(float CurrentHealth, float MaxHealth);
};

// 0x10 (0x270 - 0x260)
// Class WTL.WTL3DActorName
class UWTL3DActorName : public UUserWidget
{
public:
	class UTextBlock*                            TbActorName;                                       // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_9CA[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTL3DActorName* GetDefaultObj();

	void SetActorNameText(const class FString& ActorName);
};

// 0x8 (0x268 - 0x260)
// Class WTL.WTL3DMobileStartPointParameters
class UWTL3DMobileStartPointParameters : public UUserWidget
{
public:
	class UProgressBar*                          PbPoint;                                           // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UWTL3DMobileStartPointParameters* GetDefaultObj();

};

// 0x18 (0x288 - 0x270)
// Class WTL.WTL3DMonsterIdentity
class UWTL3DMonsterIdentity : public UWTL3DActorName
{
public:
	class UImage*                                ImgIndicator;                                      // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProgressBar*                          PbHealth;                                          // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                            TbLevel;                                           // 0x280(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTL3DMonsterIdentity* GetDefaultObj();

};

// 0x0 (0x270 - 0x270)
// Class WTL.WTL3DMonsterName
class UWTL3DMonsterName : public UWTL3DActorName
{
public:

	static class UClass* StaticClass();
	static class UWTL3DMonsterName* GetDefaultObj();

	void SetMonsterLevelText(int32 MonsterLevel);
};

// 0x28 (0x298 - 0x270)
// Class WTL.WTL3DPlayerIdentity
class UWTL3DPlayerIdentity : public UWTL3DActorName
{
public:
	uint8                                        Pad_9E9[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                ImgTeamLead;                                       // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProgressBar*                          PbHealth;                                          // 0x280(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                            TbLevel;                                           // 0x288(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBorder*                               bHealth;                                           // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTL3DPlayerIdentity* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class WTL.WTLAchievementSystem
class UWTLAchievementSystem : public UObject
{
public:
	uint8                                        Pad_A13[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLAchievementSystem* GetDefaultObj();

};

// 0x30 (0x250 - 0x220)
// Class WTL.WTLActionGameplayActivity
class AWTLActionGameplayActivity : public AActor
{
public:
	uint8                                        Pad_A16[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class AActor>                  ItemPreview;                                       // 0x228(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AWTLActionGameplayActivity* GetDefaultObj();

};

// 0x50 (0x270 - 0x220)
// Class WTL.WTLFortificationObject
class AWTLFortificationObject : public AActor
{
public:
	uint8                                        Pad_A18[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ID;                                                // 0x240(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EWTLFortificationObjectType       Type;                                              // 0x244(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        SlotCount;                                         // 0x245(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         NeedSaveState;                                     // 0x246(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A29[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SaveInterval;                                      // 0x248(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A2A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint64                                       CharacterID;                                       // 0x250(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint64                                       CharacterGroupID;                                  // 0x258(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint16                                       CharacterClanID;                                   // 0x260(0x2)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EWTLFaction                       Faction;                                           // 0x262(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A2B[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Condition;                                         // 0x264(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        Energy;                                            // 0x268(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A2C[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLFortificationObject* GetDefaultObj();

};

// 0x190 (0x400 - 0x270)
// Class WTL.WTLActionGameplayMachinegun
class AWTLActionGameplayMachinegun : public AWTLFortificationObject
{
public:
	uint8                                        Pad_A3F[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWTLStorageContent                    M_StorageContent;                                  // 0x280(0xA8)(Net, RepNotify, NativeAccessSpecifierPrivate)
	struct FRotator                              MachinegunRotation;                                // 0x328(0xC)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A41[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMeshComponent*                  StandMesh;                                         // 0x338(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                Mesh;                                              // 0x340(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFMODAudioComponent*                   ShootAudioComponent;                               // 0x348(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  MachinegunName;                                    // 0x350(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPrivate)
	int32                                        WeaponID;                                          // 0x368(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        FireRate;                                          // 0x36C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        TemperatureIncreasingPerShot;                      // 0x370(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        OverheatTemperature;                               // 0x374(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        TemperatureToStartFire;                            // 0x378(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        TemperatureCooldownPerSecond;                      // 0x37C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        OverheatAccuracy;                                  // 0x380(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        RotationSpeed;                                     // 0x384(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        MaxAmmoWeight;                                     // 0x388(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FWTLCameraLimits                      CameraLimits;                                      // 0x38C(0xC)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A43[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AWTLCharacter*                         M_CurrentCharacter;                                // 0x3A8(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A44[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_CurrentTemperatureOverheat;                      // 0x3C0(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_bIsCoolingDown;                                  // 0x3C4(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A45[0x13];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsInUse;                                          // 0x3D8(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsInAction;                                       // 0x3D9(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A46[0x26];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLActionGameplayMachinegun* GetDefaultObj();

	void SetEnabled(bool Value);
	void OnUse();
	void OnStorageCheck();
	void OnRep_StorageContent();
	void OnRep_MachinegunRortation();
	void OnRep_IsInUse();
	void OnRep_bIsAction();
	void OnLocalClientAcion();
	void OnClientUsageStop();
	void OnClientUsageStart();
	float GetPauseBetweenShots();
	float GetOverheatSafeTemperature();
	float GetOverheatPercent();
	class USkeletalMeshComponent* GetMesh();
	bool GetIsInAction();
	bool GetIsCoolingDown();
	class AWTLCharacter* GetCurrentCharacter();
	void FillAmmo(int32 AmmoID, int32 Count);
};

// 0x0 (0x28 - 0x28)
// Class WTL.WTLActionGameplayObjectInterface
class IWTLActionGameplayObjectInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IWTLActionGameplayObjectInterface* GetDefaultObj();

	void SelectPreviousSlot(class AWTLCharacter* Character);
	void SelectNextSlot(class AWTLCharacter* Character);
	void OnCharacterStartActionWithGameplayObject(class AWTLCharacter* Character);
	void OnCharacterFinishActionWithGameplayObject(class AWTLCharacter* Character);
	void MainUseStart(class AWTLCharacter* Character);
	float GetDesiredFOV();
	bool CanStopAction();
	bool CanStartActionWithItemInHands(class AWTLUsable* ItemInHands);
	bool CanStartActionRightNow();
	bool CanDrawDotPointer();
	bool CanChangeItemInArmsWhenActionInProgress();
};

// 0x10 (0x230 - 0x220)
// Class WTL.WTLAnomaly
class AWTLAnomaly : public AActor
{
public:
	uint8                                        Pad_B46[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         CharacterCanUseVehicleInside;                      // 0x228(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_B47[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLAnomaly* GetDefaultObj();

	void TeleportCharacterToRandomPointInRange(class AWTLCharacter* Character, float MinRange, float MaxRange, enum class EWTLAnomalyActionResult* Result);
	void TeleportCharacterToRandomPointArray(class AWTLCharacter* Character, const TArray<struct FVector>& Locations, enum class EWTLAnomalyActionResult* Result);
	void TeleportCharacterToPoint(class AWTLCharacter* Character, const struct FVector& Location, enum class EWTLAnomalyActionResult* Result);
	void OnEMPGrenadeExplosion();
	void IsCharacterHoldingBreath(class AWTLCharacter* Character, enum class EWTLAnomalyCheckResult* Result);
	void ApplyRadialDamage(float DamageValue, const struct FVector& DamageOrigin, float DamageRadius, TSubclassOf<class UDamageType> DamageTypeClass, enum class EWTLAnomalyActionResult* Result);
	void AddEffectToCharacterWithFalloff(class AWTLCharacter* Character, enum class EWTLCharacterEffectType EffectType, float EffectValue, const struct FVector& Origin, float FalloffRadius, float MinEffectValue, enum class EWTLAnomalyActionResult* Result);
	void AddEffectToCharactersWithFalloff(const TArray<class AWTLCharacter*>& Characters, enum class EWTLCharacterEffectType EffectType, float EffectValue, const struct FVector& Origin, float FalloffRadius, float MinEffectValue, enum class EWTLAnomalyActionResult* Result);
	void AddEffectToCharacters(const TArray<class AWTLCharacter*>& Characters, enum class EWTLCharacterEffectType EffectType, float EffectValue, enum class EWTLAnomalyActionResult* Result);
	void AddEffectToCharacter(class AWTLCharacter* Character, enum class EWTLCharacterEffectType EffectType, float EffectValue, enum class EWTLAnomalyActionResult* Result);
};

// 0x30 (0x260 - 0x230)
// Class WTL.WTLStaticAnomaly
class AWTLStaticAnomaly : public AWTLAnomaly
{
public:
	uint8                                        Pad_BB0[0x28];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMeshComponent*                  ActivationVolume;                                  // 0x258(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AWTLStaticAnomaly* GetDefaultObj();

	void OnThrowingDeviceProjectileEnter(class AWTLThrowingDeviceProjectile* ThrowingDeviceProjectile);
	void OnNutLeave(class AWTLNut* Nut);
	void OnNutEnter(class AWTLNut* Nut);
	void OnMonsterLeave(class AWTLMonsterPawn* Monster);
	void OnMonsterEnter(class AWTLMonsterPawn* Monster);
	void OnEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnCharacterLeave(class AWTLCharacter* Character);
	void OnCharacterEnter(class AWTLCharacter* Character);
	void OnBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	TArray<class AWTLMonsterPawn*> GetMonstersInVolume();
	TArray<class AWTLCharacter*> GetCharactersInVolume();
};

// 0x38 (0x298 - 0x260)
// Class WTL.WTLActivatableAnomaly
class AWTLActivatableAnomaly : public AWTLStaticAnomaly
{
public:
	uint8                                        Pad_BE2[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinEnergy;                                         // 0x270(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxEnergy;                                         // 0x274(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EnergyPerSecond;                                   // 0x278(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Energy;                                            // 0x27C(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLActivatableAnomalyState       State;                                             // 0x280(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_BE6[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EnergyToActivate;                                  // 0x284(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActivationDelay;                                   // 0x288(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StayActivatedTime;                                 // 0x28C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EnergyDecrementAfterActivation;                    // 0x290(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_BE8[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLActivatableAnomaly* GetDefaultObj();

	void ServerOnActivated();
	void OnRep_State();
	void OnRep_Energy();
	void OnEnergyChanged(float EnergyValue);
	void ClientOnBeginActivate();
	void ClientOnActivated();
};

// 0x98 (0x2C8 - 0x230)
// Class WTL.WTLMovingAnomaly
class AWTLMovingAnomaly : public AWTLAnomaly
{
public:
	uint8                                        Pad_C7D[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector>                       WayPoints;                                         // 0x270(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class AWTLAnomalyWayPoint*                   StartWayPoint;                                     // 0x280(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EWTLWayPointMovingType            MovingType;                                        // 0x288(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C81[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinSpeed;                                          // 0x28C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxSpeed;                                          // 0x290(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PositionSynchronizationInterval;                   // 0x294(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C82[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector_NetQuantize                   M_CurrentWayPointPosition;                         // 0x2A0(0xC)(Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        M_CurrentSpeed;                                    // 0x2AC(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               M_SynchronizationPosition;                         // 0x2B0(0xC)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C8E[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMeshComponent*                  ActivationVolume;                                  // 0x2C0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AWTLMovingAnomaly* GetDefaultObj();

	void OnRep_SynchronizationPosition();
	void OnNutLeave(class AWTLNut* Nut);
	void OnNutEnter(class AWTLNut* Nut);
	void OnNPCLeave(class AWTLEnemyNPC* NPC);
	void OnNPCEnter(class AWTLEnemyNPC* NPC);
	void OnMonsterLeave(class AWTLMonsterPawn* Monster);
	void OnMonsterEnter(class AWTLMonsterPawn* Monster);
	void OnEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnCharacterLeave(class AWTLCharacter* Character);
	void OnCharacterEnter(class AWTLCharacter* Character);
	void OnBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	TArray<class AWTLEnemyNPC*> GetNPCInVolume();
	TArray<class AWTLMonsterPawn*> GetMonstersInVolume();
	TArray<class AWTLCharacter*> GetCharactersInVolume();
	TArray<class AActor*> GetActorsInVolume();
};

// 0x38 (0x300 - 0x2C8)
// Class WTL.WTLActivatableMovingAnomaly
class AWTLActivatableMovingAnomaly : public AWTLMovingAnomaly
{
public:
	uint8                                        Pad_CA6[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinEnergy;                                         // 0x2D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxEnergy;                                         // 0x2DC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EnergyPerSecond;                                   // 0x2E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Energy;                                            // 0x2E4(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLActivatableAnomalyState       State;                                             // 0x2E8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_CA7[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EnergyToActivate;                                  // 0x2EC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActivationDelay;                                   // 0x2F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StayActivatedTime;                                 // 0x2F4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EnergyDecrementAfterActivation;                    // 0x2F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_CA9[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLActivatableMovingAnomaly* GetDefaultObj();

	void ServerOnActivated();
	void OnRep_State();
	void OnRep_Energy();
	void OnEnergyChanged(float EnergyValue);
	void ClientOnBeginActivate();
	void ClientOnActivated();
};

// 0x20 (0x240 - 0x220)
// Class WTL.WTLActivatableObject
class AWTLActivatableObject : public AActor
{
public:
	uint8                                        Pad_CE3[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PostActivationCooldown;                            // 0x238(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ActivationDelay;                                   // 0x23C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AWTLActivatableObject* GetDefaultObj();

	void BP_NotifyActivationStarted(class AWTLCharacter* Activator);
	void BP_DeactivateObject(class AWTLCharacter* Activator);
	bool BP_CanBeActivated();
	void BP_ActivateObject(class AWTLCharacter* Activator);
};

// 0x0 (0x28 - 0x28)
// Class WTL.WTLActivatableObjectInterface
class IWTLActivatableObjectInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IWTLActivatableObjectInterface* GetDefaultObj();

};

// 0x28 (0x280 - 0x258)
// Class WTL.WTLActivatorVolume
class AWTLActivatorVolume : public AVolume
{
public:
	TArray<class AWTLActivatableObject*>         ObjectsToActivate;                                 // 0x258(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                        CharactersCountToActivate;                         // 0x268(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_D2E[0x14];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLActivatorVolume* GetDefaultObj();

	void OnEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
};

// 0x48 (0x300 - 0x2B8)
// Class WTL.WTLAIAnimInstance
class UWTLAIAnimInstance : public UAnimInstance
{
public:
	uint8                                        Pad_D38[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        VelocitySpeed;                                     // 0x2C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ForwardSpeed;                                      // 0x2C4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RightSpeed;                                        // 0x2C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        UpSpeed;                                           // 0x2CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               Direction;                                         // 0x2D0(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RotationDelta;                                     // 0x2DC(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               VectorDelta;                                       // 0x2E8(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D3A[0xC];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLAIAnimInstance* GetDefaultObj();

};

// 0x4B8 (0x970 - 0x4B8)
// Class WTL.WTLAICharacter
class AWTLAICharacter : public ACharacter
{
public:
	uint8                                        Pad_DE6[0x1E0];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class EWTLWeaponType, float>       WeaponTypeDamageMultipliers;                       // 0x698(0x50)(Edit, NativeAccessSpecifierPublic)
	enum class EPhysicalSurface                  PhysicalSurface;                                   // 0x6E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Level;                                             // 0x6E9(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DE7[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HeadArmor;                                         // 0x6EC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BodyArmor;                                         // 0x6F0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArmsArmor;                                         // 0x6F4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LegsArmor;                                         // 0x6F8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FeetArmor;                                         // 0x6FC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LifespanAfterDeath;                                // 0x700(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsBurst;                                           // 0x704(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        PercentDamageBurst;                                // 0x705(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E09[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TakeDamageBurst;                                   // 0x708(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MinLevelBurst;                                     // 0x70C(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MaxLevelBurst;                                     // 0x70D(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E0B[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWTLStorageContent                    M_PublicStorageContent;                            // 0x710(0xA8)(Net, RepNotify, NativeAccessSpecifierPublic)
	struct FWTLStorageContent                    M_SummaryStorageContent;                           // 0x7B8(0xA8)(NativeAccessSpecifierPublic)
	struct FWTLStorageContent                    M_PrivateStorageContent;                           // 0x860(0xA8)(NativeAccessSpecifierPublic)
	TArray<struct FWTLItemDropInfo>              AdditionalLoot;                                    // 0x908(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        MaxLevel;                                          // 0x918(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E0F[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ExperienceDropCountMultiplierDelta;                // 0x91C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExperienceDropChanceMultiplierDelta;               // 0x920(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        M_MultiplierParameters;                            // 0x924(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               M_LocationDead;                                    // 0x928(0xC)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        M_Health;                                          // 0x934(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_bIsInStealthMode;                                // 0x938(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_E16[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AICharacterID;                                     // 0x93C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        IDIcon;                                            // 0x940(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E17[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UPhysicsAsset*                         MeshPhysicsAsset;                                  // 0x948(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                              OffsetRotationMesh;                                // 0x950(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                        DangerLevel;                                       // 0x95C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        KillZ;                                             // 0x960(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E18[0xC];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLAICharacter* GetDefaultObj();

	void SetStealthMode(bool Value);
	void SetSpawn(class AWTLSpawnAICharacter* Value);
	void SetLifetime(float Delta);
	void SetLifespanAfterDeath(float Value);
	void SetApplyWeaponTypeDamageMultipliers(bool Value);
	void OnRep_StorageContent();
	void OnRep_IsInStealthMode();
	void OnRep_Health();
	void NetMulticast_OnToDeath(struct FVector& DeathPosition, const struct FVector_NetQuantize& ActorRotation, const struct FVector_NetQuantize& MeshRotation, const struct FWTLAICharacterDeathData& DeathData);
	void NetMulticast_OnDeath(struct FVector& DeathPosition, const struct FVector_NetQuantize& ActorRotation, const struct FVector_NetQuantize& MeshRotation, const struct FWTLAICharacterDeathData& DeathData);
	void KillAiCharacter();
	void K2_OnToDeathEvent(struct FVector& DeathPosition, const struct FVector_NetQuantize& ActorRotation, const struct FVector_NetQuantize& MeshRotation, const struct FWTLAICharacterDeathData& DeathData);
	void K2_OnStealthModeChanged(bool Value);
	void K2_OnDeathEvent(const struct FWTLAICharacterDeathData& DeathData);
	void K2_OnBurst(const struct FWTLAICharacterDeathData& DeathData);
	bool IsVisible();
	bool IsApplyWeaponTypeDamageMultipliers();
	bool IsAlive();
	class AWTLSpawnAICharacter* GetSpawn();
	float GetMaxHealth();
	float GetHealth();
	float GetDangerLevel();
	int32 GetAICharacterID();
};

// 0x1F8 (0x520 - 0x328)
// Class WTL.WTLAICharacterController
class AWTLAICharacterController : public AAIController
{
public:
	uint8                                        Pad_EE1[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class ETraceTypeQuery                   CollisionTraceQuery;                               // 0x330(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EE2[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PredictionUpdatePeriod;                            // 0x334(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EE3[0x1E8];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLAICharacterController* GetDefaultObj();

	void OnTouchSenseUpdated(class AActor* StimulusInstigator, const struct FVector& StimulusLocation, bool State);
	void OnTeamSenseUpdated(class AActor* StimulusInstigator, const struct FVector& StimulusLocation, bool State);
	void OnSightSenseUpdated(class AActor* StimulusInstigator, const struct FVector& StimulusLocation, bool State);
	void OnPredictionUpdate();
	void OnPredictionSenseUpdated(class AActor* StimulusInstigator, const struct FVector& StimulusLocation, bool State);
	void OnPerceptionUpdated(TArray<class AActor*>& UpdatedActors);
	void OnHearingSenseUpdated(class AActor* StimulusInstigator, const struct FVector& StimulusLocation, bool State);
	void OnDamageSenseUpdated(class AActor* StimulusInstigator, const struct FVector& StimulusLocation, bool State, float Value);
	void OnActorPerceptionUpdated(class AActor* Actor, const struct FAIStimulus& Stimulus);
	class AWTLAICharacter* GetMyPawn();
};

// 0x20 (0x240 - 0x220)
// Class WTL.WTLAIDestroyObject
class AWTLAIDestroyObject : public AActor
{
public:
	uint8                                        Pad_FD8[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_Condition;                                       // 0x230(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        M_MaxCondition;                                    // 0x234(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_ObjectIsDestroyed;                               // 0x238(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FD9[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ActivationTime;                                    // 0x23C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AWTLAIDestroyObject* GetDefaultObj();

	void OnChangeCondition(float DeltaCondition);
	void BPUse(class AWTLCharacter* Character);
	void BPSetHighlightState(bool Value);
	class FString BPGetDisplayText(class AWTLCharacter* Character);
	bool BPCanBeUsed(class AWTLCharacter* Character);
	bool AIInterface_IsInSafeZone();
	bool AIInterface_IsCanBeAttacked(enum class EWTLFaction InstigatorFaction);
	bool AIInterface_IsAlive();
	struct FVector AIInterface_GetVelocity();
	int32 AIInterface_GetGroupID();
	enum class EWTLFaction AIInterface_GetFaction();
};

// 0x0 (0x970 - 0x970)
// Class WTL.WTLAIFlying
class AWTLAIFlying : public AWTLAICharacter
{
public:

	static class UClass* StaticClass();
	static class AWTLAIFlying* GetDefaultObj();

};

// 0x0 (0x520 - 0x520)
// Class WTL.WTLAIFlyingController
class AWTLAIFlyingController : public AWTLAICharacterController
{
public:

	static class UClass* StaticClass();
	static class AWTLAIFlyingController* GetDefaultObj();

};

// 0x8 (0x4C0 - 0x4B8)
// Class WTL.WTLAIMonsterPawn
class AWTLAIMonsterPawn : public ACharacter
{
public:
	uint8                                        Pad_FDB[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLAIMonsterPawn* GetDefaultObj();

};

// 0x0 (0x190 - 0x190)
// Class WTL.WTLAIPerceptionComponent
class UWTLAIPerceptionComponent : public UAIPerceptionComponent
{
public:

	static class UClass* StaticClass();
	static class UWTLAIPerceptionComponent* GetDefaultObj();

	void SetSightVisionHalfAngle(float Angle);
	void SetSightRadius(float Radius);
	float GetSightRadius();
	float GetSenseHearingRange();
	struct FVector GetSeenLocation(class AActor* Actor);
	struct FVector GetPredictionLocation(class AActor* Actor, float TimeSec);
	bool GetIsSenseEnabled(TSubclassOf<class UAISense> SenseClass);
};

// 0x0 (0x130 - 0x130)
// Class WTL.WTLAIPerceptionSystem
class UWTLAIPerceptionSystem : public UAIPerceptionSystem
{
public:

	static class UClass* StaticClass();
	static class UWTLAIPerceptionSystem* GetDefaultObj();

};

// 0x40 (0x260 - 0x220)
// Class WTL.WTLInteractiveObject
class AWTLInteractiveObject : public AActor
{
public:
	uint8                                        Pad_1030[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  M_LocalizationDisplayText;                         // 0x228(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                M_DisplayText;                                     // 0x240(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActivationTime;                                    // 0x250(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxDistanceToStartUse;                             // 0x254(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          CharacterUsingAnimMontage;                         // 0x258(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AWTLInteractiveObject* GetDefaultObj();

	void BPUse(class AWTLCharacter* Character);
	void BPSetHighlightState(bool Value);
	class FString BPGetDisplayText(class AWTLCharacter* Character);
	bool BPCanBeUsed(class AWTLCharacter* Character);
};

// 0x3D0 (0x630 - 0x260)
// Class WTL.WTLStorageBox
class AWTLStorageBox : public AWTLInteractiveObject
{
public:
	uint8                                        Pad_103C[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMeshComponent*                  Mesh;                                              // 0x268(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_103D[0x170];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWTLStorageContent                    M_PublicStorageContent;                            // 0x3E0(0xA8)(Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FWTLStorageContent                    M_PrivateStorageContent;                           // 0x488(0xA8)(Protected, NativeAccessSpecifierProtected)
	struct FWTLStorageContent                    M_SummaryStorageContent;                           // 0x530(0xA8)(Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_103E[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Name;                                              // 0x5F8(0x18)(Edit, NativeAccessSpecifierPublic)
	uint8                                        SlotsCount;                                        // 0x610(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CanStoreItems;                                     // 0x611(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1040[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FWTLItemSpawnInfo>             SpawnItems;                                        // 0x618(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         CanUseLocationItemsSpawn;                          // 0x628(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1041[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxLocationItemsSpawnQuality;                      // 0x62C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AWTLStorageBox* GetDefaultObj();

	void SetCharacterDropChanceMultiplier(class AWTLCharacter* Character, float Multiplier);
	void OnRep_StorageContent();
	void AllowSpecialLootForCharacter(class AWTLCharacter* Character, float SpecialValue);
};

// 0xA0 (0x6D0 - 0x630)
// Class WTL.WTLAirDropStorage
class AWTLAirDropStorage : public AWTLStorageBox
{
public:
	class UWTLRadialForceComponent*              RadialForce;                                       // 0x630(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UParticleSystemComponent*              Highlighting;                                      // 0x638(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_106C[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_NewLifeTime;                                     // 0x650(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_106E[0x28];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         M_bShowAll;                                        // 0x67C(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bShowPositionOnLocation;                         // 0x67D(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         M_bSpawned;                                        // 0x67E(0x1)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         UseCameraShake;                                    // 0x67F(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMatineeCameraShake>       CameraShake;                                       // 0x680(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxDistance;                                       // 0x688(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraShakeValue;                                  // 0x68C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         HideUsableItem;                                    // 0x690(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         RemoveAiming;                                      // 0x691(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         NeedToKillCharacters;                              // 0x692(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1072[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        KillCharactersMaxDistance;                         // 0x694(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AActor>                  DestroyFX;                                         // 0x698(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeBeforeShowBox;                                 // 0x6C0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LocationHighlightingTime;                          // 0x6C4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CanSpawnGuard;                                     // 0x6C8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1073[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLAirDropStorage* GetDefaultObj();

	void OnRep_NewLifeTime();
	void OnRep_bShowPosition();
	void OnRep_bShowAll();
	void NetMulsticast_Destroy();
	void BPShowAll(bool ShowAll);
	void BPDestroy();
};

// 0x0 (0x28 - 0x28)
// Class WTL.WTLAITargetInterface
class IWTLAITargetInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IWTLAITargetInterface* GetDefaultObj();

	bool AIInterface_IsInSafeZone();
	bool AIInterface_IsCanBeAttacked(enum class EWTLFaction InstigatorFaction);
	bool AIInterface_IsAlive();
	struct FVector AIInterface_GetVelocity();
	int32 AIInterface_GetGroupID();
	enum class EWTLFaction AIInterface_GetFaction();
};

// 0x10 (0x238 - 0x228)
// Class WTL.WTLAmbientSound
class AWTLAmbientSound : public AAmbientSound
{
public:
	uint8                                        Pad_10B3[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EWTLAmbientSoundLocationType      LocationType;                                      // 0x234(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EWTLAmbientSoundDayTimeType       DayTimeType;                                       // 0x235(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_10B4[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLAmbientSound* GetDefaultObj();

};

// 0x40 (0x260 - 0x220)
// Class WTL.WTLAmmoCase
class AWTLAmmoCase : public AActor
{
public:
	class UCapsuleComponent*                     CollisionComp;                                     // 0x220(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  Mesh;                                              // 0x228(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        DropLifeSpan;                                      // 0x230(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_10E5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UFMODEvent>             DropSoundEvent;                                    // 0x238(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AWTLAmmoCase* GetDefaultObj();

	void OnHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit);
};

// 0x0 (0x220 - 0x220)
// Class WTL.WTLAnimalBase
class AWTLAnimalBase : public AActor
{
public:

	static class UClass* StaticClass();
	static class AWTLAnimalBase* GetDefaultObj();

	void OnRepReplicatedMovement(const struct FVector& Location, const struct FRotator& Rotation);
};

// 0x48 (0x80 - 0x38)
// Class WTL.WTLAnimNotifyAmmoCaseEject
class UWTLAnimNotifyAmmoCaseEject : public UAnimNotify
{
public:
	TSoftClassPtr<class AWTLAmmoCase>            AmmoCaseClass;                                     // 0x38(0x28)(Edit, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AmmoCaseForce;                                     // 0x60(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ForceRandomMultiplierValue;                        // 0x64(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               AngularImpulse;                                    // 0x68(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RandomRotationHalfCone;                            // 0x74(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  SocketName;                                        // 0x78(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTLAnimNotifyAmmoCaseEject* GetDefaultObj();

};

// 0x18 (0x50 - 0x38)
// Class WTL.WTLAnimNotifyParticleAmmoCaseEject
class UWTLAnimNotifyParticleAmmoCaseEject : public UAnimNotify
{
public:
	struct FVector                               AmmoCaseInitialVelocity;                           // 0x38(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  InitialVelocityParamName;                          // 0x44(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10F6[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLAnimNotifyParticleAmmoCaseEject* GetDefaultObj();

};

// 0x78 (0xB0 - 0x38)
// Class WTL.WTLAnimNotifyParticleEffect
class UWTLAnimNotifyParticleEffect : public UAnimNotify
{
public:
	TSoftObjectPtr<class UParticleSystem>        PSTemplate;                                        // 0x38(0x28)(Edit, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LocationOffset;                                    // 0x60(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RotationOffset;                                    // 0x6C(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               EmitterScale;                                      // 0x78(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10FD[0x1C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        Attached : 1;                                      // Mask: 0x1, PropSize: 0x10xA0(0x1)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_7F : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_10FE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  SocketName;                                        // 0xA4(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1101[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLAnimNotifyParticleEffect* GetDefaultObj();

};

// 0x60 (0x98 - 0x38)
// Class WTL.WTLAnimNotifyGunshot
class UWTLAnimNotifyGunshot : public UAnimNotify
{
public:
	TSoftObjectPtr<class UFMODEvent>             EditorEvent;                                       // 0x38(0x28)(Edit, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UParticleSystem>        EditParticleSystem;                                // 0x60(0x28)(Edit, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               EditorParticlesScale;                              // 0x88(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_110B[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLAnimNotifyGunshot* GetDefaultObj();

};

// 0x28 (0x60 - 0x38)
// Class WTL.WTLAnimNotifyFootstep
class UWTLAnimNotifyFootstep : public UAnimNotify
{
public:
	TSoftObjectPtr<class UFMODEvent>             EditorEvent;                                       // 0x38(0x28)(Edit, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTLAnimNotifyFootstep* GetDefaultObj();

};

// 0x28 (0x60 - 0x38)
// Class WTL.WTLAnimNotifyCharacterBreath
class UWTLAnimNotifyCharacterBreath : public UAnimNotify
{
public:
	TSoftObjectPtr<class UFMODEvent>             EditorEvent;                                       // 0x38(0x28)(Edit, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTLAnimNotifyCharacterBreath* GetDefaultObj();

};

// 0x0 (0x58 - 0x58)
// Class WTL.WTLAnimNotifyPlayCharacterSound
class UWTLAnimNotifyPlayCharacterSound : public UAnimNotify_PlaySound
{
public:

	static class UClass* StaticClass();
	static class UWTLAnimNotifyPlayCharacterSound* GetDefaultObj();

};

// 0x70 (0xA0 - 0x30)
// Class WTL.WTLCharacterAdditionalMeshNotifyState
class UWTLCharacterAdditionalMeshNotifyState : public UAnimNotifyState
{
public:
	uint8                                        Pad_1133[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  MeshComponentName;                                 // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>            Mesh;                                              // 0x40(0x28)(Edit, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  AttachBoneName;                                    // 0x68(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                            MeshRelativeTransform;                             // 0x70(0x30)(Edit, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTLCharacterAdditionalMeshNotifyState* GetDefaultObj();

};

// 0x78 (0xB0 - 0x38)
// Class WTL.WTLCharacterAddStaticMeshNotify
class UWTLCharacterAddStaticMeshNotify : public UAnimNotify
{
public:
	class UStaticMeshComponent*                  M_MeshComponent;                                   // 0x38(0x8)(ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  MeshComponentName;                                 // 0x40(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>            Mesh;                                              // 0x48(0x28)(Edit, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  AttachBoneName;                                    // 0x70(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1145[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            MeshRelativeTransform;                             // 0x80(0x30)(Edit, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTLCharacterAddStaticMeshNotify* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class WTL.WTLCharacterRemoveStaticMeshNotify
class UWTLCharacterRemoveStaticMeshNotify : public UAnimNotify
{
public:
	class FName                                  MeshComponentName;                                 // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTLCharacterRemoveStaticMeshNotify* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class WTL.WTLCharacterHandsNotifyState
class UWTLCharacterHandsNotifyState : public UAnimNotifyState
{
public:
	enum class EWTLHandsState                    StartHandsState;                                   // 0x30(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLHandsState                    EndHandsState;                                     // 0x31(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1166[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLCharacterHandsNotifyState* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class WTL.WTLCharacterHandsStateChange
class UWTLCharacterHandsStateChange : public UAnimNotify
{
public:
	enum class EWTLHandsState                    HandsState;                                        // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1167[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLCharacterHandsStateChange* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class WTL.WTLReloadingStateChange
class UWTLReloadingStateChange : public UAnimNotify
{
public:
	enum class EWTLReloadingNotifyType           NotifyType;                                        // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_116B[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLReloadingStateChange* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class WTL.WTLUsableItemStateChange
class UWTLUsableItemStateChange : public UAnimNotify
{
public:
	enum class EWTLUsableItemState               State;                                             // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_116C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLUsableItemStateChange* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class WTL.WTLUsableItemCustomTrigger
class UWTLUsableItemCustomTrigger : public UAnimNotify
{
public:
	class FName                                  TriggerName;                                       // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTLUsableItemCustomTrigger* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class WTL.WTLVehicleStateChange
class UWTLVehicleStateChange : public UAnimNotify
{
public:
	enum class EWTLVehicleState                  State;                                             // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_116D[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLVehicleStateChange* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class WTL.WTLVehicleCustomTrigger
class UWTLVehicleCustomTrigger : public UAnimNotify
{
public:
	class FName                                  TriggerName;                                       // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTLVehicleCustomTrigger* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class WTL.WTLPlaceableStuffCustomTrigger
class UWTLPlaceableStuffCustomTrigger : public UAnimNotify
{
public:
	class FName                                  TriggerName;                                       // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTLPlaceableStuffCustomTrigger* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class WTL.WTLNPCCustomTrigger
class UWTLNPCCustomTrigger : public UAnimNotify
{
public:
	class FName                                  TriggerName;                                       // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTLNPCCustomTrigger* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class WTL.WTLMonsterActionTrigger
class UWTLMonsterActionTrigger : public UAnimNotify
{
public:
	class FName                                  TriggerName;                                       // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTLMonsterActionTrigger* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class WTL.WTLMonsterAnimationTrigger
class UWTLMonsterAnimationTrigger : public UAnimNotify
{
public:
	class FName                                  TriggerName;                                       // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Value;                                             // 0x40(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_118B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ID;                                                // 0x44(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTLMonsterAnimationTrigger* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class WTL.WTLNPCActionTrigger
class UWTLNPCActionTrigger : public UAnimNotify
{
public:
	class FName                                  TriggerName;                                       // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTLNPCActionTrigger* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class WTL.WTLMonsterEffect
class UWTLMonsterEffect : public UAnimNotify
{
public:
	TMap<uint16, struct FWTLMonsterAction>       ActionsPerMonsterID;                               // 0x38(0x50)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTLMonsterEffect* GetDefaultObj();

};

// 0x8 (0x228 - 0x220)
// Class WTL.WTLAnomalyWayPoint
class AWTLAnomalyWayPoint : public AActor
{
public:
	class AWTLAnomalyWayPoint*                   NextWayPoint;                                      // 0x220(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AWTLAnomalyWayPoint* GetDefaultObj();

};

// 0xA8 (0x2C8 - 0x220)
// Class WTL.WTLArenaState
class AWTLArenaState : public AInfo
{
public:
	uint8                                        Pad_119F[0x28];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EWTLArenaMatchState               M_MatchState;                                      // 0x248(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_11A5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_NextMatchStateChangeServerTime;                  // 0x24C(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FWTLArenaFactionScore>         M_FactionScores;                                   // 0x250(0x10)(Net, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_11A6[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FWTLArenaLeaderboardRecord>    M_Leaderboard;                                     // 0x270(0x10)(Net, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FWTLArenaReward>               Rewards;                                           // 0x280(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_11A8[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimespan                             MatchWaitDuration;                                 // 0x2B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimespan                             MatchDuration;                                     // 0x2B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimespan                             MatchDoneDuration;                                 // 0x2C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AWTLArenaState* GetDefaultObj();

	void OnRep_MatchState();
};

// 0x158 (0x180 - 0x28)
// Class WTL.WTLBallisticsSystem
class UWTLBallisticsSystem : public UObject
{
public:
	uint8                                        Pad_11CC[0x148];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bDrawActualTrajectory;                             // 0x170(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11CD[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DebugInfoLifetime;                                 // 0x174(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActualTrajectoryThickness;                         // 0x178(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11CE[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLBallisticsSystem* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class WTL.WTLBPLibraryCharacter
class UWTLBPLibraryCharacter : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UWTLBPLibraryCharacter* GetDefaultObj();

	void TeleportCharacterToRandomPointInRange(class AWTLCharacter* Character, const struct FVector& OriginLocation, float MinRange, float MaxRange, enum class EWTLBPActionResult* Result);
	void TeleportCharacterToRandomPointArray(class AWTLCharacter* Character, const TArray<struct FVector>& Locations, enum class EWTLBPActionResult* Result);
	void TeleportCharacterToPoint(class AWTLCharacter* Character, const struct FVector& Location, enum class EWTLBPActionResult* Result);
	void TakeItemInContainerFromCharacter(class AWTLCharacter* Character, enum class EWTLItemType ItemType, int32 ItemTypeID, int32 Count, enum class EWTLBPActionResult* Result);
	void TakeItemInArms(class AWTLCharacter* Character, enum class EWTLItemType ItemType, int32 ItemTypeID, uint8 SlotNumber, enum class EWTLBPActionResult* Result);
	void TakeItemFromCharacter(class AWTLCharacter* Character, const TArray<struct FWTLBPIdentityItemType>& Items, bool CheckInContainers, enum class EWTLBPCheckResult* Result);
	void TakeArtefactWithInteactiveObjectIDFromCharacter(class AWTLCharacter* Character, int32 ArtefactID, int32 InteractiveObjectID, enum class EWTLBPActionResult* Result);
	void TakeAllItemsFromCharacter(class AWTLCharacter* Character, const TArray<struct FWTLBPIdentityItemType>& Items, bool CheckInContainers);
	void SwitchCharacterSex(class AWTLCharacter* Character, int32 ArtefactID, int32 InteractiveObjectID, enum class EWTLSex* Result);
	void SwitchCharacterFaction(class AWTLCharacter* Character, enum class EWTLFaction* Result);
	void SetCharacterThirstValue(class AWTLCharacter* Character, uint8 Value);
	void SetCharacterReputation(class AWTLCharacter* Character, uint8 Reputation, enum class EWTLBPActionResult* Result);
	void SetCharacterHungerValue(class AWTLCharacter* Character, uint8 Value);
	void RecoverCharacterStaminaByPercent(class AWTLCharacter* Character, float PercentValue);
	void RecoverCharacterStamina(class AWTLCharacter* Character, float Value);
	void KillCharacter(class AWTLCharacter* Character, TSubclassOf<class UDamageType> DamageTypeClass);
	void IsPointNearLocalCharacter(class UObject* WorldContextObject, const struct FVector& Position, float MaxDistance, enum class EWTLBPCheckResult* Result);
	bool IsPlayedCurrentEmotion(class AWTLCharacter* Character, int32 EmotionTypeID, int32 EmotionID);
	bool IsCharacterRegularPlayer(class AWTLCharacter* Character);
	bool IsCharacterModerator(class AWTLCharacter* Character);
	void IsCharacterHoldingBreath(class AWTLCharacter* Character, enum class EWTLBPCheckResult* Result);
	bool IsCharacterAdministator(class AWTLCharacter* Character);
	void IsActorNearLocalCharacter(class AActor* Actor, float MaxDistance, enum class EWTLBPCheckResult* Result);
	void InstallPDAModule(class AWTLCharacter* Character, int32 ModuleID, enum class EWTLBPActionResult* Result);
	void IncCharacterThirstValue(class AWTLCharacter* Character, int32 Delta);
	void IncCharacterHungerValue(class AWTLCharacter* Character, int32 Delta);
	void HealCharacterByPercentRet(class AWTLCharacter* Character, float PercentValue, float* RestoredHealth);
	void HealCharacterByPercent(class AWTLCharacter* Character, float PercentValue);
	void HealCharacter(class AWTLCharacter* Character, float Value);
	void GiveExperienceToCharacter(class AWTLCharacter* Character, int32 ExperienceAmount);
	class AWTLCharacter* GetLocalCharacter(class UObject* WorldContextObject);
	float GetDistanceToLocalCharacter(class UObject* WorldContextObject, const struct FVector& Position);
	uint8 GetCharacterStrength(class AWTLCharacter* Character);
	float GetCharacterStaminaValue(class AWTLCharacter* Character);
	float GetCharacterStaminaPercent(class AWTLCharacter* Character);
	uint8 GetCharacterStamina(class AWTLCharacter* Character);
	TArray<class AWTLCharacter*> GetCharactersInVolume(class UObject* WorldContextObject, class UStaticMeshComponent* Volume);
	TArray<class AWTLCharacter*> GetCharactersInRange(class UObject* WorldContextObject, const struct FVector& Origin, float Range);
	enum class EWTLSex GetCharacterSex(class AWTLCharacter* Character);
	float GetCharacterRepurtationPercent(class AWTLCharacter* Character);
	uint8 GetCharacterRepurtation(class AWTLCharacter* Character);
	enum class EWTLPlayerType GetCharacterPlayerType(class AWTLCharacter* Character);
	float GetCharacterParameterValue(class AWTLCharacter* Character, enum class EWTLCharacterParameter Parameter);
	class FString GetCharacterName(class AWTLCharacter* Character);
	uint8 GetCharacterLevel(class AWTLCharacter* Character);
	int32 GetCharacterInventoryWeight(class AWTLCharacter* Character);
	uint8 GetCharacterIntelligence(class AWTLCharacter* Character);
	float GetCharacterHealthValue(class AWTLCharacter* Character);
	float GetCharacterHealthPercent(class AWTLCharacter* Character);
	uint8 GetCharacterFortune(class AWTLCharacter* Character);
	enum class EWTLFaction GetCharacterFaction(class AWTLCharacter* Character);
	float GetCharacterEffectValue(class AWTLCharacter* Character, enum class EWTLCharacterEffectType EffectType);
	uint8 GetCharacterDexterity(class AWTLCharacter* Character);
	void GetCharacterClanMemberType(class AWTLCharacter* Character, enum class EWTLClanMemberType* Result);
	uint8 GetCharacterAccuracy(class AWTLCharacter* Character);
	void DecrementInventoryItem(class AWTLCharacter* Character, enum class EWTLItemType ItemType, int32 ItemTypeID, int32 Count, bool CheckInContainers, enum class EWTLBPCheckResult* Result);
	void DecrementCharacterStaminaByPercent(class AWTLCharacter* Character, float PercentValue);
	void DecrementCharacterStamina(class AWTLCharacter* Character, float Value);
	void DecrementCharactersHealthToPercentInRange(class UObject* WorldContextObject, const struct FVector& Origin, float Range, float HealthPercent, bool KillIfLessOrEqual, TSubclassOf<class UDamageType> DamageTypeClass, class AController* EventInstigator, class AActor* DamageCauser);
	void DecrementCharacterHealthToPercent(class AWTLCharacter* Character, float HealthPercent, bool KillIfLessOrEqual, TSubclassOf<class UDamageType> DamageTypeClass, class AController* EventInstigator, class AActor* DamageCauser);
	void ClearCameraLimits(class AWTLCharacter* Character);
	void CheckCharacterHaveEnoughAvailableInventorySlots(class AWTLCharacter* Character, int32 Count, enum class EWTLBPCheckResult* Result);
	void CheckCharacterHaveArtefactWithInteactiveObjectID(class AWTLCharacter* Character, int32 ArtefactID, int32 InteractiveObjectID, enum class EWTLBPCheckResult* Result);
	void CharacterTravel(class AWTLCharacter* Character, int32 LocationID, int32 PortalID, enum class EWTLBPActionResult* Result);
	void CharacterShowNote(class AWTLCharacter* Character, class FText& NoteName, int32 NoteID);
	uint8 CharacterRandomDropItem(class AWTLCharacter* Character, const struct FVector& Location);
	void CharacterLeaveClan(class AWTLCharacter* Character, enum class EWTLBPActionResult* Result);
	bool CharacterIsInvulnerable(class AWTLCharacter* Character);
	bool CharacterHaveEquipedDevice(class AWTLCharacter* Character, int32 StuffID);
	void CharacterHaveAnyItemsExcept(class AWTLCharacter* Character, const TArray<struct FWTLBPIdentityItemType>& AllowedItems, enum class EWTLBPCheckResult* Result);
	void CharacterHaveAnyItemOfTypeExcept(class AWTLCharacter* Character, enum class EWTLItemType ItemType, const TArray<int32>& ExceptIDList, bool CheckInContainers, enum class EWTLBPCheckResult* Result);
	void CharacterHaveAnyItemFromList(class AWTLCharacter* Character, const TArray<struct FWTLBPIdentityItemType>& Items, bool CheckInContainers, enum class EWTLBPCheckResult* Result);
	void CharacterHaveAllItemsFromList(class AWTLCharacter* Character, const TArray<struct FWTLBPIdentityItemType>& Items, bool CheckInContainers, enum class EWTLBPCheckResult* Result);
	bool CharacterHaveActiveNDPDetector(class AWTLCharacter* Character);
	bool CharacterHaveActiveMetalDetector(class AWTLCharacter* Character);
	bool CharacterHaveActiveEquipment(class AWTLCharacter* Character, int32 StuffID);
	void BeginInformationDialog(class AWTLCharacter* Character, int32 InformationDialogID, class FText Title);
	void AssignItemToFastAccessSlot(class AWTLCharacter* Character, enum class EWTLItemType ItemType, int32 ItemTypeID, uint8 SlotNumber, enum class EWTLBPActionResult* Result);
	void ApplyRandomPercentDamage(class AWTLCharacter* Character, float MinPercent, float MaxPercent, TSubclassOf<class UDamageType> DamageTypeClass, class AController* EventInstigator, class AActor* DamageCauser);
	void ApplyRadialDamage(class UObject* WorldContextObject, float DamageValue, const struct FVector& DamageOrigin, float DamageRadius, TSubclassOf<class UDamageType> DamageTypeClass, const TArray<class AActor*>& IgnoreActors, enum class EWTLBPActionResult* Result);
	void ApplyHearingDamageToCharacter(class AWTLCharacter* Character, enum class EWTLBPActionResult* Result);
	void ApplyCameraLimits(class AWTLCharacter* Character, const struct FWTLCameraLimits& CameraLimits, struct FRotator& ViewOrigin);
	void AddEffectToCharacterWithFalloff(class AWTLCharacter* Character, enum class EWTLCharacterEffectType EffectType, float EffectValue, const struct FVector& Origin, float FalloffRadius, float MinEffectValue, enum class EWTLBPActionResult* Result, bool UseStuffProtection, float MaxEffectValue);
	void AddEffectToCharactersWithFalloff(const TArray<class AWTLCharacter*>& Characters, enum class EWTLCharacterEffectType EffectType, float EffectValue, const struct FVector& Origin, float FalloffRadius, float MinEffectValue, enum class EWTLBPActionResult* Result, bool UseStuffProtection, float MaxEffectValue);
	void AddEffectToCharacters(const TArray<class AWTLCharacter*>& Characters, enum class EWTLCharacterEffectType EffectType, float EffectValue, enum class EWTLBPActionResult* Result, bool UseStuffProtection, float MaxEffectValue);
	void AddEffectToCharacterOnNextSpawn(class AWTLCharacter* Character, enum class EWTLCharacterEffectType EffectType, float EffectValue, enum class EWTLBPActionResult* Result);
	void AddEffectToCharacter(class AWTLCharacter* Character, enum class EWTLCharacterEffectType EffectType, float EffectValue, enum class EWTLBPActionResult* Result, bool UseStuffProtection, float MaxEffectValue);
};

// 0x0 (0x28 - 0x28)
// Class WTL.WTLBPLibraryCommon
class UWTLBPLibraryCommon : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UWTLBPLibraryCommon* GetDefaultObj();

	void WTLSwitchHasAuthority(class UObject* WorldContextObject, enum class EWTLBPCheckResult* Result);
	void WriteLog(class UObject* WorldContextObject, enum class EWTLBPLogVerbosity Verbosity, const class FString& Text, const class FString& MethodName);
	void UpdateReflectionSphere(class UObject* WorldContextObject, class UReflectionCaptureComponent* CaptureComponent);
	void TakeMoneyFromCharacter(class AWTLCharacter* Character, int32 MoneyAmount, const class FString& Reason, enum class EWTLBPActionResult* Result);
	void SwitchIsValidActor(class AActor* Actor, enum class EWTLBPCheckResult* Result);
	void SpawnWeaponProjectile(class UObject* WorldContextObject, class APawn* Instigator, class AActor* Owner, int32 WeaponID, int32 AmmoID, const struct FTransform& SpawnTransform, float MinDamage, float MaxDamage);
	class AWTLMonsterPawn* SpawnMonster(class UObject* WorldContextObject, TSubclassOf<class AWTLMonsterPawn> MonsterClass, class AActor* Owner, int32 MinLevel, int32 MaxLevel, const struct FTransform& Transform, const struct FWTLMonsterBurst& Burst, enum class EWTLFaction MonsterFaction, bool ReactionOnElectronicBait, float LifespanAfterDeath, bool IsSpawnDefaultController);
	class AWTLEnemyNPC* SpawnEnemyNPC(class UObject* WorldContextObject, TSubclassOf<class AWTLEnemyNPC> NPCClass, class AActor* Owner, int32 MinLevel, int32 MaxLevel, const struct FTransform& Transform);
	void SpawnAirDrop(class UObject* WorldContextObject, const struct FVector& SpawnLocation, int32 DropID, int32 MaxUseCount, float LifeSpan, bool CanSpawnGuard, enum class EWTLBPCheckResult* Result);
	class AWTLAIFlying* SpawnAIFlying(class UObject* WorldContextObject, TSubclassOf<class AWTLAIFlying> AIFlyingClass, class AActor* Owner, int32 MinLevel, int32 MaxLevel, const struct FTransform& Transform, const struct FWTLMonsterBurst& Burst, bool ReactionOnElectronicBait, float LifespanAfterDeath);
	class AWTLAICharacter* SpawnAICharacter(class UObject* WorldContextObject, TSubclassOf<class AWTLAICharacter> AICharacterClass, class AActor* Owner, int32 MinLevel, int32 MaxLevel, const struct FTransform& Transform, const struct FWTLMonsterBurst& Burst, bool ReactionOnElectronicBait, float LifespanAfterDeath);
	void ShowItemStoreOverlay(class UObject* WorldContextObject);
	void SetServerEventInfo(class UObject* WorldContextObject, enum class EWTLServerEventType Type, float MinutesToEvent, const class FString& Comment);
	void SendDedicatedServerMessage(class UObject* WorldContextObject, int32 LocationID, const class FString& MessageType, const class FString& MessageData);
	void ReportCrime(class UObject* WorldContextObject, class APawn* Instigator, class APawn* Victim, bool bIsLethal);
	class USkeletalMesh* MergeMeshes(struct FSkeletalMeshMergeParams& Params);
	class AWTLMonsterPawn* K2_SpawnMonster(class UObject* WorldContextObject, TSubclassOf<class AWTLMonsterPawn> MonsterClass, class AActor* Owner, int32 MinLevel, int32 MaxLevel, const struct FTransform& Transform, const struct FWTLMonsterBurst& Burst, enum class EWTLFaction MonsterFaction, bool ReactionOnElectronicBait, float LifespanAfterDeath, enum class EWTLBPCheckResult* Result);
	bool IsWithEditor();
	bool IsValidVectorAI(const struct FVector& Vector);
	bool IsValidActor(class AActor* Actor);
	void IsDay(class UObject* WorldContextObject, enum class EWTLBPCheckResult* Result);
	void HasItemInCharacterInventoryResult(class AWTLCharacter* Character, enum class EWTLItemType ItemType, int32 ItemTypeID, enum class EWTLBPActionResult* Result);
	bool HasItemInCharacterInventory(class AWTLCharacter* Character, enum class EWTLItemType ItemType, int32 ItemTypeID);
	void GiveMoneyToCharacter(class AWTLCharacter* Character, int32 MoneyAmount, const class FString& Reason, enum class EWTLBPActionResult* Result);
	void GiveItemToCharacterEx(class AWTLCharacter* Character, enum class EWTLItemType ItemType, int32 ItemTypeID, int32 Count, int32 Condition, uint8 CustomizationScalar, uint8 CustomizationColor, const class FString& CustomizationName, const class FString& ModificationData, enum class EWTLBPActionResult* Result);
	void GiveItemToCharacter(class AWTLCharacter* Character, enum class EWTLItemType ItemType, int32 ItemTypeID, int32 Count, int32 Condition, enum class EWTLBPActionResult* Result);
	void GiveItemsToCharacter(class AWTLCharacter* Character, const TArray<struct FWTLGiveItemInfo>& ItemsToGive, enum class EWTLBPActionResult* Result);
	struct FWTLSettings GetSettings(class UObject* WorldContextObject);
	float GetServerTimeSeconds(class UObject* WorldContextObject);
	struct FVector GetRandomPointInRange(class UObject* WorldContextObject, const struct FVector& OriginLocation, float MinRange, float MaxRange);
	void GetRandomCharactersInRange(class UObject* WorldContextObject, const struct FVector& ObserverLocation, const struct FVector& ObserverForwardVector, enum class EWTLFaction ObserverFaction, float InRange, bool AsEnemy, float HalfAnglePitch, float HalfAngleYaw, int32 MaxCount, TArray<class AWTLCharacter*>* ResultList, enum class EWTLBPCheckResult* Result);
	float GetMouseSensitivityInMiniGames(class UObject* WorldContextObject);
	int32 GetMonsterLevelByCharactersInfo(class UObject* WorldContextObject, int32 NumCharactersToIncreaseLevel, bool ApplyAverageLevel, int32 MinLevel, int32 MaxLevel, enum class EWTLBPCheckResult* Result);
	struct FWTLMonsterItemData GetMonsterInfo_LoadSynch(class UObject* WorldContextObject, int32 MonsterID, TSubclassOf<class AWTLMonsterPawn>* MonsterClass, enum class EWTLBPCheckResult* Result);
	struct FWTLMonsterItemData GetMonsterInfo(class UObject* WorldContextObject, int32 MonsterID, enum class EWTLBPCheckResult* Result);
	float GetLocationSkyDayTime(class UObject* WorldContextObject);
	void GetListPlaceableStuffInRange(class UObject* WorldContextObject, const struct FVector& ObserverLocation, const struct FVector& ObserverForwardVector, enum class EWTLFaction ObserverFaction, float InRange, bool AsEnemy, float HalfAnglePitch, float HalfAngleYaw, const TArray<int32>& ListIgnoreID, TArray<class AWTLPlaceableStuff*>* ResultList, enum class EWTLBPCheckResult* Result);
	void GetListMonstersInRange(class UObject* WorldContextObject, const struct FVector& ObserverLocation, const struct FVector& ObserverForwardVector, enum class EWTLFaction ObserverFaction, float InRange, bool AsEnemy, float HalfAnglePitch, float HalfAngleYaw, TArray<class AWTLMonsterPawn*>* ResultList, enum class EWTLBPCheckResult* Result);
	void GetListCharactersInRange(class UObject* WorldContextObject, const struct FVector& ObserverLocation, const struct FVector& ObserverForwardVector, enum class EWTLFaction ObserverFaction, float InRange, bool AsEnemy, float HalfAnglePitch, float HalfAngleYaw, TArray<class AWTLCharacter*>* ResultList, enum class EWTLBPCheckResult* Result);
	struct FKey GetKeyFromAction(class FName ActionName);
	class FString GetItemDisplayName(class UGameInstance* GameInstance, enum class EWTLItemType ItemType, int32 ItemTypeID);
	struct FInputAxisKeyMapping GetInputAxisKeyMappingFromKey(const struct FKey& Key);
	struct FInputActionKeyMapping GetInputActionKeyMappingFromKey(const struct FKey& Key);
	float GetCurrentLevelTime(class UObject* WorldContextObject);
	class AWTLCharacter* GetClosestCharacterForMonster(class UObject* WorldContextObject, class AWTLMonsterPawn* Monster, const TArray<class AActor*>& CharacterList, const struct FVector& ObserverLocation, enum class EWTLBPCheckResult* Result, float InRadiusSquare);
	class AActor* GetClosestAITargetInterfaceForMonster(class UObject* WorldContextObject, const TArray<class AActor*>& ActorList, const struct FVector& ObserverLocation, enum class EWTLBPCheckResult* Result);
	void GetAllCharactersForMonster(class UObject* WorldContextObject, TArray<class AWTLCharacter*>* Characters, enum class EWTLBPCheckResult* Result);
	TArray<class AActor*> GetActorsInRadius(class UObject* WorldContextObject, class UClass* ActorClass, const struct FVector& Origin, float Distance);
	float DistanceSSE2D(const struct FVector& From, const struct FVector& To);
	float DistanceSSE(const struct FVector& From, const struct FVector& To);
	void DelayedSpawnActor(class UObject* WorldContextObject, const struct FWTLDelayedSpawnActorInfo& Info);
	void DelayedDamage(class UObject* WorldContextObject, const struct FWTLDelayedDamageInfo& Info);
	void ClientShowWarningText(class AWTLCharacter* Character, class FText Text);
	void ClientShowTutorialMessagesByIDs(class AWTLCharacter* Character, TArray<int32>& TutorialMessagesIDs);
	void ClientShowTutorialMessages(class AWTLCharacter* Character, TArray<enum class EWTLTutorialMessage>& TutorialMessages);
	void ClientShowTutorialMessageByID(class AWTLCharacter* Character, int32 TutorialMessageID);
	void ClientShowTutorialMessage(class AWTLCharacter* Character, enum class EWTLTutorialMessage TutorialMessage);
	void ClientDestoryActor(class AActor* Actor);
	void CheckNPC(class UObject* WorldContextObject);
	class AWTLControlledMonsterPawn* CharactersInToAControllMonster(class UObject* WorldContextObject, class AWTLCharacter* Character, int32 MonsterID, int32 MonsterLevel, float MonsterLifeSpan, enum class EWTLFaction MonsterFaction, enum class EWTLBPCheckResult* Result);
	struct FVector CalculationOfTheLead(const struct FVector& SelfLocation, const struct FVector& TargetLocation, const struct FVector& TargetVelocity, float ProjectileSpeed);
	void BranchMonsterCanUseBrains(class APawn* Pawn, enum class EWTLBPCheckResult* Result);
};

// 0x0 (0x28 - 0x28)
// Class WTL.WTLBPLibraryQuestSystem
class UWTLBPLibraryQuestSystem : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UWTLBPLibraryQuestSystem* GetDefaultObj();

	void SetQuestState(class AWTLCharacter* Character, int32 QuestID, enum class EWTLQuestState State, enum class EWTLNPCActionResult* Result);
	void SetCharacterQuestState(class AWTLCharacter* Character, int32 QuestID, enum class EWTLQuestState State, enum class EWTLBPActionResult* Result);
	void SetCharacterQuestProgressBits(class AWTLCharacter* Character, int32 QuestID, int32 BitMask, enum class EWTLBPActionResult* Result);
	void SetCharacterQuestProgress(class AWTLCharacter* Character, int32 QuestID, uint8 Progress1, uint8 Progress2, uint8 Progress3, uint8 Progress4, enum class EWTLBPActionResult* Result);
	void IsCharacterQuestInState(class AWTLCharacter* Character, int32 QuestID, enum class EWTLQuestState QuestState, bool* Result);
	void IncrementCharacterQuestProgress(class AWTLCharacter* Character, int32 QuestID, uint8 Progress1Delta, uint8 Progress2Delta, uint8 Progress3Delta, uint8 Progress4Delta, enum class EWTLBPActionResult* Result);
	void GetCharacterQuestState(class AWTLCharacter* Character, int32 QuestID, enum class EWTLQuestState* QuestState);
	void GetCharacterQuestProgressDescription(class AWTLCharacter* Character, int32 QuestID, TArray<struct FWTLMonsterKillRequirementState>* MonsterKills, TArray<struct FWTLEnemyNPCKillRequirementState>* EnemyNPCKills, TArray<struct FWTLCustomQuestRequirementState>* CustomRequirements, enum class EWTLBPActionResult* Result);
	void GetCharacterQuestProgress(class AWTLCharacter* Character, int32 QuestID, uint8 ProgressNumber, uint8* ProgressValue);
	void CharacterHasAvailableInventorySlotsForCompleteQuest(class AWTLCharacter* Character, int32 QuestID, enum class EWTLNPCCheckResult* Result);
	void CharacterHasAndReturnAvailableInventorySlotsForCompleteQuest(class AWTLCharacter* Character, int32 QuestID, enum class EWTLNPCCheckResult* Result, int32* InventoryRequiredSlotCount, int32* InventoryAvailableSlotCount);
	void CharacterCanTakeQuest(class AWTLCharacter* Character, int32 QuestID, enum class EWTLNPCCheckResult* Result);
	void CharacterCanCompleteQuest(class AWTLCharacter* Character, int32 QuestID, enum class EWTLNPCCheckResult* Result);
};

// 0x0 (0x98 - 0x98)
// Class WTL.WTLBTService_AICheckForAttack
class UWTLBTService_AICheckForAttack : public UBTService_BlackboardBase
{
public:

	static class UClass* StaticClass();
	static class UWTLBTService_AICheckForAttack* GetDefaultObj();

};

// 0x0 (0x98 - 0x98)
// Class WTL.WTLBTService_BlueprintBase
class UWTLBTService_BlueprintBase : public UBTService_BlueprintBase
{
public:

	static class UClass* StaticClass();
	static class UWTLBTService_BlueprintBase* GetDefaultObj();

};

// 0x18 (0xB0 - 0x98)
// Class WTL.WTLBTService_CheckEnemy
class UWTLBTService_CheckEnemy : public UBTService_BlackboardBase
{
public:
	uint8                                        Pad_16D2[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EWTLMonsterState                  SetState;                                          // 0xAC(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         ClearKeyVisibleEnemy;                              // 0xAD(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_16D3[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLBTService_CheckEnemy* GetDefaultObj();

};

// 0x0 (0x98 - 0x98)
// Class WTL.WTLBTService_CheckForFarAttack
class UWTLBTService_CheckForFarAttack : public UBTService_BlackboardBase
{
public:

	static class UClass* StaticClass();
	static class UWTLBTService_CheckForFarAttack* GetDefaultObj();

};

// 0x8 (0xA0 - 0x98)
// Class WTL.WTLBTService_CheckForJump
class UWTLBTService_CheckForJump : public UBTService_BlackboardBase
{
public:
	enum class EWTLMonsterState                  SetState;                                          // 0x98(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EWTLMonsterStateFollowTarget      SetStateFollowTarget;                              // 0x99(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_16D5[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLBTService_CheckForJump* GetDefaultObj();

};

// 0x70 (0xE0 - 0x70)
// Class WTL.WTLBTService_Enemy_Sensing
class UWTLBTService_Enemy_Sensing : public UBTService
{
public:
	bool                                         bSensePlayers;                                     // 0x70(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSenseOtherEnemies;                                // 0x71(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHearNoises;                                       // 0x72(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInterruptCurrentTaskOnSpotted;                    // 0x73(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SightRadius;                                       // 0x74(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PeripheralVisionAngle;                             // 0x78(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HearingMaxSoundAge;                                // 0x7C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HearingThreshold;                                  // 0x80(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LOSHearingThreshold;                               // 0x84(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECollisionChannel                 SoundOcclusionChannel;                             // 0x88(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_16D6[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                TargetSpottedKey;                                  // 0x90(0x28)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                RemoteLocationListenedKey;                         // 0xB8(0x28)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTLBTService_Enemy_Sensing* GetDefaultObj();

};

// 0x18 (0xB0 - 0x98)
// Class WTL.WTLBTService_FrightRadius
class UWTLBTService_FrightRadius : public UBTService_BlackboardBase
{
public:
	enum class EWTLMonsterState                  SetState;                                          // 0x98(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_16EA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ApplyRadius;                                       // 0x9C(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DelayExecution;                                    // 0xA0(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        RandomDelayExecution;                              // 0xA4(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        M_CurrentDelayExecution;                           // 0xA8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_16EB[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLBTService_FrightRadius* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class WTL.WTLBTService_MonsterMovementMode
class UWTLBTService_MonsterMovementMode : public UBTService
{
public:
	enum class EWTLMonsterMovementMode           MovementMode;                                      // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_16EE[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLBTService_MonsterMovementMode* GetDefaultObj();

};

// 0x8 (0xA0 - 0x98)
// Class WTL.WTLBTService_SightAI
class UWTLBTService_SightAI : public UBTService_BlackboardBase
{
public:
	enum class EWTLMonsterState                  SetState;                                          // 0x98(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_16F0[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLBTService_SightAI* GetDefaultObj();

};

// 0x10 (0xA8 - 0x98)
// Class WTL.WTLBTService_StateIfHealthLess
class UWTLBTService_StateIfHealthLess : public UBTService_BlackboardBase
{
public:
	enum class EWTLMonsterState                  SetState;                                          // 0x98(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EWTMonsterSecondaryState          SetSecondaryState;                                 // 0x99(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_16F1[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HealthPercent;                                     // 0x9C(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         InverseCondition;                                  // 0xA0(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_16F2[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLBTService_StateIfHealthLess* GetDefaultObj();

};

// 0x0 (0x98 - 0x98)
// Class WTL.WTLBTTask_ActionFromBlackBoard
class UWTLBTTask_ActionFromBlackBoard : public UBTTask_BlackboardBase
{
public:

	static class UClass* StaticClass();
	static class UWTLBTTask_ActionFromBlackBoard* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class WTL.WTLBTTask_AvailableAction
class UWTLBTTask_AvailableAction : public UBTTaskNode
{
public:
	bool                                         bExceptMainAction;                                 // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_16F5[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLBTTask_AvailableAction* GetDefaultObj();

};

// 0x0 (0xA8 - 0xA8)
// Class WTL.WTLBTTask_BlueprintBase
class UWTLBTTask_BlueprintBase : public UBTTask_BlueprintBase
{
public:

	static class UClass* StaticClass();
	static class UWTLBTTask_BlueprintBase* GetDefaultObj();

};

// 0x40 (0xD8 - 0x98)
// Class WTL.WTLBTTask_EnemyNPC_MoveTo
class UWTLBTTask_EnemyNPC_MoveTo : public UBTTask_BlackboardBase
{
public:
	float                                        AcceptableRadius;                                  // 0x98(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_16F6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UNavigationQueryFilter>    FilterClass;                                       // 0xA0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ObservedBlackboardValueTolerance;                  // 0xA8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bObserveBlackboardValue : 1;                       // Mask: 0x1, PropSize: 0x10xAC(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowStrafe : 1;                                  // Mask: 0x2, PropSize: 0x10xAC(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowPartialPath : 1;                             // Mask: 0x4, PropSize: 0x10xAC(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bTrackMovingGoal : 1;                              // Mask: 0x8, PropSize: 0x10xAC(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bProjectGoalLocation : 1;                          // Mask: 0x10, PropSize: 0x10xAC(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReachTestIncludesAgentRadius : 1;                 // Mask: 0x20, PropSize: 0x10xAC(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReachTestIncludesGoalRadius : 1;                  // Mask: 0x40, PropSize: 0x10xAC(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bStopOnOverlap : 1;                                // Mask: 0x80, PropSize: 0x10xAC(0x1)(Edit, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bStopOnOverlapNeedsUpdate : 1;                     // Mask: 0x1, PropSize: 0x10xAD(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_9A : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1700[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                AcceptableRadiusKey;                               // 0xB0(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTLBTTask_EnemyNPC_MoveTo* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class WTL.WTLBTTask_FindClosestMonster
class UWTLBTTask_FindClosestMonster : public UBTTaskNode
{
public:
	float                                        ApplyRadius;                                       // 0x70(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         EdibleForMonster;                                  // 0x74(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1704[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLBTTask_FindClosestMonster* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class WTL.WTLBTTask_FrightRadius
class UWTLBTTask_FrightRadius : public UBTTaskNode
{
public:
	float                                        ApplyRadius;                                       // 0x70(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1705[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLBTTask_FrightRadius* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class WTL.WTLBTTask_Idle
class UWTLBTTask_Idle : public UBTTaskNode
{
public:

	static class UClass* StaticClass();
	static class UWTLBTTask_Idle* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class WTL.WTLBTTask_MonsterAction
class UWTLBTTask_MonsterAction : public UBTTaskNode
{
public:
	enum class EWTLMonsterActionType             Action;                                            // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1706[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLBTTask_MonsterAction* GetDefaultObj();

};

// 0x30 (0xE8 - 0xB8)
// Class WTL.WTLBTTask_MoveDirectlyToward
class UWTLBTTask_MoveDirectlyToward : public UBTTask_MoveDirectlyToward
{
public:
	bool                                         bUseAcceptableRadiusFromBlackboard;                // 0xB8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1707[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                AcceptableRadiusBlackboardKey;                     // 0xC0(0x28)(Edit, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UWTLBTTask_MoveDirectlyToward* GetDefaultObj();

};

// 0x10 (0x88 - 0x78)
// Class WTL.WTLBTTask_RunBehaviorStealth
class UWTLBTTask_RunBehaviorStealth : public UBTTask_RunBehavior
{
public:
	TArray<enum class EWTLMonsterState>          StatesForExecute;                                  // 0x78(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UWTLBTTask_RunBehaviorStealth* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class WTL.WTLBTTask_SetAIState
class UWTLBTTask_SetAIState : public UBTTaskNode
{
public:
	enum class EWTLMonsterState                  SetState;                                          // 0x70(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EWTMonsterSecondaryState          SetSecondaryState;                                 // 0x71(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1708[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLBTTask_SetAIState* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class WTL.WTLBTTask_SetMovementMode
class UWTLBTTask_SetMovementMode : public UBTTaskNode
{
public:
	enum class EWTLMonsterMovementMode           MovementMode;                                      // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1709[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLBTTask_SetMovementMode* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class WTL.WTLBTTask_SetStealthMode
class UWTLBTTask_SetStealthMode : public UBTTaskNode
{
public:
	bool                                         Value;                                             // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_170A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLBTTask_SetStealthMode* GetDefaultObj();

};

// 0x30 (0xE0 - 0xB0)
// Class WTL.WTLBTTask_WTLMoveTo
class UWTLBTTask_WTLMoveTo : public UBTTask_MoveTo
{
public:
	bool                                         bUseAcceptableRadiusFromBlackboard;                // 0xB0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_170B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                AcceptableRadiusBlackboardKey;                     // 0xB8(0x28)(Edit, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UWTLBTTask_WTLMoveTo* GetDefaultObj();

};

// 0x220 (0x440 - 0x220)
// Class WTL.WTLBulletHellBase
class AWTLBulletHellBase : public AActor
{
public:
	uint8                                        Pad_170C[0x100];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	class UProceduralMeshComponent*              M_ProcMesh;                                        // 0x320(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         UseBillboard;                                      // 0x328(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_170D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInterface*                    Material;                                          // 0x330(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMesh*                           RenderMesh;                                        // 0x338(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                    TailMaterial;                                      // 0x340(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         AutoDestroy;                                       // 0x348(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_170E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AttackMode;                                        // 0x34C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               SpawnAxisX;                                        // 0x350(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        PhysicsFps;                                        // 0x35C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ServerStartDelay;                                  // 0x360(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ClientStartDelay;                                  // 0x364(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MeshUpdateRate;                                    // 0x368(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        LoopDuration;                                      // 0x36C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SpawnRate;                                         // 0x370(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                              RotateSpawnAxisX;                                  // 0x374(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	float                                        SpawnCountBurst;                                   // 0x380(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         IsLinearSpawn;                                     // 0x384(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_170F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             BulletSpeed;                                       // 0x388(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                             LifeTime;                                          // 0x390(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                             BounceCount;                                       // 0x398(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         OnlyNegativeZ;                                     // 0x3A0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         UseConeSpread;                                     // 0x3A1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1710[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             ConeSpread;                                        // 0x3A4(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                             ConeSpreadRadius;                                  // 0x3AC(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               Drag;                                              // 0x3B4(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               Gravity;                                           // 0x3C0(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         UseCurveBulletSpeed;                               // 0x3CC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1711[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           CurveBulletSpeed;                                  // 0x3D0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         UseCurveScaleLocation;                             // 0x3D8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1712[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveVector*                          CurveScaleLocation;                                // 0x3E0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        CurveSpeedScale;                                   // 0x3E8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         UseTail;                                           // 0x3EC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1713[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DistFromVelocity;                                  // 0x3F0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                             Damage;                                            // 0x3F4(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        CollisionTime;                                     // 0x3FC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SphereTraceRadius;                                 // 0x400(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1714[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EObjectTypeQuery>          CollisionTraceQuery;                               // 0x408(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                         SpawnActorOnHit;                                   // 0x418(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1715[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AActor>                    SpawnActor;                                        // 0x420(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        DrawDebugTime;                                     // 0x428(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EDrawDebugTrace                   ServerDrawDebugTrace;                              // 0x42C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EDrawDebugTrace                   ClientDrawDebugTrace;                              // 0x42D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1716[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BulletRadius;                                      // 0x430(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StartTime;                                         // 0x434(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1717[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLBulletHellBase* GetDefaultObj();

};

// 0x18 (0x480 - 0x468)
// Class WTL.WTLBulletHellBillboardComponent
class UWTLBulletHellBillboardComponent : public UMeshComponent
{
public:
	TArray<struct FWTLMaterialSpriteElement>     Elements;                                          // 0x468(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_171A[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLBulletHellBillboardComponent* GetDefaultObj();

	void SetElements(TArray<struct FWTLMaterialSpriteElement>& NewElements);
	void AddElement(class UMaterialInterface* Material, class UCurveFloat* DistanceToOpacityCurve, bool bSizeIsInScreenSpace, float BaseSizeX, float BaseSizeY, class UCurveFloat* DistanceToSizeCurve);
};

// 0xB8 (0x2D8 - 0x220)
// Class WTL.WTLBulletinBoard
class AWTLBulletinBoard : public AActor
{
public:
	uint8                                        Pad_1723[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMeshComponent*                  Mesh;                                              // 0x240(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  BulletinMesh1;                                     // 0x248(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  BulletinMesh2;                                     // 0x250(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  BulletinMesh3;                                     // 0x258(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               Bulletin1CenterLocation;                           // 0x260(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               Bulletin2CenterLocation;                           // 0x26C(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               Bulletin3CenterLocation;                           // 0x278(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        BulletinHorizontalLocationDelta;                   // 0x284(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        BulletinVerticalLocationDelta;                     // 0x288(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        BulletinRotationDelta;                             // 0x28C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               BulletinOriginalScale;                             // 0x290(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        BulletinScaleDelta;                                // 0x29C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UMaterialInstance*>             BulletinMaterials;                                 // 0x2A0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<int32>                                QuestList;                                         // 0x2B0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPrivate)
	enum class EWTLFaction                       Faction;                                           // 0x2C0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_IsActive;                                        // 0x2C1(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1725[0x16];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLBulletinBoard* GetDefaultObj();

	void SetIsActive(bool Value);
	void OnRep_IsActive();
	void OnIsActiveChanged(bool IsActive);
	bool GetIsActive();
};

// 0x28 (0x248 - 0x220)
// Class WTL.WTLProjectile
class AWTLProjectile : public AActor
{
public:
	class USphereComponent*                      CollisionComp;                                     // 0x220(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWTLProjectileMovementComponent*       ProjectileMovement;                                // 0x228(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EProjectileType                   Type;                                              // 0x230(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowDebugInfo;                                    // 0x231(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDrawAimingTrajectory;                             // 0x232(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1729[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FColor                                AimingTrajectoryColor;                             // 0x234(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AimingTrajectoryThickness;                         // 0x238(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDrawActualTrajectory;                             // 0x23C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_172A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ActualTrajectoryThickness;                         // 0x240(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DebugInfoLifetime;                                 // 0x244(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AWTLProjectile* GetDefaultObj();

};

// 0xF0 (0x338 - 0x248)
// Class WTL.WTLBulletProjectile
class AWTLBulletProjectile : public AWTLProjectile
{
public:
	uint8                                        Pad_172B[0xB1];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         CanRicochet;                                       // 0x2F9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        RicochetChance;                                    // 0x2FA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        MaxRicochetCount;                                  // 0x2FB(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MinRicochetAngle;                                  // 0x2FC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MinRicochetVelocity;                               // 0x300(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MinRicochetVelocityDelta;                          // 0x304(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MaxRicochetVelocityDelta;                          // 0x308(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        PenetrationEndRandomHalfCone;                      // 0x30C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        InitialDamage;                                     // 0x310(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bDrawHitPoints;                                    // 0x314(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_172D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FColor                                HitPointsColor;                                    // 0x318(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDrawPenetrationExitPoints;                        // 0x31C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_172E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FColor                                PenetrationExitPointsColor;                        // 0x320(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDrawRicochetPoints;                               // 0x324(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_172F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FColor                                RicochetPointsColor;                               // 0x328(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDrawDestroyPoint;                                 // 0x32C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1730[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FColor                                DestroyPointColor;                                 // 0x330(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1731[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLBulletProjectile* GetDefaultObj();

	void OnProjectileBounce(struct FHitResult& ImpactResult, struct FVector& ImpactVelocity);
	void OnHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit);
};

// 0x90 (0x2B0 - 0x220)
// Class WTL.WTLBulletTracer
class AWTLBulletTracer : public AActor
{
public:
	uint8                                        Pad_1732[0x60];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UWTLProjectileMovementComponent*       ProjectileMovement;                                // 0x280(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        InitialVelocity;                                   // 0x288(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1733[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           VelocityCurve;                                     // 0x290(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                           GravityCurve;                                      // 0x298(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         DrawDebugInfo;                                     // 0x2A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1734[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DebugInfoLifetime;                                 // 0x2A4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DebugInfoLineThickness;                            // 0x2A8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1735[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLBulletTracer* GetDefaultObj();

	void OnTracerDestroyed(class AActor* DestroyedActor);
};

// 0x1A0 (0x3C0 - 0x220)
// Class WTL.WTLUsable
class AWTLUsable : public AActor
{
public:
	uint8                                        Pad_1737[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        M_ItemID;                                          // 0x238(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int16                                        M_ItemTypeID;                                      // 0x240(0x2)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1738[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         M_bIsSnuggled;                                     // 0x292(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1739[0x25];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PauseBetweenUse;                                   // 0x2B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        M_FastAccessSlotIndex;                             // 0x2BC(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                SkeletalMesh;                                      // 0x2C0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_173A[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         HideFastAccessSlots;                               // 0x2D0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_173B[0xF];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItemAnimationSet                     EquipSequenceSet;                                  // 0x2E0(0x18)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                        EquipTimeWithoutAnimation;                         // 0x2F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_173C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItemAnimationSet                     UnequipSequenceSet;                                // 0x300(0x18)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                        UnequipTimeWithoutAnimation;                       // 0x318(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_173D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimationAsset*                       MaleIdleStateAnimation;                            // 0x320(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimationAsset*                       FemaleIdleStateAnimation;                          // 0x328(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimationAsset*                       MaleSnuggleAnimation;                              // 0x330(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimationAsset*                       FemaleSnuggleAnimation;                            // 0x338(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace1D*                MaleAimOffsetBlendSpace;                           // 0x340(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace1D*                FemaleAimOffsetBlendSpace;                         // 0x348(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FItemAnimationSet>             IdleSequenceSetArray;                              // 0x350(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        IdleAnimationTimeoutMin;                           // 0x360(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IdleAnimationTimeoutMax;                           // 0x364(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBeSnuggled;                                    // 0x368(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_173E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SnuggleTraceRange;                                 // 0x36C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                AnimationFloatParameters;                          // 0x370(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                       AnimationVectorParameters;                         // 0x380(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                FemaleAnimationFloatParameters;                    // 0x390(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                       FemaleAnimationVectorParameters;                   // 0x3A0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                               HandsOffset;                                       // 0x3B0(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_173F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLUsable* GetDefaultObj();

	void NetMulticast_PutToInventory();
	class USkeletalMeshComponent* GetMesh();
	void BP_CustomActionTrigger(class FName Name);
};

// 0x98 (0x458 - 0x3C0)
// Class WTL.WTLStuff
class AWTLStuff : public AWTLUsable
{
public:
	uint8                                        Pad_1748[0x28];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItemAnimationSet                     UseSequenceSet;                                    // 0x3E8(0x18)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FItemAnimationSet                     AlternateUseSequenceSet;                           // 0x400(0x18)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FItemAnimationSet                     RechargeSequenceSet;                               // 0x418(0x18)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1749[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         UseActivity;                                       // 0x434(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_174A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ActivityUpInterpSpeed;                             // 0x438(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ActivityDownInterpSpeed;                           // 0x43C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               AimingHandsTranslationMale;                        // 0x440(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               AimingHandsTranslationFemale;                      // 0x44C(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AWTLStuff* GetDefaultObj();

	void Server_OnCharge();
	void OnReload();
	void NetMulticast_Recharge();
};

// 0x80 (0x4D8 - 0x458)
// Class WTL.WTLCameraDisplay
class AWTLCameraDisplay : public AWTLStuff
{
public:
	uint8                                        Pad_174C[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DesiredFOV;                                        // 0x468(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FOVChangeSpeed;                                    // 0x46C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetComponent*                      ScreenWidget;                                      // 0x470(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CameraPitchDesiredValue;                           // 0x478(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_174D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FWTLDisplayAnimationSet>       AnimationsList;                                    // 0x480(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_174E[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimMontage*                          CharacterUsingMontage;                             // 0x4B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                          TabletUsingMontage;                                // 0x4B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                          CharacterButtonMontage;                            // 0x4C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                          TabletButtonMontage;                               // 0x4C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimationAsset*                       TabletWithOpenedAntennasAnim;                      // 0x4D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AWTLCameraDisplay* GetDefaultObj();

	void K2_StickInputDirection(float InputUp, float InputRight);
};

// 0x0 (0x220 - 0x220)
// Class WTL.WTLStaticReplicatedActor
class AWTLStaticReplicatedActor : public AActor
{
public:

	static class UClass* StaticClass();
	static class AWTLStaticReplicatedActor* GetDefaultObj();

};

// 0x178 (0x398 - 0x220)
// Class WTL.WTLPlaceableStuff
class AWTLPlaceableStuff : public AWTLStaticReplicatedActor
{
public:
	uint8                                        Pad_175D[0x70];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	uint64                                       M_CharacterID;                                     // 0x290(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                M_CharacterName;                                   // 0x298(0x10)(Net, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint64                                       M_CharacterGroupID;                                // 0x2A8(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint16                                       M_CharacterClanID;                                 // 0x2B0(0x2)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EWTLFaction                       M_CharacterFaction;                                // 0x2B2(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_175E[0xAD];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         CanTakeDamageFromFactionMembers;                   // 0x360(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_175F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DamageToConditionMultiplier;                       // 0x364(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ExplosionDamageMultiplier;                         // 0x368(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                       M_Condition;                                       // 0x36C(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        StuffID;                                           // 0x370(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         SaveStateToDB;                                     // 0x374(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1760[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SaveStateToDBInterval;                             // 0x378(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1761[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  FullStuffName;                                     // 0x380(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AWTLPlaceableStuff* GetDefaultObj();

	void OnTakedBack(class AWTLCharacter* EventInstigator);
	void OnRep_Condition();
	void OnPlaced(class AWTLCharacter* EventInstigator);
	void OnEnergyChanged(float EnergyValue);
	void OnConditionChanged(float ConditionValue);
	void NetMulticast_OnDestroyed();
	void K2_OnDestroyed();
	void BPCustomAnimTrigger(class FName TriggerName);
	int32 BP_GetMaxCondition();
	int32 BP_GetCondition();
};

// 0x1B8 (0x550 - 0x398)
// Class WTL.WTLCampfire
class AWTLCampfire : public AWTLPlaceableStuff
{
public:
	uint8                                        Pad_1763[0xA8];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_Energy;                                          // 0x440(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1764[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWTLStorageContent                    M_StorageContent;                                  // 0x448(0xA8)(Net, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1765[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMeshComponent*                  Mesh;                                              // 0x520(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<enum class EObjectTypeQuery>          WarmzoneObjectTypes;                               // 0x528(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                        WarmzoneRadius;                                    // 0x538(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        WarmzoneHealingPercentPerSecond;                   // 0x53C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        StartEnergy;                                       // 0x540(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MaxEnergy;                                         // 0x544(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        EnergyDecrementPerSecond;                          // 0x548(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1766[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLCampfire* GetDefaultObj();

	void OnRep_StorageContent();
	void OnRep_Energy();
};

// 0x0 (0x28 - 0x28)
// Class WTL.WTLCanvasDrawableInterface
class IWTLCanvasDrawableInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IWTLCanvasDrawableInterface* GetDefaultObj();

};

// 0x0 (0x8B0 - 0x8B0)
// Class WTL.WTLCaptureComponent2D
class UWTLCaptureComponent2D : public USceneCaptureComponent2D
{
public:

	static class UClass* StaticClass();
	static class UWTLCaptureComponent2D* GetDefaultObj();

};

// 0x1518 (0x19D0 - 0x4B8)
// Class WTL.WTLCharacter
class AWTLCharacter : public ACharacter
{
public:
	uint8                                        Pad_17ED[0x78];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsMovementEnabled;                                // 0x530(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17EE[0x1F];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_ReplicatedStamina;                               // 0x550(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17EF[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_ReplicatedOxygen;                                // 0x558(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17F0[0xBC];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         M_FlashlightEnabled;                               // 0x618(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_IsInvulnerable;                                  // 0x619(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_IsInSafeZone;                                    // 0x61A(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_CanSpawnOnSafeZone;                              // 0x61B(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_IsInMobileResurectionPointWorkZone;              // 0x61C(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_IsInPVPZone;                                     // 0x61D(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_IsTraveling;                                     // 0x61E(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17F1[0x61];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class AWTLEventPoint*                        M_LastEventPoint;                                  // 0x680(0x8)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_AdminSprintMode;                                 // 0x688(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17F2[0x2F];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         M_IsHoldingBreath;                                 // 0x6B8(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17F3[0x1F];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         M_AgressorFlag;                                    // 0x6D8(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17F4[0x17];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsInFishingZone;                                  // 0x6F0(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsPlacingItem;                                    // 0x6F1(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17F5[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         M_bIsInQuickThrowingState;                         // 0x6F3(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17F6[0x24];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_CurrentRadiationLevel;                           // 0x718(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17F7[0xBC];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSpeedModifiers                       M_SpeedModifiers;                                  // 0x7D8(0x8)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPrivate)
	float                                        ScopeOccluderDelta;                                // 0x7E0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MonocularOccluderDelta;                            // 0x7E4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UFMODEvent>             DeathBreathSoundEvent;                             // 0x7E8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UFMODEvent>             StartHoldingBreathSoundEvent;                      // 0x810(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UFMODEvent>             StopHoldingBreathSoundEvent;                       // 0x838(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UFMODEvent>             TeleportSoundEvent;                                // 0x860(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UFMODEvent>             HearingDamageEvent;                                // 0x888(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundMix>              DrunkSoundMix;                                     // 0x8B0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        WalkFootstepMinInterval;                           // 0x8D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        WalkFootstepVolume;                                // 0x8DC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SprintFootstepMinInterval;                         // 0x8E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SprintFootstepVolume;                              // 0x8E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        CrouchFootstepMinInterval;                         // 0x8E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        CrouchFootstepVolume;                              // 0x8EC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        AimFootstepVolumeMultiplier;                       // 0x8F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17F9[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USkeletalMeshComponent*                MeshTorso;                                         // 0x900(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                MeshLegs;                                          // 0x908(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                MeshFeet;                                          // 0x910(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                MeshHead;                                          // 0x918(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                MeshNeck;                                          // 0x920(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                MeshHeadSlot;                                      // 0x928(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                MeshTorsoSlot;                                     // 0x930(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                MeshLegsSlot;                                      // 0x938(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                MeshFeetSlot;                                      // 0x940(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                BackpackSlot;                                      // 0x948(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                GlassesSlot;                                       // 0x950(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                WatchesSlot;                                       // 0x958(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                EquipmentSlot1;                                    // 0x960(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                EquipmentSlot2;                                    // 0x968(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                EquipmentSlot3;                                    // 0x970(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                EquipmentSlot4;                                    // 0x978(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  EquippedWeaponPreviewSlot0;                        // 0x980(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  EquippedWeaponPreviewSlot0MuzzleMount;             // 0x988(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  EquippedWeaponPreviewSlot0MuzzleAttachment;        // 0x990(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  EquippedWeaponPreviewSlot0FlashlightMount;         // 0x998(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  EquippedWeaponPreviewSlot0FlashlightAttachment;    // 0x9A0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  EquippedWeaponPreviewSlot0ScopeMount;              // 0x9A8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  EquippedWeaponPreviewSlot0ScopeAttachment;         // 0x9B0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  EquippedWeaponPreviewSlot1;                        // 0x9B8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  EquippedWeaponPreviewSlot1MuzzleMount;             // 0x9C0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  EquippedWeaponPreviewSlot1MuzzleAttachment;        // 0x9C8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  EquippedWeaponPreviewSlot1FlashlightMount;         // 0x9D0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  EquippedWeaponPreviewSlot1FlashlightAttachment;    // 0x9D8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  EquippedWeaponPreviewSlot1ScopeMount;              // 0x9E0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  EquippedWeaponPreviewSlot1ScopeAttachment;         // 0x9E8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  EquippedStuffPreviewSlot5;                         // 0x9F0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  HolsterSlot;                                       // 0x9F8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  EquippedPistolPreviewSlot;                         // 0xA00(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  SheathSlot;                                        // 0xA08(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  SheathPreviewSlot;                                 // 0xA10(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWTLFlashlightMountComponent*          FlashlightComponent;                               // 0xA18(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USpotLightComponent*                   LightComponent;                                    // 0xA20(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  FlashlightMesh;                                    // 0xA28(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  ScopeOccluderMesh;                                 // 0xA30(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USphereComponent*                      BulletFlyNearVolume;                               // 0xA38(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioComponent*                       HeartbeatAudioComponent;                           // 0xA40(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFMODAudioComponent*                   CharacterVoiceComponent;                           // 0xA48(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFMODAudioComponent*                   NDPDetectorAudioComponent;                         // 0xA50(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFMODAudioComponent*                   RadiationDetectorAudioComponent;                   // 0xA58(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWTLFMODCharacterVoiceComponent*       VOIPComponent;                                     // 0xA60(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWTLCharacterIdentityComponent*        IdentityComponent;                                 // 0xA68(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialBillboardComponent*           VOIPIndicatorSprite;                               // 0xA70(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1800[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPawnNoiseEmitterComponent*            NoiseEmitterComponent;                             // 0xA80(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetInteractionComponent*           WidgetInteraction;                                 // 0xA88(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1801[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsDying;                                          // 0xA94(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsAimToggle;                                      // 0xA95(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsCrouchToggle;                                   // 0xA96(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsSprintToggle;                                   // 0xA97(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowRebasing;                                    // 0xA98(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1802[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RebasingDistance;                                  // 0xA9C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTakeHitInfo                          LastTakeHitInfo;                                   // 0xAA0(0x220)(Net, Transient, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1803[0x21];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EWTLHandsState                    HandsState;                                        // 0xCE1(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1804[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AWTLUsable*                            UsableItemInHands;                                 // 0xCE8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AWTLUsable*                            QuickItemInHands;                                  // 0xCF0(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsAiming;                                         // 0xCF8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsSprinting;                                      // 0xCF9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1805[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsJumping;                                        // 0xCFC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EWTLCharacterPose                 CurrentPose;                                       // 0xCFD(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1806[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SprintSpeed;                                       // 0xD00(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        WalkSpeed;                                         // 0xD04(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        CrouchSpeed;                                       // 0xD08(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ProneSpeed;                                        // 0xD0C(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SwimSpeed;                                         // 0xD10(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        AimSpeedMultiplier;                                // 0xD14(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MaxStamina;                                        // 0xD18(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        StaminaNotMovingIncrement;                         // 0xD1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        StaminaMovingIncrement;                            // 0xD20(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        StaminaSprintDecrement;                            // 0xD24(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        StaminaPercentSprintAvailability;                  // 0xD28(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        StaminaJumpDecrementPercent;                       // 0xD2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        StaminaHoldingBreathDecrement;                     // 0xD30(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        StaminaWaterMovementDecrement;                     // 0xD34(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        StaminaUnderwaterDecrement;                        // 0xD38(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MaxOxygen;                                         // 0xD3C(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        OxygenNoBreatheDecrement;                          // 0xD40(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        OxygenBreatheIncrement;                            // 0xD44(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        StandMinPitchAngle;                                // 0xD48(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        StandMaxPitchAngle;                                // 0xD4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        CrouchMinPitchAngle;                               // 0xD50(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        CrouchMaxPitchAngle;                               // 0xD54(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ProneMinPitchAngle;                                // 0xD58(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ProneMaxPitchAngle;                                // 0xD5C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SwimMinPitchAngle;                                 // 0xD60(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SwimMaxPitchAngle;                                 // 0xD64(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        GravityScaleInWater;                               // 0xD68(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        GravityScaleUnderWater;                            // 0xD6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        GravityScaleOnLand;                                // 0xD70(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1807[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_CameraOffsetInterpSpeed;                         // 0xD8C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1808[0x1A8];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                M_InteractiveObjectInFocus;                        // 0xF38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1809[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EObjectTypeQuery>          InterestObjectTypes;                               // 0xF50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)
	float                                        InterestTraceRadius;                               // 0xF60(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_180A[0x24];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bEnableHandsStateDebugging;                        // 0xF88(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_180C[0x1F];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         M_bIsUnderWater;                                   // 0xFA8(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_bIsInWater;                                      // 0xFA9(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         M_bMovesOnWater;                                   // 0xFAA(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_180D[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture2D>             M_CharacterEffectsTexture;                         // 0xFB0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<enum class EWTLCharacterEffectType, struct FVector2D> M_CharacterEffectIconsCoords;                      // 0xFD8(0x50)(Edit, NativeAccessSpecifierPrivate)
	TMap<enum class EWTLCharacterStateIndicatorType, struct FVector2D> M_CharacterIndicatorIconsCoords;                   // 0x1028(0x50)(Edit, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UFont>                  Font;                                              // 0x1078(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UTexture2D>             DotPointerTexture;                                 // 0x10A0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_180E[0x5C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        M_DesiredTiltValue;                                // 0x1124(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>     M_PlacementPreviewItemMaterial;                    // 0x1128(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                          M_RightPlacementColor;                             // 0x1150(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                          M_WrongPlacementColor;                             // 0x1160(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_180F[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class AStaticMeshActor*                      M_PlacementPointer;                                // 0x1180(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1810[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInstanceDynamic*              M_PlacementPreviewMaterialInstance;                // 0x1198(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1811[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        UndergroundFlashlightIntensityMultiplier;          // 0x11AC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        OtherCharacterFlashlightIntensityMultiplier;       // 0x11B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1812[0x1C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         M_bIsFishing;                                      // 0x11D0(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1813[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWTLQTEState                          QTEState;                                          // 0x11D4(0x10)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1814[0x74];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EWTLSex                           BlueprintSex;                                      // 0x1258(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1815[0x87];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                M_CurrentActionGameplayActor;                      // 0x12E0(0x8)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1816[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint16                                       M_CurrentEmotionKey;                               // 0x12EA(0x2)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1817[0x9];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         M_LeavingFromVehicle;                              // 0x12F5(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1818[0x23];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         PersonalEnergyShieldState;                         // 0x1319(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1819[0xE];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AWTLDrone*                             M_Drone;                                           // 0x1328(0x8)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AWTLCameraDisplay*                     M_DroneCameraDisplay;                              // 0x1330(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_            OnCharacterDestroy;                                // 0x1338(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnTravelingResult;                                 // 0x1348(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCharacterDied;                                   // 0x1358(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCoreHackngResult;                                // 0x1368(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCharacterLeavedFishingZone;                      // 0x1378(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCharacterEnteredInFishingZone;                   // 0x1388(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnGameplayActionStarted;                           // 0x1398(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnGameplayActionFinished;                          // 0x13A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_181A[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         M_bCanUseVehicleInAnomaly;                         // 0x13B9(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_181B[0x26];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UAnimInstance>           MaleAnimBlueprint;                                 // 0x13E0(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UWTLCharacterWatchAnimInstance> MaleWatchesAnimBlueprint;                          // 0x1408(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UAnimInstance>           FemaleAnimBlueprint;                               // 0x1430(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UWTLCharacterWatchAnimInstance> FemaleWatchesAnimBlueprint;                        // 0x1458(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWTLLowerBodyAnimation                StandLowerBodyRotation;                            // 0x1480(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FWTLLowerBodyAnimation                CrouchLowerBodyRotation;                           // 0x1490(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class UAnimMontage*                          MaleTimeCheckAnimationMontage;                     // 0x14A0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          FemaleTimeCheckAnimationMontage;                   // 0x14A8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          LadderUpStartMontage;                              // 0x14B0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          LadderUpEndMontage;                                // 0x14B8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          LadderDownStartMontage;                            // 0x14C0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          LadderDownEndMontage;                              // 0x14C8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          ThrowNutMontage;                                   // 0x14D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          PickItemMontage;                                   // 0x14D8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<enum class EWTLCharacterStunhitDirection, class UAnimMontage*> StunhitAnimations;                                 // 0x14E0(0x50)(Edit, NativeAccessSpecifierPublic)
	TArray<enum class EWTLCharacterStunhitDirection> DrunkAnimationStunhitSet;                          // 0x1530(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>          MaleNeckMesh;                                      // 0x1540(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>          FemaleNeckMesh;                                    // 0x1568(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>          MaleTorsoMeshFullArms;                             // 0x1590(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>          MaleTorsoMeshHalfArms;                             // 0x15B8(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>          MaleTorsoMeshHandsOnly;                            // 0x15E0(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>          FemaleTorsoMeshFullArms;                           // 0x1608(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>          FemaleTorsoMeshHalfArms;                           // 0x1630(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>          FemaleTorsoMeshHandsOnly;                          // 0x1658(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UMatineeCameraShake>     CameraShakeMoveForward;                            // 0x1680(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UMatineeCameraShake>     CameraShakeMoveForwardAiming;                      // 0x16A8(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UMatineeCameraShake>     CameraShakeMoveRight;                              // 0x16D0(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UMatineeCameraShake>     CameraShakeMoveRightAiming;                        // 0x16F8(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UMatineeCameraShake>     CameraShakeSprint;                                 // 0x1720(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UMatineeCameraShake>     CameraShakeConsternation;                          // 0x1748(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AWTLNut>                 NutClass;                                          // 0x1770(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NutThrowForce;                                     // 0x1798(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_181D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            AdditionalNutTransform;                            // 0x17A0(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               AdditionalNutRotation;                             // 0x17D0(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDead;                                           // 0x17DC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_181E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        NormalFOV;                                         // 0x17E0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SprintFOV;                                         // 0x17E4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NormalFOVChangeSpeed;                              // 0x17E8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OpticsFOVChangeSpeed;                              // 0x17EC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  CameraBoneName;                                    // 0x17F0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_181F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DissolveLifespanTrigger;                           // 0x17FC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1820[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsClimbingLadder;                                 // 0x1810(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1821[0xB7];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        M_ChickenStatus;                                   // 0x18C8(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1822[0xF];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BaseTurnRate;                                      // 0x18D8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BaseLookUpRate;                                    // 0x18DC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MouseSensivityMultiplier;                          // 0x18E0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1823[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UDataTable*                            WeaponDataTable;                                   // 0x18E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               IKFloorTraceOffset;                                // 0x18F0(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IKFloorTraceLenth;                                 // 0x18FC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIKIsEnabled;                                      // 0x1900(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIKIsDebug;                                        // 0x1901(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1824[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        IKTraceDistance;                                   // 0x1904(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  IKRightFootSocketName;                             // 0x1908(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  IKLeftFootSocketName;                              // 0x1910(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IKScale;                                           // 0x1918(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PronedEyeHeight;                                   // 0x191C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsProned : 1;                                     // Mask: 0x1, PropSize: 0x10x1920(0x1)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_B2 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1826[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsQuickItemChange;                                // 0x1924(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1827[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DissolveInterpSpeed;                               // 0x192C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1828[0xD];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         M_bLockCameraRotation;                             // 0x193D(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1829[0x5A];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class AWTLLadder*                            CurrentLadder;                                     // 0x1998(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        RemoteViewYaw;                                     // 0x19A0(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_182A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint64                                       StandaloneCharacterID;                             // 0x19A8(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_182B[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsMonstersFollowing;                              // 0x19B8(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_182C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxNumMonstersFollowing;                           // 0x19BC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RadiusMonsterNear;                                 // 0x19C0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_182D[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AWTLCharacter* GetDefaultObj();

	void UpdateEquipmentItemStates();
	void StopEmotion();
	void StopCameraShake(TSubclassOf<class UMatineeCameraShake> CameraShake);
	void StartQTE(class AActor* QTEInstigator);
	void StartInteractionWithActionGameplayObject(class AActor* ActionGameplayActor);
	void SpawnVehicle(uint64 ItemId, uint16 VehicleID);
	void ShowSteamStoreInterface();
	void ShowDeathScreen();
	void ShowAllMeshesVisibleOnClient(bool bVisible);
	void SetShowAllMeshes(bool ShowAllMeshes);
	void SetDeathFromAnomaly(bool DeathFromAnomaly, bool ShowAllMeshes, bool DeathSimulatePhysics);
	void SetDeathByTimer(float DelayValue, TSubclassOf<class UDamageType> DamageTypeClass, enum class EWTLCharacterEffectType EffectType, class AController* DeathInstigator, class AActor* DeathCauser);
	void SetCurrentPose(enum class EWTLCharacterPose Value);
	void SetAllMeshesVisible(bool bVisible);
	void Server_UseEquipmentSlot(uint8 SlotNumber);
	void Server_Use(class AActor* Actor);
	void Server_ThrowNut();
	void Server_SwitchFireMode();
	void Server_Suicide();
	void Server_StopItemPlacement();
	void Server_StopEmotion();
	void Server_StartItemPlacement();
	void Server_SetSprintMode(bool Value);
	void Server_SetHoldingBreath(bool Value);
	void Server_SetFlashlightEnabled(bool Value);
	void Server_SetDeathFromAnomaly(bool DeathFromAnomaly, bool ShowAllMeshes, bool DeathSimulatePhysics);
	void Server_SetCurrentPose(enum class EWTLCharacterPose Value);
	void Server_SetAppearanceProcessed();
	void Server_SetAimMode(bool Value, bool IgnoreHandsState);
	void Server_SendQTEAction(uint8 ActionID);
	void Server_SelectSlot(uint8 SlotNumber, bool AllowReselect, bool Force);
	void Server_RequestStuffPlacement(uint64 StuffItemID);
	void Server_RequestSpecialStuffPlacement(uint16 StuffID);
	void Server_RequestActionGameplayActorToUse(class AActor* ActionGameplayActor);
	void Server_RequestActionGameplayActorToStopUse();
	void Server_QuickThrow();
	void Server_QuickMeleeHit();
	void Server_ProcessBulletFlyNear(const struct FVector_NetQuantize& Location, enum class EWTLCaliber Caliber);
	void Server_PlayEmotion(int32 EmotionTypeID, int32 EmotionID);
	void Server_PlaceStuff();
	void Server_OnUse(class AActor* InteractiveActor);
	void Server_OnTiltRight();
	void Server_OnTiltLeft();
	void Server_OnStopTilt();
	void Server_OnStartUse();
	void Server_OnFinishUse(class AActor* InteractiveObject, bool Success);
	void Server_NotifyClientCheatState(enum class EWTLCheatType CheatType, const class FString& Info);
	void Server_MainUseStop(int32 OptionalValue1, int32 OptionalValue2);
	void Server_MainUseStart(const struct FVector2D& AimOffset);
	void Server_HideItem(bool Force);
	void Server_HideDrone();
	void Server_CoreHacking_Process(uint8 InputValue, class AWTLFortificationCommandCore* CommandCore);
	void Server_ClearCurrentSlot();
	void Server_CancelStuffPlacementMode();
	void Server_CancelQTE();
	void Server_AssignItemToFastAccessSlot(uint8 SlotNumber, enum class EWTLItemType ItemType, uint64 ItemId);
	void Server_AlternativeUseStop();
	void Server_AlternativeUseStart();
	void ResetIdleTimer();
	void PostDeath();
	void PlayStunhit(enum class EWTLCharacterStunhitDirection StunhitDirection, bool IsHideUsableItem);
	void PlaySoundEventAttached(class UFMODEvent* Sound);
	void PlaySoundEvent2D(class UFMODEvent* Sound);
	void PlayMontage(class UAnimMontage* MontageToPlay, bool BlockInput);
	void PlayCameraShake(TSubclassOf<class UMatineeCameraShake> CameraShake, float Value, bool IsHideUsableItem, bool RemoveAiming);
	void OnUnmuteCharacter();
	void OnTextChatUnmuteCharacter();
	void OnTextChatMuteCharacter();
	void OnShowInformationAboutCharacter();
	void OnShortCharacterInfoChanged();
	void OnSendTextChatMessageToCharacter();
	void OnReportCharacter();
	void OnRep_UsableItemInHands();
	void OnRep_Stamina();
	void OnRep_QTEState();
	void OnRep_PersonalEnergyShieldState();
	void OnRep_Oxygen();
	void OnRep_LastTakeHitInfo();
	void OnRep_LastEventPoint();
	void OnRep_IsTraveling();
	void OnRep_IsProned();
	void OnRep_IsPlacingItem();
	void OnRep_IsInvulnerable();
	void OnRep_IsInSafeZone();
	void OnRep_IsInPVPZone();
	void OnRep_IsInMobileResurectionPointWorkZone();
	void OnRep_IsInFishingZone();
	void OnRep_IsHoldingBreath();
	void OnRep_IsClimbingLadder();
	void OnRep_HandsState(enum class EWTLHandsState PreviousHandsState);
	void OnRep_FlashlightEnabled();
	void OnRep_DroneRenderTargetActor();
	void OnRep_Drone();
	void OnRep_CurrentRadiationLevel();
	void OnRep_CurrentPose(enum class EWTLCharacterPose PrevValue);
	void OnRep_CurrentEmotionKey();
	void OnRep_CurrentActionGameplayActor(class AActor* PrevActor);
	void OnRep_bIsSprinting();
	void OnRep_bIsJumping();
	void OnRep_bIsAiming();
	void OnPickupPlaceableStuffConfirmed();
	void OnPickupPlaceableStuff();
	void OnOfferBarterToCharacter();
	void OnOfferBarter(const class FString& Message);
	void OnMuteCharacter();
	void OnMontageStarted(class UAnimMontage* Montage);
	void OnMontageEnded(class UAnimMontage* Montage, bool bInterrupted);
	void OnInviteCharacterToGroup();
	void OnGiveTokensToCharacter();
	void OnCommendCharacter();
	void OnChargePlaceableStuff();
	void OnCharacterInfoChanged();
	void OnCapsuleEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnCapsuleBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void OnBulletFlyNearVolumeBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void NetMulticast_ThrowNut();
	void NetMulticast_ShowTeleportationDeviceEffect();
	void NetMulticast_SetBrokenLight(bool Value);
	void NetMulticast_PlayPickupAnimation(float Rate);
	void NetMulticast_PlayAnimMontage(class UAnimMontage* Montage, float Rate);
	void NetMulticast_OnTeleportedWithDevice();
	void NetMulticast_OnStuffEquipmentStateChanged(uint64 CharacterID, uint16 StuffID, bool State);
	void LevelLoadedAtStart();
	void Kill(class AController* Killer, class AActor* DamageCauser, TSubclassOf<class UDamageType> DamageTypeClass, enum class EWTLCharacterEffectType EffectType);
	void K2_ShowTeleportationDeviceEffect();
	void K2_ShowExplosionEffectsAfterDeath();
	void K2_ShowEffectsAfterDeath();
	void K2_SetMovementEnabled(bool Value);
	void K2_OnStartProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust);
	void K2_OnEndProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust);
	void K2_OnEffectRemoved(enum class EWTLCharacterEffectType EffectType);
	void K2_OnEffectAdded(enum class EWTLCharacterEffectType EffectType);
	void K2_OnDeath();
	void K2_LockCameraRotation(bool Value);
	struct FGenericTeamId K2_GetGenericTeamID();
	enum class EWTLCharacterClass K2_GetCharacterClass();
	bool K2_CanBeSeenFrom(struct FVector& ObserverLocation, struct FVector* OutSeenLocation, int32* NumberOfLoSChecksPerformed, float* OutSightStrength, class AActor* IgnoreActor);
	bool IsReadyToSpawnVehicle();
	bool IsPVPEnabled();
	bool IsPlayingEmotion();
	bool IsInSafeZone();
	bool IsInPVPZone();
	bool IsInMobileResurectionPointWorkZone();
	bool IsInFortificationScoreZone();
	bool IsInFishingZone();
	bool IsInExactSafeZone(class AWTLSafeZone* SafeZone);
	bool IsInAir();
	void IncrementMonstersNear(int32 Value);
	void IncrementMonstersFollowing(int32 Value);
	void HideAllMeshes();
	void GetSkeletalMeshComponentsByRef(TArray<class USkeletalMeshComponent*>* Meshes);
	TArray<class USkeletalMeshComponent*> GetSkeletalMeshComponents();
	float GetPercentHealth();
	class AWTLEventPoint* GetLastEventPoint();
	bool GetIsInQTE();
	class AWTLHUD* GetHUD();
	bool GetDeathFromAnomaly();
	enum class EWTLCharacterPose GetCurrentPose();
	class AActor* GetCurrentActionGameplayObject();
	uint8 GetComplexion();
	float GetChickenStatusAlpha();
	uint8 GetChickenStatus();
	class FString GetCharacterRankName();
	uint8 GetCharacterRank();
	uint8 GetCharacterLevel();
	enum class EWTLAITeam GetAITeam();
	void FinishInteractionWithActionGameplayObject();
	void FailQTE();
	void DecrementMonstersNear(int32 Value);
	void DecrementMonstersFollowing(int32 Value);
	void Client_WrongPlacementSpotMessage(class FText& Message);
	void Client_UpdateEquipmentItemStates();
	void Client_ShowWarningText(class FText& WarningText, bool IsPlaySound);
	void Client_ShowWarning(enum class EWTLWarningTitleWidgetType WarningTitleWidgetType, bool IsPlaySound);
	void Client_ShowTeleportationDeviceWindowWidget(uint64 TeleportationDeviceItemID);
	void Client_ShowSteamStoreInterface();
	void Client_ShowContentInventory(class AActor* Actor);
	void Client_ShowActionTimerWidget(float Timeout, enum class EWTLActionTimerWidgetType Type, enum class EWTLCountdownSliderWidgetFillingType FillingType);
	void Client_SetDeathFromAnomaly(bool DeathFromAnomaly, bool ShowAllMeshes, bool DeathSimulatePhysics);
	void Client_SetAllMeshesVisible(bool bVisible);
	void Client_SetAdminGodMode(bool Value);
	void Client_SetAdminDropMode(bool Value);
	void Client_SelectSlot(uint8 SlotNumber, bool AllowReselect, bool Force);
	void Client_ResetCurrentInteractiveObjetHighlight();
	void Client_ResetAimMode();
	void Client_RadiationDetectorSignal(float Power);
	void Client_OnUsePortalError();
	void Client_OnUsePortal();
	void Client_OnStuffPlacementMode(uint16 StuffID);
	void Client_OnPostSelectSlot(uint8 SlotNumber);
	void Client_OnPosses(uint64 PossesedCharacterID);
	void Client_OnPlaceableStuffUsed(class AActor* Actor);
	void Client_OnMedicineApplied(uint16 MedicineID);
	void Client_OnItemUnequipped();
	void Client_OnItemEquipped();
	void Client_OnHideItem();
	void Client_OnEventZoneLeave(class AWTLEventPoint* EventPoint);
	void Client_OnEventZoneFinished(class AWTLEventPoint* EventPoint, bool Successful);
	void Client_OnEventZoneEnter(class AWTLEventPoint* EventPoint, bool ShowInformer);
	void Client_OnEquipmentItemStateChanged(uint16 StuffID, bool bIsEnabled);
	void Client_OnEffectRemoved(enum class EWTLCharacterEffectType EffectType);
	void Client_OnEffectAdded(enum class EWTLCharacterEffectType EffectType);
	void Client_OnCharacterUsed();
	void Client_OnBulletFlyNear(const struct FVector_NetQuantize& Position, enum class EWTLCaliber Caliber);
	void Client_NDPDetectorSignal(float Power);
	void Client_LockInputUnequipUsableItemAndUse();
	void Client_HideActionTimerWidget(bool Success);
	void Client_EffectCameraManager(float AddVingette, float AddFringe, bool IsHideUsableItem, bool RemoveAiming);
	void Client_CoreHacking_Result(uint8 Result);
	void Client_ClearChat();
	void Client_ApplyHearingDamage(float Duration, float Falloff);
	void Client_AddMarkers(TArray<struct FWTLMarkerMemoryElement>& Markers);
	void CleanMotionVector();
	void ChickenStatusDelta(int32 Delta);
	bool CharacterStunned();
	bool CanSpawnOnSafeZone();
	void CancelQTE(bool bIsFromClientside);
	void Broadcast_SetAllMeshesVisible(bool bVisible);
	void Broadcast_PlayMontage(class UAnimMontage* MontageToPlay, bool BlockInput);
	void Broadcast_OnStunhit(enum class EWTLCharacterStunhitDirection StunhitDirection);
	bool BPHavePremium();
	class FString BPGetCharacterName();
	int64 BPGetCharacterID();
	bool AvailableNear();
	bool AvailableForPursuit();
	void ApplyHearingDamage(float Duration, float Falloff);
	void ApplyEffectToCharacter(enum class EWTLCharacterEffectType EffectType, float Value);
	void AllLevelsLoadedAtStart();
	bool AIInterface_IsInSafeZone();
	bool AIInterface_IsCanBeAttacked(enum class EWTLFaction InstigatorFaction);
	bool AIInterface_IsAlive();
	struct FVector AIInterface_GetVelocity();
	int32 AIInterface_GetGroupID();
	enum class EWTLFaction AIInterface_GetFaction();
};

// 0x8 (0x30 - 0x28)
// Class WTL.WTLAnimationMetaData
class UWTLAnimationMetaData : public UAnimMetaData
{
public:
	bool                                         bShouldReplaceAnimInstance;                        // 0x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1832[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RagdollBlendWeight;                                // 0x2C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UWTLAnimationMetaData* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class WTL.WTLRootMotionAnimationMetaData
class UWTLRootMotionAnimationMetaData : public UAnimMetaData
{
public:
	enum class EWTLRootMotionControlLockingType  RootMotionControllerLockingType;                   // 0x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1833[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLRootMotionAnimationMetaData* GetDefaultObj();

};

// 0x10 (0x38 - 0x28)
// Class WTL.WTLCameraLimitsAnimationMetaData
class UWTLCameraLimitsAnimationMetaData : public UAnimMetaData
{
public:
	float                                        YawLimit;                                          // 0x28(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinPitchLimit;                                     // 0x2C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxPitchLimit;                                     // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1834[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLCameraLimitsAnimationMetaData* GetDefaultObj();

};

// 0x10 (0x38 - 0x28)
// Class WTL.WTLCameraStyleAnimationMetaData
class UWTLCameraStyleAnimationMetaData : public UAnimMetaData
{
public:
	class FName                                  CameraStyle;                                       // 0x28(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FreeCameraDistance;                                // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1835[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLCameraStyleAnimationMetaData* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class WTL.WTLPawnRotationLockingAnimationMetaData
class UWTLPawnRotationLockingAnimationMetaData : public UAnimMetaData
{
public:
	bool                                         bOverrideUseControllerPitch;                       // 0x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bNewUseControllerPitchValue;                       // 0x29(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideUseControllerYaw;                         // 0x2A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bNewUseControllerYawValue;                         // 0x2B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideUseControllerRoll;                        // 0x2C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bNewUseControllerRollValue;                        // 0x2D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1836[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLPawnRotationLockingAnimationMetaData* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class WTL.WTLSpecialStatesAnimationMetaData
class UWTLSpecialStatesAnimationMetaData : public UAnimMetaData
{
public:
	bool                                         bOverrideCrouchState;                              // 0x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bNewCrouchState;                                   // 0x29(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLockMovement;                                     // 0x2A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         BlockCameraRotation;                               // 0x2B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1837[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLSpecialStatesAnimationMetaData* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class WTL.WTLPawnCapsuleCollisionRemover
class UWTLPawnCapsuleCollisionRemover : public UAnimMetaData
{
public:

	static class UClass* StaticClass();
	static class UWTLPawnCapsuleCollisionRemover* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class WTL.WTLPawnInVehicleMetaData
class UWTLPawnInVehicleMetaData : public UAnimMetaData
{
public:
	bool                                         bShowCharacterMesh;                                // 0x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideMeshIfMontageEnded;                           // 0x29(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1839[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UWTLPawnInVehicleMetaData* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class WTL.WTLResetLowerBodyRotationAnimationMetaData
class UWTLResetLowerBodyRotationAnimationMetaData : public UAnimMetaData
{
public:

	static class UClass* StaticClass();
	static class UWTLResetLowerBodyRotationAnimationMetaData* GetDefaultObj();

};

// 0xCE8 (0xFA0 - 0x2B8)
// Class WTL.WTLCharacterBodyAnimInstance
class UWTLCharacterBodyAnimInstance : public UAnimInstance
{
public:
	uint8                                        Pad_183C[0x48];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWTLCharacterAnimInstanceProxy        CharacterProxy;                                    // 0x300(0x770)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPrivate)
	TMap<uint16, uint16>                         WeaponItemRemap;                                   // 0xA70(0x50)(Edit, NativeAccessSpecifierPublic)
	TMap<uint16, uint16>                         StuffItemRemap;                                    // 0xAC0(0x50)(Edit, NativeAccessSpecifierPublic)
	bool                                         IsFirstPerson;                                     // 0xB10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLSex                           CharacterSex;                                      // 0xB11(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_183D[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LookDirection;                                     // 0xB14(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraAimOffset;                                   // 0xB20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraAimOffsetInterpSpeedMultiplier;              // 0xB24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MoveDirection;                                     // 0xB28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SnuggleValue;                                      // 0xB2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MovementSpeed;                                     // 0xB30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VelocityZ;                                         // 0xB34(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BodyTilt;                                          // 0xB38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsInAir;                                          // 0xB3C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsUnderWater;                                     // 0xB3D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsInWater;                                        // 0xB3E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMovesOnWater;                                     // 0xB3F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsAiming;                                         // 0xB40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsCrouch;                                         // 0xB41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsProne;                                          // 0xB42(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsJumping;                                        // 0xB43(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsSprinting;                                      // 0xB44(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsLadderClimbing;                                 // 0xB45(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_183E[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               InputVector;                                       // 0xB48(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MoveSpeedValue;                                    // 0xB54(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MoveTurnValue;                                     // 0xB58(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLCharacterMoveState            MovementState;                                     // 0xB5C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_183F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HoldingBreath;                                     // 0xB60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StaminaValue;                                      // 0xB64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TirednessValue;                                    // 0xB68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TirednessValueMultiplier;                          // 0xB6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveVector*                          AnimationCurve;                                    // 0xB70(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              CurrentWeaponRotation;                             // 0xB78(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	enum class EWTLHandsState                    HandsState;                                        // 0xB84(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1840[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ItemEquipTime;                                     // 0xB88(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ItemUnequipTime;                                   // 0xB8C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LeftHandThumbInputUp;                              // 0xB90(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LeftHandThumbInputRight;                           // 0xB94(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CanUseHandsLocomotion;                             // 0xB98(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1841[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  IKRightFootAlphaCurveName;                         // 0xB9C(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  IKLeftFootAlphaCurveName;                          // 0xBA4(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  IKRightKneeSocketName;                             // 0xBAC(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  IKLeftKneeSocketName;                              // 0xBB4(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IKHipInterpSpeed;                                  // 0xBBC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IKEffectorPositionInterpSpeed;                     // 0xBC0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IKAlphaInterpSpeed;                                // 0xBC4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IKFootNormalInterpSpeed;                           // 0xBC8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IKHipOffset;                                       // 0xBCC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1842[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        IKFloorTraceValue;                                 // 0xBD4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               IKHipTarget;                                       // 0xBD8(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               IKRightFootEffectorPosition;                       // 0xBE4(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1843[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               IKLeftFootEffectorPosition;                        // 0xBFC(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1844[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               IKRightKneePosition;                               // 0xC14(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               IKLeftKneePosition;                                // 0xC20(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               IKRightFootNormal;                                 // 0xC2C(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1845[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               IKLeftFootNormal;                                  // 0xC44(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1846[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIKRightFootHit;                                   // 0xC5C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIKLeftFootHit;                                    // 0xC5D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1847[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        IKRightFootAlpha;                                  // 0xC60(0x4)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IKLeftFootAlpha;                                   // 0xC64(0x4)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  IKHandsOffsetBoneName;                             // 0xC68(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                            IKHandsOffsetBoneTransform;                        // 0xC70(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        UsableItemID;                                      // 0xCA0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LastUsableItemID;                                  // 0xCA4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLItemType                      UsableItemType;                                    // 0xCA8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1848[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                UsableItemAnimationFloatParameters;                // 0xCB0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                       UsableItemAnimationVectorParameters;               // 0xCC0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                               HandsOffset;                                       // 0xCD0(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLWeaponType                    CurrentWeaponType;                                 // 0xCDC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1849[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RotationSpeedVertical;                             // 0xCE0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               RecoilTranslation;                                 // 0xCE4(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RecoilRotation;                                    // 0xCF0(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_184A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequence*                         IdleAnimation;                                     // 0xD00(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                         SnuggleAnimation;                                  // 0xD08(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace1D*                AimOffsetBlendSpace;                               // 0xD10(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               AimingHandsTranslation;                            // 0xD18(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               AimingHandsOffset;                                 // 0xD24(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               MissileSocketOffset;                               // 0xD30(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ThumbLOffset;                                      // 0xD3C(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ThumbROffset;                                      // 0xD48(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FirstSwingingAnimAlphaScaleParameter;              // 0xD54(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SecondSwingingAnimAlphaScaleParameter;             // 0xD58(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ThirdPersonSwingingAnimAlphaParameter;             // 0xD5C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FirstPersonSwingingAnimAlphaParameter;             // 0xD60(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CombatBreathAnimPlayRateScaleParameter;            // 0xD64(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CombatBreathAnimPlayRateMaxValueParameter;         // 0xD68(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CombatBreathAnimPlayRateMinValueParameter;         // 0xD6C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ThirdPersonCombatBreathAnimAimingAlphaMaxValueParameter; // 0xD70(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ThirdPersonCombatBreathAnimAimingAlphaMinValueParameter; // 0xD74(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FirstPersonCombatBreathAnimAlphaParameter;         // 0xD78(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ThirdPersonWeaponRotationAnimAlphaParameter;       // 0xD7C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FirstPersonWeaponRotationAnimStaminaAlphaMinValueParameter; // 0xD80(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FirstPersonWeaponRotationAnimStaminaAlphaMaxValueParameter; // 0xD84(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FirstPersonWeaponRotationAnimAimingAlphaMinValueParameter; // 0xD88(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FirstPersonWeaponRotationAnimAimingAlphaMaxValueParameter; // 0xD8C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponRotationLocomotionAimingAlphaMinValueParameter; // 0xD90(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponRotationLocomotionAimingAlphaMaxValueParameter; // 0xD94(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponRotationLocomotionHoldingBreathAlphaMinValueParameter; // 0xD98(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponRotationLocomotionHoldingBreathAlphaMaxValueParameter; // 0xD9C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  RightPocketLocationSocketName;                     // 0xDA0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  LeftPocketLocationSocketName;                      // 0xDA8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  LeftJointTargetSocketName;                         // 0xDB0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  RightJointTargetSocketName;                        // 0xDB8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AimingRecoilAlphaMinValueParameter;                // 0xDC0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AimingRecoilAlphaMaxValueParameter;                // 0xDC4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ThirdPersonStaminaValueAnimPlayRateMinValueParameter; // 0xDC8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ThirdPersonStaminaValueAnimPlayRateMaxValueParameter; // 0xDCC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponRotationAimOffsetVelocityMinValueParameter;  // 0xDD0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponRotationAimOffsetVelocityMaxValueParameter;  // 0xDD4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StaminaInterpolationSpeed;                         // 0xDD8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NonSprintingSpeedTreshold;                         // 0xDDC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               FloorNormal;                                       // 0xDE0(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DotPCapsule;                                       // 0xDEC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DotPRightFoot;                                     // 0xDF0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DotPLeftFoot;                                      // 0xDF4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ForwardVelocity;                                   // 0xDF8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SideVelocity;                                      // 0xDFC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LowerBodyRelativeAngle;                            // 0xE00(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LowerBodyFixedRelativeAngle;                       // 0xE04(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLCharacterAnimationInstanceMovementState LocomotionState;                                   // 0xE08(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_184B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RotationSpeedHorizontalWithDirection;              // 0xE0C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OneMinusIsNoMovementCurveValue;                    // 0xE10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OneMinusEmptyHandsCurveValue;                      // 0xE14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AimingRecoilAlpha;                                 // 0xE18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ThirdPersonStaminaValueAnimPlayRate;               // 0xE1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IsNotFirstPersonAlpha;                             // 0xE20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponRotationAimOffsetForwardVelocity;            // 0xE24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponRotationAimOffsetSideVelocity;               // 0xE28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CombatBreathAnimPlayRate;                          // 0xE2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CombatBreathAnimAlpha;                             // 0xE30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
