// Class WTL.EQSTest_AwayFromAllPawns
// Size: 0x1f8 (Inherited: 0x1f8)
struct UEQSTest_AwayFromAllPawns : UEnvQueryTest {
};

// Class WTL.EQSTest_IsAlive
// Size: 0x200 (Inherited: 0x1f8)
struct UEQSTest_IsAlive : UEnvQueryTest {
	bool IsAITargetInterface; // 0x1f8(0x01)
	char pad_1F9[0x7]; // 0x1f9(0x07)
};

// Class WTL.EQSTest_IsOnTheGround
// Size: 0x1f8 (Inherited: 0x1f8)
struct UEQSTest_IsOnTheGround : UEnvQueryTest {
};

// Class WTL.EQSTest_PointBehindTheEnemy
// Size: 0x1f8 (Inherited: 0x1f8)
struct UEQSTest_PointBehindTheEnemy : UEnvQueryTest {
};

// Class WTL.EQSTest_TraceChannel
// Size: 0x2d8 (Inherited: 0x1f8)
struct UEQSTest_TraceChannel : UEnvQueryTest {
	struct FEnvTraceData TraceData; // 0x1f8(0x30)
	struct FAIDataProviderBoolValue TraceFromContext; // 0x228(0x38)
	struct FAIDataProviderFloatValue ItemHeightOffset; // 0x260(0x38)
	struct FAIDataProviderFloatValue ContextHeightOffset; // 0x298(0x38)
	struct UEnvQueryContext* Context; // 0x2d0(0x08)
};

// Class WTL.EQSTest_VisibilityCone
// Size: 0x1f8 (Inherited: 0x1f8)
struct UEQSTest_VisibilityCone : UEnvQueryTest {
};

// Class WTL.WTL3DActorHealth
// Size: 0x298 (Inherited: 0x260)
struct UWTL3DActorHealth : UUserWidget {
	struct UProgressBar* pbActorHealth; // 0x260(0x08)
	struct FLinearColor HealthBarFillNormalColor; // 0x268(0x10)
	struct FLinearColor HealthBarFillWarningColor; // 0x278(0x10)
	struct FLinearColor HealthBarFillDangerColor; // 0x288(0x10)

	void SetActorHealth(float CurrentHealth, float MaxHealth); // Function WTL.WTL3DActorHealth.SetActorHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x1772f20
};

// Class WTL.WTL3DActorName
// Size: 0x270 (Inherited: 0x260)
struct UWTL3DActorName : UUserWidget {
	struct UTextBlock* tbActorName; // 0x260(0x08)
	char pad_268[0x8]; // 0x268(0x08)

	void SetActorNameText(struct FString ActorName); // Function WTL.WTL3DActorName.SetActorNameText // (Final|Native|Public|BlueprintCallable) // @ game+0x1773250
};

// Class WTL.WTL3DMobileStartPointParameters
// Size: 0x268 (Inherited: 0x260)
struct UWTL3DMobileStartPointParameters : UUserWidget {
	struct UProgressBar* pbPoint; // 0x260(0x08)
};

// Class WTL.WTL3DMonsterIdentity
// Size: 0x288 (Inherited: 0x270)
struct UWTL3DMonsterIdentity : UWTL3DActorName {
	struct UImage* imgIndicator; // 0x270(0x08)
	struct UProgressBar* pbHealth; // 0x278(0x08)
	struct UTextBlock* tbLevel; // 0x280(0x08)
};

// Class WTL.WTL3DMonsterName
// Size: 0x270 (Inherited: 0x270)
struct UWTL3DMonsterName : UWTL3DActorName {

	void SetMonsterLevelText(int32_t MonsterLevel); // Function WTL.WTL3DMonsterName.SetMonsterLevelText // (Final|Native|Public|BlueprintCallable) // @ game+0x17736c0
};

// Class WTL.WTL3DPlayerIdentity
// Size: 0x298 (Inherited: 0x270)
struct UWTL3DPlayerIdentity : UWTL3DActorName {
	char pad_270[0x8]; // 0x270(0x08)
	struct UImage* imgTeamLead; // 0x278(0x08)
	struct UProgressBar* pbHealth; // 0x280(0x08)
	struct UTextBlock* tbLevel; // 0x288(0x08)
	struct UBorder* bHealth; // 0x290(0x08)
};

// Class WTL.WTLAchievementSystem
// Size: 0x30 (Inherited: 0x28)
struct UWTLAchievementSystem : UObject {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class WTL.WTLActionGameplayActivity
// Size: 0x250 (Inherited: 0x220)
struct AWTLActionGameplayActivity : AActor {
	char pad_220[0x8]; // 0x220(0x08)
	struct TSoftClassPtr<UObject> ItemPreview; // 0x228(0x28)
};

// Class WTL.WTLFortificationObject
// Size: 0x270 (Inherited: 0x220)
struct AWTLFortificationObject : AActor {
	char pad_220[0x20]; // 0x220(0x20)
	int32_t ID; // 0x240(0x04)
	enum class EWTLFortificationObjectType Type; // 0x244(0x01)
	char SlotCount; // 0x245(0x01)
	bool NeedSaveState; // 0x246(0x01)
	char pad_247[0x1]; // 0x247(0x01)
	float SaveInterval; // 0x248(0x04)
	char pad_24C[0x4]; // 0x24c(0x04)
	uint64_t CharacterID; // 0x250(0x08)
	uint64_t CharacterGroupID; // 0x258(0x08)
	uint16_t CharacterClanID; // 0x260(0x02)
	enum class EWTLFaction Faction; // 0x262(0x01)
	char pad_263[0x1]; // 0x263(0x01)
	int32_t Condition; // 0x264(0x04)
	float Energy; // 0x268(0x04)
	char pad_26C[0x4]; // 0x26c(0x04)
};

// Class WTL.WTLActionGameplayMachinegun
// Size: 0x400 (Inherited: 0x270)
struct AWTLActionGameplayMachinegun : AWTLFortificationObject {
	char pad_270[0x10]; // 0x270(0x10)
	struct FWTLStorageContent m_StorageContent; // 0x280(0xa8)
	struct FRotator MachinegunRotation; // 0x328(0x0c)
	char pad_334[0x4]; // 0x334(0x04)
	struct UStaticMeshComponent* StandMesh; // 0x338(0x08)
	struct USkeletalMeshComponent* Mesh; // 0x340(0x08)
	struct UFMODAudioComponent* ShootAudioComponent; // 0x348(0x08)
	struct FText MachinegunName; // 0x350(0x18)
	int32_t WeaponID; // 0x368(0x04)
	int32_t FireRate; // 0x36c(0x04)
	float TemperatureIncreasingPerShot; // 0x370(0x04)
	float OverheatTemperature; // 0x374(0x04)
	float TemperatureToStartFire; // 0x378(0x04)
	float TemperatureCooldownPerSecond; // 0x37c(0x04)
	float OverheatAccuracy; // 0x380(0x04)
	float RotationSpeed; // 0x384(0x04)
	int32_t MaxAmmoWeight; // 0x388(0x04)
	struct FWTLCameraLimits CameraLimits; // 0x38c(0x0c)
	char pad_398[0x10]; // 0x398(0x10)
	struct AWTLCharacter* m_CurrentCharacter; // 0x3a8(0x08)
	char pad_3B0[0x10]; // 0x3b0(0x10)
	float m_CurrentTemperatureOverheat; // 0x3c0(0x04)
	bool m_bIsCoolingDown; // 0x3c4(0x01)
	char pad_3C5[0x13]; // 0x3c5(0x13)
	bool bIsInUse; // 0x3d8(0x01)
	bool bIsInAction; // 0x3d9(0x01)
	char pad_3DA[0x26]; // 0x3da(0x26)

	void SetEnabled(bool Value); // Function WTL.WTLActionGameplayMachinegun.SetEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x1773b90
	void OnUse(); // Function WTL.WTLActionGameplayMachinegun.OnUse // (Final|Native|Private) // @ game+0x1773ed0
	void OnStorageCheck(); // Function WTL.WTLActionGameplayMachinegun.OnStorageCheck // (Final|Native|Private) // @ game+0x1773d70
	void OnRep_StorageContent(); // Function WTL.WTLActionGameplayMachinegun.OnRep_StorageContent // (Final|Native|Private) // @ game+0x1774050
	void OnRep_MachinegunRortation(); // Function WTL.WTLActionGameplayMachinegun.OnRep_MachinegunRortation // (Final|Native|Private) // @ game+0xe77850
	void OnRep_IsInUse(); // Function WTL.WTLActionGameplayMachinegun.OnRep_IsInUse // (Final|Native|Private) // @ game+0xe77850
	void OnRep_bIsAction(); // Function WTL.WTLActionGameplayMachinegun.OnRep_bIsAction // (Final|Native|Private) // @ game+0x1773d50
	void OnLocalClientAcion(); // Function WTL.WTLActionGameplayMachinegun.OnLocalClientAcion // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnClientUsageStop(); // Function WTL.WTLActionGameplayMachinegun.OnClientUsageStop // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnClientUsageStart(); // Function WTL.WTLActionGameplayMachinegun.OnClientUsageStart // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	float GetPauseBetweenShots(); // Function WTL.WTLActionGameplayMachinegun.GetPauseBetweenShots // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1773c50
	float GetOverheatSafeTemperature(); // Function WTL.WTLActionGameplayMachinegun.GetOverheatSafeTemperature // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1773c90
	float GetOverheatPercent(); // Function WTL.WTLActionGameplayMachinegun.GetOverheatPercent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1773cc0
	struct USkeletalMeshComponent* GetMesh(); // Function WTL.WTLActionGameplayMachinegun.GetMesh // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1773d30
	bool GetIsInAction(); // Function WTL.WTLActionGameplayMachinegun.GetIsInAction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1773cf0
	bool GetIsCoolingDown(); // Function WTL.WTLActionGameplayMachinegun.GetIsCoolingDown // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1773c70
	struct AWTLCharacter* GetCurrentCharacter(); // Function WTL.WTLActionGameplayMachinegun.GetCurrentCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1773a30
	void FillAmmo(int32_t AmmoID, int32_t Count); // Function WTL.WTLActionGameplayMachinegun.FillAmmo // (Final|Native|Public|BlueprintCallable) // @ game+0x1773a50
};

// Class WTL.WTLActionGameplayObjectInterface
// Size: 0x28 (Inherited: 0x28)
struct UWTLActionGameplayObjectInterface : UInterface {

	void SelectPreviousSlot(struct AWTLCharacter* Character); // Function WTL.WTLActionGameplayObjectInterface.SelectPreviousSlot // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1774ab0
	void SelectNextSlot(struct AWTLCharacter* Character); // Function WTL.WTLActionGameplayObjectInterface.SelectNextSlot // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1774b90
	void OnCharacterStartActionWithGameplayObject(struct AWTLCharacter* Character); // Function WTL.WTLActionGameplayObjectInterface.OnCharacterStartActionWithGameplayObject // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1774ec0
	void OnCharacterFinishActionWithGameplayObject(struct AWTLCharacter* Character); // Function WTL.WTLActionGameplayObjectInterface.OnCharacterFinishActionWithGameplayObject // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1774de0
	void MainUseStart(struct AWTLCharacter* Character); // Function WTL.WTLActionGameplayObjectInterface.MainUseStart // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1774c70
	float GetDesiredFOV(); // Function WTL.WTLActionGameplayObjectInterface.GetDesiredFOV // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1774d80
	bool CanStopAction(); // Function WTL.WTLActionGameplayObjectInterface.CanStopAction // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1774fa0
	bool CanStartActionWithItemInHands(struct AWTLUsable* ItemInHands); // Function WTL.WTLActionGameplayObjectInterface.CanStartActionWithItemInHands // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1775000
	bool CanStartActionRightNow(); // Function WTL.WTLActionGameplayObjectInterface.CanStartActionRightNow // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1774fd0
	bool CanDrawDotPointer(); // Function WTL.WTLActionGameplayObjectInterface.CanDrawDotPointer // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1774d50
	bool CanChangeItemInArmsWhenActionInProgress(); // Function WTL.WTLActionGameplayObjectInterface.CanChangeItemInArmsWhenActionInProgress // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1774db0
};

// Class WTL.WTLAnomaly
// Size: 0x230 (Inherited: 0x220)
struct AWTLAnomaly : AActor {
	char pad_220[0x8]; // 0x220(0x08)
	bool CharacterCanUseVehicleInside; // 0x228(0x01)
	char pad_229[0x7]; // 0x229(0x07)

	void TeleportCharacterToRandomPointInRange(struct AWTLCharacter* Character, float MinRange, float MaxRange, enum class EWTLAnomalyActionResult& Result); // Function WTL.WTLAnomaly.TeleportCharacterToRandomPointInRange // (Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x177e610
	void TeleportCharacterToRandomPointArray(struct AWTLCharacter* Character, struct TArray<struct FVector> Locations, enum class EWTLAnomalyActionResult& Result); // Function WTL.WTLAnomaly.TeleportCharacterToRandomPointArray // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x177e850
	void TeleportCharacterToPoint(struct AWTLCharacter* Character, struct FVector Location, enum class EWTLAnomalyActionResult& Result); // Function WTL.WTLAnomaly.TeleportCharacterToPoint // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x177eac0
	void OnEMPGrenadeExplosion(); // Function WTL.WTLAnomaly.OnEMPGrenadeExplosion // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void IsCharacterHoldingBreath(struct AWTLCharacter* Character, enum class EWTLAnomalyCheckResult& Result); // Function WTL.WTLAnomaly.IsCharacterHoldingBreath // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x177fd60
	void ApplyRadialDamage(float DamageValue, struct FVector DamageOrigin, float DamageRadius, struct UDamageType* DamageTypeClass, enum class EWTLAnomalyActionResult& Result); // Function WTL.WTLAnomaly.ApplyRadialDamage // (Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x177ec80
	void AddEffectToCharacterWithFalloff(struct AWTLCharacter* Character, enum class EWTLCharacterEffectType EffectType, float EffectValue, struct FVector Origin, float FalloffRadius, float MinEffectValue, enum class EWTLAnomalyActionResult& Result); // Function WTL.WTLAnomaly.AddEffectToCharacterWithFalloff // (Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x177f460
	void AddEffectToCharactersWithFalloff(struct TArray<struct AWTLCharacter*> Characters, enum class EWTLCharacterEffectType EffectType, float EffectValue, struct FVector Origin, float FalloffRadius, float MinEffectValue, enum class EWTLAnomalyActionResult& Result); // Function WTL.WTLAnomaly.AddEffectToCharactersWithFalloff // (Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x177f010
	void AddEffectToCharacters(struct TArray<struct AWTLCharacter*> Characters, enum class EWTLCharacterEffectType EffectType, float EffectValue, enum class EWTLAnomalyActionResult& Result); // Function WTL.WTLAnomaly.AddEffectToCharacters // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x177f820
	void AddEffectToCharacter(struct AWTLCharacter* Character, enum class EWTLCharacterEffectType EffectType, float EffectValue, enum class EWTLAnomalyActionResult& Result); // Function WTL.WTLAnomaly.AddEffectToCharacter // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x177fb10
};

// Class WTL.WTLStaticAnomaly
// Size: 0x260 (Inherited: 0x230)
struct AWTLStaticAnomaly : AWTLAnomaly {
	char pad_230[0x28]; // 0x230(0x28)
	struct UStaticMeshComponent* ActivationVolume; // 0x258(0x08)

	void OnThrowingDeviceProjectileEnter(struct AWTLThrowingDeviceProjectile* ThrowingDeviceProjectile); // Function WTL.WTLStaticAnomaly.OnThrowingDeviceProjectileEnter // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnNutLeave(struct AWTLNut* Nut); // Function WTL.WTLStaticAnomaly.OnNutLeave // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnNutEnter(struct AWTLNut* Nut); // Function WTL.WTLStaticAnomaly.OnNutEnter // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnMonsterLeave(struct AWTLMonsterPawn* Monster); // Function WTL.WTLStaticAnomaly.OnMonsterLeave // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnMonsterEnter(struct AWTLMonsterPawn* Monster); // Function WTL.WTLStaticAnomaly.OnMonsterEnter // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function WTL.WTLStaticAnomaly.OnEndOverlap // (Final|Native|Private) // @ game+0x17dfe30
	void OnCharacterLeave(struct AWTLCharacter* Character); // Function WTL.WTLStaticAnomaly.OnCharacterLeave // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnCharacterEnter(struct AWTLCharacter* Character); // Function WTL.WTLStaticAnomaly.OnCharacterEnter // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function WTL.WTLStaticAnomaly.OnBeginOverlap // (Final|Native|Private|HasOutParms) // @ game+0x17e0080
	struct TArray<struct AWTLMonsterPawn*> GetMonstersInVolume(); // Function WTL.WTLStaticAnomaly.GetMonstersInVolume // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1864d80
	struct TArray<struct AWTLCharacter*> GetCharactersInVolume(); // Function WTL.WTLStaticAnomaly.GetCharactersInVolume // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1864e40
};

// Class WTL.WTLActivatableAnomaly
// Size: 0x298 (Inherited: 0x260)
struct AWTLActivatableAnomaly : AWTLStaticAnomaly {
	char pad_260[0x10]; // 0x260(0x10)
	float MinEnergy; // 0x270(0x04)
	float MaxEnergy; // 0x274(0x04)
	float EnergyPerSecond; // 0x278(0x04)
	float Energy; // 0x27c(0x04)
	enum class EWTLActivatableAnomalyState State; // 0x280(0x01)
	char pad_281[0x3]; // 0x281(0x03)
	float EnergyToActivate; // 0x284(0x04)
	float ActivationDelay; // 0x288(0x04)
	float StayActivatedTime; // 0x28c(0x04)
	float EnergyDecrementAfterActivation; // 0x290(0x04)
	char pad_294[0x4]; // 0x294(0x04)

	void ServerOnActivated(); // Function WTL.WTLActivatableAnomaly.ServerOnActivated // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnRep_State(); // Function WTL.WTLActivatableAnomaly.OnRep_State // (Final|Native|Private) // @ game+0x17756e0
	void OnRep_Energy(); // Function WTL.WTLActivatableAnomaly.OnRep_Energy // (Final|Native|Private) // @ game+0x1775750
	void OnEnergyChanged(float EnergyValue); // Function WTL.WTLActivatableAnomaly.OnEnergyChanged // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void ClientOnBeginActivate(); // Function WTL.WTLActivatableAnomaly.ClientOnBeginActivate // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void ClientOnActivated(); // Function WTL.WTLActivatableAnomaly.ClientOnActivated // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
};

// Class WTL.WTLMovingAnomaly
// Size: 0x2c8 (Inherited: 0x230)
struct AWTLMovingAnomaly : AWTLAnomaly {
	char pad_230[0x40]; // 0x230(0x40)
	struct TArray<struct FVector> WayPoints; // 0x270(0x10)
	struct AWTLAnomalyWayPoint* StartWayPoint; // 0x280(0x08)
	enum class EWTLWayPointMovingType MovingType; // 0x288(0x01)
	char pad_289[0x3]; // 0x289(0x03)
	float MinSpeed; // 0x28c(0x04)
	float MaxSpeed; // 0x290(0x04)
	float PositionSynchronizationInterval; // 0x294(0x04)
	char pad_298[0x8]; // 0x298(0x08)
	struct FVector_NetQuantize m_CurrentWayPointPosition; // 0x2a0(0x0c)
	float m_CurrentSpeed; // 0x2ac(0x04)
	struct FVector m_SynchronizationPosition; // 0x2b0(0x0c)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	struct UStaticMeshComponent* ActivationVolume; // 0x2c0(0x08)

	void OnRep_SynchronizationPosition(); // Function WTL.WTLMovingAnomaly.OnRep_SynchronizationPosition // (Final|Native|Protected) // @ game+0x1864f00
	void OnNutLeave(struct AWTLNut* Nut); // Function WTL.WTLMovingAnomaly.OnNutLeave // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnNutEnter(struct AWTLNut* Nut); // Function WTL.WTLMovingAnomaly.OnNutEnter // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnNPCLeave(struct AWTLEnemyNPC* NPC); // Function WTL.WTLMovingAnomaly.OnNPCLeave // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnNPCEnter(struct AWTLEnemyNPC* NPC); // Function WTL.WTLMovingAnomaly.OnNPCEnter // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnMonsterLeave(struct AWTLMonsterPawn* Monster); // Function WTL.WTLMovingAnomaly.OnMonsterLeave // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnMonsterEnter(struct AWTLMonsterPawn* Monster); // Function WTL.WTLMovingAnomaly.OnMonsterEnter // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function WTL.WTLMovingAnomaly.OnEndOverlap // (Final|Native|Private) // @ game+0x17dfe30
	void OnCharacterLeave(struct AWTLCharacter* Character); // Function WTL.WTLMovingAnomaly.OnCharacterLeave // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnCharacterEnter(struct AWTLCharacter* Character); // Function WTL.WTLMovingAnomaly.OnCharacterEnter // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function WTL.WTLMovingAnomaly.OnBeginOverlap // (Final|Native|Private|HasOutParms) // @ game+0x17e0080
	struct TArray<struct AWTLEnemyNPC*> GetNPCInVolume(); // Function WTL.WTLMovingAnomaly.GetNPCInVolume // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1864cc0
	struct TArray<struct AWTLMonsterPawn*> GetMonstersInVolume(); // Function WTL.WTLMovingAnomaly.GetMonstersInVolume // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1864d80
	struct TArray<struct AWTLCharacter*> GetCharactersInVolume(); // Function WTL.WTLMovingAnomaly.GetCharactersInVolume // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1864e40
	struct TArray<struct AActor*> GetActorsInVolume(); // Function WTL.WTLMovingAnomaly.GetActorsInVolume // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1864c00
};

// Class WTL.WTLActivatableMovingAnomaly
// Size: 0x300 (Inherited: 0x2c8)
struct AWTLActivatableMovingAnomaly : AWTLMovingAnomaly {
	char pad_2C8[0x10]; // 0x2c8(0x10)
	float MinEnergy; // 0x2d8(0x04)
	float MaxEnergy; // 0x2dc(0x04)
	float EnergyPerSecond; // 0x2e0(0x04)
	float Energy; // 0x2e4(0x04)
	enum class EWTLActivatableAnomalyState State; // 0x2e8(0x01)
	char pad_2E9[0x3]; // 0x2e9(0x03)
	float EnergyToActivate; // 0x2ec(0x04)
	float ActivationDelay; // 0x2f0(0x04)
	float StayActivatedTime; // 0x2f4(0x04)
	float EnergyDecrementAfterActivation; // 0x2f8(0x04)
	char pad_2FC[0x4]; // 0x2fc(0x04)

	void ServerOnActivated(); // Function WTL.WTLActivatableMovingAnomaly.ServerOnActivated // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnRep_State(); // Function WTL.WTLActivatableMovingAnomaly.OnRep_State // (Final|Native|Private) // @ game+0x1775af0
	void OnRep_Energy(); // Function WTL.WTLActivatableMovingAnomaly.OnRep_Energy // (Final|Native|Private) // @ game+0x1775b60
	void OnEnergyChanged(float EnergyValue); // Function WTL.WTLActivatableMovingAnomaly.OnEnergyChanged // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void ClientOnBeginActivate(); // Function WTL.WTLActivatableMovingAnomaly.ClientOnBeginActivate // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void ClientOnActivated(); // Function WTL.WTLActivatableMovingAnomaly.ClientOnActivated // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
};

// Class WTL.WTLActivatableObject
// Size: 0x240 (Inherited: 0x220)
struct AWTLActivatableObject : AActor {
	char pad_220[0x18]; // 0x220(0x18)
	float PostActivationCooldown; // 0x238(0x04)
	float ActivationDelay; // 0x23c(0x04)

	void BP_NotifyActivationStarted(struct AWTLCharacter* Activator); // Function WTL.WTLActivatableObject.BP_NotifyActivationStarted // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void BP_DeactivateObject(struct AWTLCharacter* Activator); // Function WTL.WTLActivatableObject.BP_DeactivateObject // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	bool BP_CanBeActivated(); // Function WTL.WTLActivatableObject.BP_CanBeActivated // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1775fb0
	void BP_ActivateObject(struct AWTLCharacter* Activator); // Function WTL.WTLActivatableObject.BP_ActivateObject // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
};

// Class WTL.WTLActivatableObjectInterface
// Size: 0x28 (Inherited: 0x28)
struct UWTLActivatableObjectInterface : UInterface {
};

// Class WTL.WTLActivatorVolume
// Size: 0x280 (Inherited: 0x258)
struct AWTLActivatorVolume : AVolume {
	struct TArray<struct AWTLActivatableObject*> ObjectsToActivate; // 0x258(0x10)
	int32_t CharactersCountToActivate; // 0x268(0x04)
	char pad_26C[0x14]; // 0x26c(0x14)

	void OnEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function WTL.WTLActivatorVolume.OnEndOverlap // (Final|Native|Private) // @ game+0x1776210
	void OnBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function WTL.WTLActivatorVolume.OnBeginOverlap // (Final|Native|Private|HasOutParms) // @ game+0x1776590
};

// Class WTL.WTLAIAnimInstance
// Size: 0x300 (Inherited: 0x2c0)
struct UWTLAIAnimInstance : UAnimInstance {
	float VelocitySpeed; // 0x2c0(0x04)
	float ForwardSpeed; // 0x2c4(0x04)
	float RightSpeed; // 0x2c8(0x04)
	float UpSpeed; // 0x2cc(0x04)
	struct FVector Direction; // 0x2d0(0x0c)
	struct FRotator RotationDelta; // 0x2dc(0x0c)
	struct FVector VectorDelta; // 0x2e8(0x0c)
	char pad_2F4[0xc]; // 0x2f4(0x0c)
};

// Class WTL.WTLAICharacter
// Size: 0x970 (Inherited: 0x4c0)
struct AWTLAICharacter : ACharacter {
	char pad_4C0[0x1d8]; // 0x4c0(0x1d8)
	struct TMap<enum class EWTLWeaponType, float> WeaponTypeDamageMultipliers; // 0x698(0x50)
	enum class EPhysicalSurface PhysicalSurface; // 0x6e8(0x01)
	char Level; // 0x6e9(0x01)
	char pad_6EA[0x2]; // 0x6ea(0x02)
	float HeadArmor; // 0x6ec(0x04)
	float BodyArmor; // 0x6f0(0x04)
	float ArmsArmor; // 0x6f4(0x04)
	float LegsArmor; // 0x6f8(0x04)
	float FeetArmor; // 0x6fc(0x04)
	float LifespanAfterDeath; // 0x700(0x04)
	bool IsBurst; // 0x704(0x01)
	char PercentDamageBurst; // 0x705(0x01)
	char pad_706[0x2]; // 0x706(0x02)
	float TakeDamageBurst; // 0x708(0x04)
	char MinLevelBurst; // 0x70c(0x01)
	char MaxLevelBurst; // 0x70d(0x01)
	char pad_70E[0x2]; // 0x70e(0x02)
	struct FWTLStorageContent m_PublicStorageContent; // 0x710(0xa8)
	struct FWTLStorageContent m_SummaryStorageContent; // 0x7b8(0xa8)
	struct FWTLStorageContent m_PrivateStorageContent; // 0x860(0xa8)
	struct TArray<struct FWTLItemDropInfo> AdditionalLoot; // 0x908(0x10)
	char MaxLevel; // 0x918(0x01)
	char pad_919[0x3]; // 0x919(0x03)
	float ExperienceDropCountMultiplierDelta; // 0x91c(0x04)
	float ExperienceDropChanceMultiplierDelta; // 0x920(0x04)
	float m_MultiplierParameters; // 0x924(0x04)
	struct FVector m_LocationDead; // 0x928(0x0c)
	float m_Health; // 0x934(0x04)
	bool m_bIsInStealthMode; // 0x938(0x01)
	char pad_939[0x3]; // 0x939(0x03)
	int32_t AICharacterID; // 0x93c(0x04)
	char IDIcon; // 0x940(0x01)
	char pad_941[0x7]; // 0x941(0x07)
	struct UPhysicsAsset* MeshPhysicsAsset; // 0x948(0x08)
	struct FRotator OffsetRotationMesh; // 0x950(0x0c)
	float DangerLevel; // 0x95c(0x04)
	float KillZ; // 0x960(0x04)
	char pad_964[0xc]; // 0x964(0x0c)

	void SetStealthMode(bool Value); // Function WTL.WTLAICharacter.SetStealthMode // (Final|Native|Public|BlueprintCallable) // @ game+0x1777f60
	void SetSpawn(struct AWTLSpawnAICharacter* Value); // Function WTL.WTLAICharacter.SetSpawn // (Final|Native|Public|BlueprintCallable) // @ game+0x17775a0
	void SetLifetime(float Delta); // Function WTL.WTLAICharacter.SetLifetime // (Final|Native|Public|BlueprintCallable) // @ game+0x17776a0
	void SetLifespanAfterDeath(float Value); // Function WTL.WTLAICharacter.SetLifespanAfterDeath // (Final|Native|Public|BlueprintCallable) // @ game+0x17774d0
	void SetApplyWeaponTypeDamageMultipliers(bool Value); // Function WTL.WTLAICharacter.SetApplyWeaponTypeDamageMultipliers // (Final|Native|Public|BlueprintCallable) // @ game+0x1777830
	void OnRep_StorageContent(); // Function WTL.WTLAICharacter.OnRep_StorageContent // (Final|Native|Public) // @ game+0x1778070
	void OnRep_IsInStealthMode(); // Function WTL.WTLAICharacter.OnRep_IsInStealthMode // (Final|Native|Public) // @ game+0x1778090
	void OnRep_Health(); // Function WTL.WTLAICharacter.OnRep_Health // (Final|Native|Public) // @ game+0xe77850
	void NetMulticast_OnToDeath(struct FVector DeathPosition, struct FVector_NetQuantize ActorRotation, struct FVector_NetQuantize MeshRotation, struct FWTLAICharacterDeathData DeathData); // Function WTL.WTLAICharacter.NetMulticast_OnToDeath // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x1777940
	void NetMulticast_OnDeath(struct FVector DeathPosition, struct FVector_NetQuantize ActorRotation, struct FVector_NetQuantize MeshRotation, struct FWTLAICharacterDeathData DeathData); // Function WTL.WTLAICharacter.NetMulticast_OnDeath // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x1777c20
	void KillAiCharacter(); // Function WTL.WTLAICharacter.KillAiCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x1777f00
	void K2_OnToDeathEvent(struct FVector& DeathPosition, struct FVector_NetQuantize ActorRotation, struct FVector_NetQuantize MeshRotation, struct FWTLAICharacterDeathData DeathData); // Function WTL.WTLAICharacter.K2_OnToDeathEvent // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x1ad0090
	void K2_OnStealthModeChanged(bool Value); // Function WTL.WTLAICharacter.K2_OnStealthModeChanged // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void K2_OnDeathEvent(struct FWTLAICharacterDeathData DeathData); // Function WTL.WTLAICharacter.K2_OnDeathEvent // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void K2_OnBurst(struct FWTLAICharacterDeathData DeathData); // Function WTL.WTLAICharacter.K2_OnBurst // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	bool IsVisible(); // Function WTL.WTLAICharacter.IsVisible // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1777910
	bool IsApplyWeaponTypeDamageMultipliers(); // Function WTL.WTLAICharacter.IsApplyWeaponTypeDamageMultipliers // (Final|Native|Public|BlueprintCallable) // @ game+0x1777810
	bool IsAlive(); // Function WTL.WTLAICharacter.IsAlive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17777e0
	struct AWTLSpawnAICharacter* GetSpawn(); // Function WTL.WTLAICharacter.GetSpawn // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1777680
	float GetMaxHealth(); // Function WTL.WTLAICharacter.GetMaxHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1186200
	float GetHealth(); // Function WTL.WTLAICharacter.GetHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1777780
	float GetDangerLevel(); // Function WTL.WTLAICharacter.GetDangerLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17777a0
	int32_t GetAICharacterID(); // Function WTL.WTLAICharacter.GetAICharacterID // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x17777c0
};

// Class WTL.WTLAICharacterController
// Size: 0x520 (Inherited: 0x328)
struct AWTLAICharacterController : AAIController {
	char pad_328[0x8]; // 0x328(0x08)
	enum class ETraceTypeQuery CollisionTraceQuery; // 0x330(0x01)
	char pad_331[0x3]; // 0x331(0x03)
	float PredictionUpdatePeriod; // 0x334(0x04)
	char pad_338[0x1e8]; // 0x338(0x1e8)

	void OnTouchSenseUpdated(struct AActor* StimulusInstigator, struct FVector StimulusLocation, bool State); // Function WTL.WTLAICharacterController.OnTouchSenseUpdated // (Event|Public|HasDefaults|BlueprintEvent) // @ game+0x1ad0090
	void OnTeamSenseUpdated(struct AActor* StimulusInstigator, struct FVector StimulusLocation, bool State); // Function WTL.WTLAICharacterController.OnTeamSenseUpdated // (Event|Public|HasDefaults|BlueprintEvent) // @ game+0x1ad0090
	void OnSightSenseUpdated(struct AActor* StimulusInstigator, struct FVector StimulusLocation, bool State); // Function WTL.WTLAICharacterController.OnSightSenseUpdated // (Event|Public|HasDefaults|BlueprintEvent) // @ game+0x1ad0090
	void OnPredictionUpdate(); // Function WTL.WTLAICharacterController.OnPredictionUpdate // (Final|Native|Public) // @ game+0x17794e0
	void OnPredictionSenseUpdated(struct AActor* StimulusInstigator, struct FVector StimulusLocation, bool State); // Function WTL.WTLAICharacterController.OnPredictionSenseUpdated // (Event|Public|HasDefaults|BlueprintEvent) // @ game+0x1ad0090
	void OnPerceptionUpdated(struct TArray<struct AActor*>& UpdatedActors); // Function WTL.WTLAICharacterController.OnPerceptionUpdated // (Final|Native|Public|HasOutParms) // @ game+0x1779410
	void OnHearingSenseUpdated(struct AActor* StimulusInstigator, struct FVector StimulusLocation, bool State); // Function WTL.WTLAICharacterController.OnHearingSenseUpdated // (Event|Public|HasDefaults|BlueprintEvent) // @ game+0x1ad0090
	void OnDamageSenseUpdated(struct AActor* StimulusInstigator, struct FVector StimulusLocation, bool State, float Value); // Function WTL.WTLAICharacterController.OnDamageSenseUpdated // (Event|Public|HasDefaults|BlueprintEvent) // @ game+0x1ad0090
	void OnActorPerceptionUpdated(struct AActor* Actor, struct FAIStimulus Stimulus); // Function WTL.WTLAICharacterController.OnActorPerceptionUpdated // (Final|Native|Public) // @ game+0x17791f0
	struct AWTLAICharacter* GetMyPawn(); // Function WTL.WTLAICharacterController.GetMyPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1779500
};

// Class WTL.WTLAIDestroyObject
// Size: 0x240 (Inherited: 0x220)
struct AWTLAIDestroyObject : AActor {
	char pad_220[0x10]; // 0x220(0x10)
	float m_Condition; // 0x230(0x04)
	float m_MaxCondition; // 0x234(0x04)
	bool m_ObjectIsDestroyed; // 0x238(0x01)
	char pad_239[0x3]; // 0x239(0x03)
	float ActivationTime; // 0x23c(0x04)

	void OnChangeCondition(float DeltaCondition); // Function WTL.WTLAIDestroyObject.OnChangeCondition // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void BPUse(struct AWTLCharacter* Character); // Function WTL.WTLAIDestroyObject.BPUse // (Native|Event|Public|BlueprintEvent) // @ game+0x1779a60
	void BPSetHighlightState(bool Value); // Function WTL.WTLAIDestroyObject.BPSetHighlightState // (Native|Event|Public|BlueprintEvent) // @ game+0x1779890
	struct FString BPGetDisplayText(struct AWTLCharacter* Character); // Function WTL.WTLAIDestroyObject.BPGetDisplayText // (Native|Event|Public|BlueprintEvent) // @ game+0x1779760
	bool BPCanBeUsed(struct AWTLCharacter* Character); // Function WTL.WTLAIDestroyObject.BPCanBeUsed // (Native|Event|Public|BlueprintEvent) // @ game+0x1779970
	bool AIInterface_IsInSafeZone(); // Function WTL.WTLAIDestroyObject.AIInterface_IsInSafeZone // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1779c20
	bool AIInterface_IsCanBeAttacked(enum class EWTLFaction InstigatorFaction); // Function WTL.WTLAIDestroyObject.AIInterface_IsCanBeAttacked // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1779b40
	bool AIInterface_IsAlive(); // Function WTL.WTLAIDestroyObject.AIInterface_IsAlive // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1779d30
	struct FVector AIInterface_GetVelocity(); // Function WTL.WTLAIDestroyObject.AIInterface_GetVelocity // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1779ca0
	int32_t AIInterface_GetGroupID(); // Function WTL.WTLAIDestroyObject.AIInterface_GetGroupID // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1779cf0
	enum class EWTLFaction AIInterface_GetFaction(); // Function WTL.WTLAIDestroyObject.AIInterface_GetFaction // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1779c60
};

// Class WTL.WTLAIFlying
// Size: 0x970 (Inherited: 0x970)
struct AWTLAIFlying : AWTLAICharacter {
};

// Class WTL.WTLAIFlyingController
// Size: 0x520 (Inherited: 0x520)
struct AWTLAIFlyingController : AWTLAICharacterController {
};

// Class WTL.WTLAIMonsterPawn
// Size: 0x4c0 (Inherited: 0x4c0)
struct AWTLAIMonsterPawn : ACharacter {
};

// Class WTL.WTLAIPerceptionComponent
// Size: 0x190 (Inherited: 0x190)
struct UWTLAIPerceptionComponent : UAIPerceptionComponent {

	void SetSightVisionHalfAngle(float Angle); // Function WTL.WTLAIPerceptionComponent.SetSightVisionHalfAngle // (Final|Native|Public|BlueprintCallable) // @ game+0x177aae0
	void SetSightRadius(float Radius); // Function WTL.WTLAIPerceptionComponent.SetSightRadius // (Final|Native|Public|BlueprintCallable) // @ game+0x177ac20
	float GetSightRadius(); // Function WTL.WTLAIPerceptionComponent.GetSightRadius // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x177ad80
	float GetSenseHearingRange(); // Function WTL.WTLAIPerceptionComponent.GetSenseHearingRange // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x177ae30
	struct FVector GetSeenLocation(struct AActor* Actor); // Function WTL.WTLAIPerceptionComponent.GetSeenLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x177a7d0
	struct FVector GetPredictionLocation(struct AActor* Actor, float TimeSec); // Function WTL.WTLAIPerceptionComponent.GetPredictionLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x177a4e0
	bool GetIsSenseEnabled(struct UAISense* SenseClass); // Function WTL.WTLAIPerceptionComponent.GetIsSenseEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x177a8d0
};

// Class WTL.WTLAIPerceptionSystem
// Size: 0x130 (Inherited: 0x130)
struct UWTLAIPerceptionSystem : UAIPerceptionSystem {
};

// Class WTL.WTLInteractiveObject
// Size: 0x260 (Inherited: 0x220)
struct AWTLInteractiveObject : AActor {
	char pad_220[0x8]; // 0x220(0x08)
	struct FText m_LocalizationDisplayText; // 0x228(0x18)
	struct FString m_DisplayText; // 0x240(0x10)
	float ActivationTime; // 0x250(0x04)
	float MaxDistanceToStartUse; // 0x254(0x04)
	struct UAnimMontage* CharacterUsingAnimMontage; // 0x258(0x08)

	void BPUse(struct AWTLCharacter* Character); // Function WTL.WTLInteractiveObject.BPUse // (Native|Event|Public|BlueprintEvent) // @ game+0x1779a60
	void BPSetHighlightState(bool Value); // Function WTL.WTLInteractiveObject.BPSetHighlightState // (Native|Event|Public|BlueprintEvent) // @ game+0x1779890
	struct FString BPGetDisplayText(struct AWTLCharacter* Character); // Function WTL.WTLInteractiveObject.BPGetDisplayText // (Native|Event|Public|BlueprintEvent) // @ game+0x1779760
	bool BPCanBeUsed(struct AWTLCharacter* Character); // Function WTL.WTLInteractiveObject.BPCanBeUsed // (Native|Event|Public|BlueprintEvent) // @ game+0x1779970
};

// Class WTL.WTLStorageBox
// Size: 0x630 (Inherited: 0x260)
struct AWTLStorageBox : AWTLInteractiveObject {
	char pad_260[0x8]; // 0x260(0x08)
	struct UStaticMeshComponent* Mesh; // 0x268(0x08)
	char pad_270[0x170]; // 0x270(0x170)
	struct FWTLStorageContent m_PublicStorageContent; // 0x3e0(0xa8)
	struct FWTLStorageContent m_PrivateStorageContent; // 0x488(0xa8)
	struct FWTLStorageContent m_SummaryStorageContent; // 0x530(0xa8)
	char pad_5D8[0x20]; // 0x5d8(0x20)
	struct FText Name; // 0x5f8(0x18)
	char SlotsCount; // 0x610(0x01)
	bool CanStoreItems; // 0x611(0x01)
	char pad_612[0x6]; // 0x612(0x06)
	struct TArray<struct FWTLItemSpawnInfo> SpawnItems; // 0x618(0x10)
	bool CanUseLocationItemsSpawn; // 0x628(0x01)
	char pad_629[0x3]; // 0x629(0x03)
	int32_t MaxLocationItemsSpawnQuality; // 0x62c(0x04)

	void SetCharacterDropChanceMultiplier(struct AWTLCharacter* Character, float Multiplier); // Function WTL.WTLStorageBox.SetCharacterDropChanceMultiplier // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x192d740
	void OnRep_StorageContent(); // Function WTL.WTLStorageBox.OnRep_StorageContent // (Final|Native|Protected) // @ game+0x192db20
	void AllowSpecialLootForCharacter(struct AWTLCharacter* Character, float SpecialValue); // Function WTL.WTLStorageBox.AllowSpecialLootForCharacter // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x192d360
};

// Class WTL.WTLAirDropStorage
// Size: 0x6d0 (Inherited: 0x630)
struct AWTLAirDropStorage : AWTLStorageBox {
	struct UWTLRadialForceComponent* RadialForce; // 0x630(0x08)
	struct UParticleSystemComponent* Highlighting; // 0x638(0x08)
	char pad_640[0x10]; // 0x640(0x10)
	float m_NewLifeTime; // 0x650(0x04)
	char pad_654[0x28]; // 0x654(0x28)
	bool m_bShowAll; // 0x67c(0x01)
	bool m_bShowPositionOnLocation; // 0x67d(0x01)
	bool m_bSpawned; // 0x67e(0x01)
	bool UseCameraShake; // 0x67f(0x01)
	struct UMatineeCameraShake* CameraShake; // 0x680(0x08)
	float MaxDistance; // 0x688(0x04)
	float CameraShakeValue; // 0x68c(0x04)
	bool HideUsableItem; // 0x690(0x01)
	bool RemoveAiming; // 0x691(0x01)
	bool NeedToKillCharacters; // 0x692(0x01)
	char pad_693[0x1]; // 0x693(0x01)
	float KillCharactersMaxDistance; // 0x694(0x04)
	struct TSoftClassPtr<UObject> DestroyFX; // 0x698(0x28)
	float TimeBeforeShowBox; // 0x6c0(0x04)
	float LocationHighlightingTime; // 0x6c4(0x04)
	bool CanSpawnGuard; // 0x6c8(0x01)
	char pad_6C9[0x7]; // 0x6c9(0x07)

	void OnRep_NewLifeTime(); // Function WTL.WTLAirDropStorage.OnRep_NewLifeTime // (Final|Native|Private) // @ game+0x177b2f0
	void OnRep_bShowPosition(); // Function WTL.WTLAirDropStorage.OnRep_bShowPosition // (Final|Native|Private) // @ game+0x177b290
	void OnRep_bShowAll(); // Function WTL.WTLAirDropStorage.OnRep_bShowAll // (Final|Native|Private) // @ game+0x177b2d0
	void NetMulsticast_Destroy(); // Function WTL.WTLAirDropStorage.NetMulsticast_Destroy // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x177b270
	void BPShowAll(bool ShowAll); // Function WTL.WTLAirDropStorage.BPShowAll // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void BPDestroy(); // Function WTL.WTLAirDropStorage.BPDestroy // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
};

// Class WTL.WTLAITargetInterface
// Size: 0x28 (Inherited: 0x28)
struct UWTLAITargetInterface : UInterface {

	bool AIInterface_IsInSafeZone(); // Function WTL.WTLAITargetInterface.AIInterface_IsInSafeZone // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x177b940
	bool AIInterface_IsCanBeAttacked(enum class EWTLFaction InstigatorFaction); // Function WTL.WTLAITargetInterface.AIInterface_IsCanBeAttacked // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x177b860
	bool AIInterface_IsAlive(); // Function WTL.WTLAITargetInterface.AIInterface_IsAlive // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x177b9e0
	struct FVector AIInterface_GetVelocity(); // Function WTL.WTLAITargetInterface.AIInterface_GetVelocity // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x177b970
	int32_t AIInterface_GetGroupID(); // Function WTL.WTLAITargetInterface.AIInterface_GetGroupID // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x177b9b0
	enum class EWTLFaction AIInterface_GetFaction(); // Function WTL.WTLAITargetInterface.AIInterface_GetFaction // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1774db0
};

// Class WTL.WTLAmbientSound
// Size: 0x238 (Inherited: 0x228)
struct AWTLAmbientSound : AAmbientSound {
	char pad_228[0xc]; // 0x228(0x0c)
	enum class EWTLAmbientSoundLocationType LocationType; // 0x234(0x01)
	enum class EWTLAmbientSoundDayTimeType DayTimeType; // 0x235(0x01)
	char pad_236[0x2]; // 0x236(0x02)
};

// Class WTL.WTLAmmoCase
// Size: 0x260 (Inherited: 0x220)
struct AWTLAmmoCase : AActor {
	struct UCapsuleComponent* CollisionComp; // 0x220(0x08)
	struct UStaticMeshComponent* Mesh; // 0x228(0x08)
	float DropLifeSpan; // 0x230(0x04)
	char pad_234[0x4]; // 0x234(0x04)
	struct TSoftObjectPtr<UFMODEvent> DropSoundEvent; // 0x238(0x28)

	void OnHit(struct UPrimitiveComponent* HitComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult& Hit); // Function WTL.WTLAmmoCase.OnHit // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x177be60
};

// Class WTL.WTLAnimalBase
// Size: 0x220 (Inherited: 0x220)
struct AWTLAnimalBase : AActor {

	void OnRepReplicatedMovement(struct FVector Location, struct FRotator Rotation); // Function WTL.WTLAnimalBase.OnRepReplicatedMovement // (Event|Public|HasDefaults|BlueprintEvent) // @ game+0x1ad0090
};

// Class WTL.WTLAnimNotifyAmmoCaseEject
// Size: 0x80 (Inherited: 0x38)
struct UWTLAnimNotifyAmmoCaseEject : UAnimNotify {
	struct TSoftClassPtr<UObject> AmmoCaseClass; // 0x38(0x28)
	float AmmoCaseForce; // 0x60(0x04)
	float ForceRandomMultiplierValue; // 0x64(0x04)
	struct FVector AngularImpulse; // 0x68(0x0c)
	float RandomRotationHalfCone; // 0x74(0x04)
	struct FName SocketName; // 0x78(0x08)
};

// Class WTL.WTLAnimNotifyParticleAmmoCaseEject
// Size: 0x50 (Inherited: 0x38)
struct UWTLAnimNotifyParticleAmmoCaseEject : UAnimNotify {
	struct FVector AmmoCaseInitialVelocity; // 0x38(0x0c)
	struct FName InitialVelocityParamName; // 0x44(0x08)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class WTL.WTLAnimNotifyParticleEffect
// Size: 0xb0 (Inherited: 0x38)
struct UWTLAnimNotifyParticleEffect : UAnimNotify {
	struct TSoftObjectPtr<UParticleSystem> PSTemplate; // 0x38(0x28)
	struct FVector LocationOffset; // 0x60(0x0c)
	struct FRotator RotationOffset; // 0x6c(0x0c)
	struct FVector EmitterScale; // 0x78(0x0c)
	char pad_84[0x1c]; // 0x84(0x1c)
	char Attached : 1; // 0xa0(0x01)
	char pad_A0_1 : 7; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	struct FName SocketName; // 0xa4(0x08)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class WTL.WTLAnimNotifyGunshot
// Size: 0x98 (Inherited: 0x38)
struct UWTLAnimNotifyGunshot : UAnimNotify {
	struct TSoftObjectPtr<UFMODEvent> EditorEvent; // 0x38(0x28)
	struct TSoftObjectPtr<UParticleSystem> EditParticleSystem; // 0x60(0x28)
	struct FVector EditorParticlesScale; // 0x88(0x0c)
	char pad_94[0x4]; // 0x94(0x04)
};

// Class WTL.WTLAnimNotifyFootstep
// Size: 0x60 (Inherited: 0x38)
struct UWTLAnimNotifyFootstep : UAnimNotify {
	struct TSoftObjectPtr<UFMODEvent> EditorEvent; // 0x38(0x28)
};

// Class WTL.WTLAnimNotifyCharacterBreath
// Size: 0x60 (Inherited: 0x38)
struct UWTLAnimNotifyCharacterBreath : UAnimNotify {
	struct TSoftObjectPtr<UFMODEvent> EditorEvent; // 0x38(0x28)
};

// Class WTL.WTLAnimNotifyPlayCharacterSound
// Size: 0x58 (Inherited: 0x58)
struct UWTLAnimNotifyPlayCharacterSound : UAnimNotify_PlaySound {
};

// Class WTL.WTLCharacterAdditionalMeshNotifyState
// Size: 0xa0 (Inherited: 0x30)
struct UWTLCharacterAdditionalMeshNotifyState : UAnimNotifyState {
	char pad_30[0x8]; // 0x30(0x08)
	struct FName MeshComponentName; // 0x38(0x08)
	struct TSoftObjectPtr<UStaticMesh> Mesh; // 0x40(0x28)
	struct FName AttachBoneName; // 0x68(0x08)
	struct FTransform MeshRelativeTransform; // 0x70(0x30)
};

// Class WTL.WTLCharacterAddStaticMeshNotify
// Size: 0xb0 (Inherited: 0x38)
struct UWTLCharacterAddStaticMeshNotify : UAnimNotify {
	struct UStaticMeshComponent* m_MeshComponent; // 0x38(0x08)
	struct FName MeshComponentName; // 0x40(0x08)
	struct TSoftObjectPtr<UStaticMesh> Mesh; // 0x48(0x28)
	struct FName AttachBoneName; // 0x70(0x08)
	char pad_78[0x8]; // 0x78(0x08)
	struct FTransform MeshRelativeTransform; // 0x80(0x30)
};

// Class WTL.WTLCharacterRemoveStaticMeshNotify
// Size: 0x40 (Inherited: 0x38)
struct UWTLCharacterRemoveStaticMeshNotify : UAnimNotify {
	struct FName MeshComponentName; // 0x38(0x08)
};

// Class WTL.WTLCharacterHandsNotifyState
// Size: 0x38 (Inherited: 0x30)
struct UWTLCharacterHandsNotifyState : UAnimNotifyState {
	enum class EWTLHandsState StartHandsState; // 0x30(0x01)
	enum class EWTLHandsState EndHandsState; // 0x31(0x01)
	char pad_32[0x6]; // 0x32(0x06)
};

// Class WTL.WTLCharacterHandsStateChange
// Size: 0x40 (Inherited: 0x38)
struct UWTLCharacterHandsStateChange : UAnimNotify {
	enum class EWTLHandsState HandsState; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class WTL.WTLReloadingStateChange
// Size: 0x40 (Inherited: 0x38)
struct UWTLReloadingStateChange : UAnimNotify {
	enum class EWTLReloadingNotifyType NotifyType; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class WTL.WTLUsableItemStateChange
// Size: 0x40 (Inherited: 0x38)
struct UWTLUsableItemStateChange : UAnimNotify {
	enum class EWTLUsableItemState State; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class WTL.WTLUsableItemCustomTrigger
// Size: 0x40 (Inherited: 0x38)
struct UWTLUsableItemCustomTrigger : UAnimNotify {
	struct FName TriggerName; // 0x38(0x08)
};

// Class WTL.WTLVehicleStateChange
// Size: 0x40 (Inherited: 0x38)
struct UWTLVehicleStateChange : UAnimNotify {
	enum class EWTLVehicleState State; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class WTL.WTLVehicleCustomTrigger
// Size: 0x40 (Inherited: 0x38)
struct UWTLVehicleCustomTrigger : UAnimNotify {
	struct FName TriggerName; // 0x38(0x08)
};

// Class WTL.WTLPlaceableStuffCustomTrigger
// Size: 0x40 (Inherited: 0x38)
struct UWTLPlaceableStuffCustomTrigger : UAnimNotify {
	struct FName TriggerName; // 0x38(0x08)
};

// Class WTL.WTLNPCCustomTrigger
// Size: 0x40 (Inherited: 0x38)
struct UWTLNPCCustomTrigger : UAnimNotify {
	struct FName TriggerName; // 0x38(0x08)
};

// Class WTL.WTLMonsterActionTrigger
// Size: 0x40 (Inherited: 0x38)
struct UWTLMonsterActionTrigger : UAnimNotify {
	struct FName TriggerName; // 0x38(0x08)
};

// Class WTL.WTLMonsterAnimationTrigger
// Size: 0x48 (Inherited: 0x38)
struct UWTLMonsterAnimationTrigger : UAnimNotify {
	struct FName TriggerName; // 0x38(0x08)
	bool Value; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	int32_t ID; // 0x44(0x04)
};

// Class WTL.WTLNPCActionTrigger
// Size: 0x40 (Inherited: 0x38)
struct UWTLNPCActionTrigger : UAnimNotify {
	struct FName TriggerName; // 0x38(0x08)
};

// Class WTL.WTLMonsterEffect
// Size: 0x88 (Inherited: 0x38)
struct UWTLMonsterEffect : UAnimNotify {
	struct TMap<uint16_t, struct FWTLMonsterAction> ActionsPerMonsterID; // 0x38(0x50)
};

// Class WTL.WTLAnomalyWayPoint
// Size: 0x228 (Inherited: 0x220)
struct AWTLAnomalyWayPoint : AActor {
	struct AWTLAnomalyWayPoint* NextWayPoint; // 0x220(0x08)
};

// Class WTL.WTLArenaState
// Size: 0x2c8 (Inherited: 0x220)
struct AWTLArenaState : AInfo {
	char pad_220[0x28]; // 0x220(0x28)
	enum class EWTLArenaMatchState m_MatchState; // 0x248(0x01)
	char pad_249[0x3]; // 0x249(0x03)
	float m_NextMatchStateChangeServerTime; // 0x24c(0x04)
	struct TArray<struct FWTLArenaFactionScore> m_FactionScores; // 0x250(0x10)
	char pad_260[0x10]; // 0x260(0x10)
	struct TArray<struct FWTLArenaLeaderboardRecord> m_Leaderboard; // 0x270(0x10)
	struct TArray<struct FWTLArenaReward> Rewards; // 0x280(0x10)
	char pad_290[0x20]; // 0x290(0x20)
	struct FTimespan MatchWaitDuration; // 0x2b0(0x08)
	struct FTimespan MatchDuration; // 0x2b8(0x08)
	struct FTimespan MatchDoneDuration; // 0x2c0(0x08)

	void OnRep_MatchState(); // Function WTL.WTLArenaState.OnRep_MatchState // (Final|Native|Protected) // @ game+0x17802d0
};

// Class WTL.WTLBallisticsSystem
// Size: 0x180 (Inherited: 0x28)
struct UWTLBallisticsSystem : UObject {
	char pad_28[0x148]; // 0x28(0x148)
	bool bDrawActualTrajectory; // 0x170(0x01)
	char pad_171[0x3]; // 0x171(0x03)
	float DebugInfoLifetime; // 0x174(0x04)
	float ActualTrajectoryThickness; // 0x178(0x04)
	char pad_17C[0x4]; // 0x17c(0x04)
};

// Class WTL.WTLBPLibraryCharacter
// Size: 0x28 (Inherited: 0x28)
struct UWTLBPLibraryCharacter : UBlueprintFunctionLibrary {

	void TeleportCharacterToRandomPointInRange(struct AWTLCharacter* Character, struct FVector OriginLocation, float MinRange, float MaxRange, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCharacter.TeleportCharacterToRandomPointInRange // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1789c40
	void TeleportCharacterToRandomPointArray(struct AWTLCharacter* Character, struct TArray<struct FVector> Locations, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCharacter.TeleportCharacterToRandomPointArray // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1789ef0
	void TeleportCharacterToPoint(struct AWTLCharacter* Character, struct FVector Location, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCharacter.TeleportCharacterToPoint // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x178a100
	void TakeItemInContainerFromCharacter(struct AWTLCharacter* Character, enum class EWTLItemType ItemType, int32_t ItemTypeID, int32_t Count, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCharacter.TakeItemInContainerFromCharacter // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1784480
	void TakeItemInArms(struct AWTLCharacter* Character, enum class EWTLItemType ItemType, int32_t ItemTypeID, char SlotNumber, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCharacter.TakeItemInArms // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1782480
	void TakeItemFromCharacter(struct AWTLCharacter* Character, struct TArray<struct FWTLBPIdentityItemType> Items, bool CheckInContainers, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCharacter.TakeItemFromCharacter // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x17881b0
	void TakeArtefactWithInteactiveObjectIDFromCharacter(struct AWTLCharacter* Character, int32_t ArtefactID, int32_t InteractiveObjectID, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCharacter.TakeArtefactWithInteactiveObjectIDFromCharacter // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x17872c0
	void TakeAllItemsFromCharacter(struct AWTLCharacter* Character, struct TArray<struct FWTLBPIdentityItemType> Items, bool CheckInContainers); // Function WTL.WTLBPLibraryCharacter.TakeAllItemsFromCharacter // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1787c50
	void SwitchCharacterSex(struct AWTLCharacter* Character, int32_t ArtefactID, int32_t InteractiveObjectID, enum class EWTLSex& Result); // Function WTL.WTLBPLibraryCharacter.SwitchCharacterSex // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1786330
	void SwitchCharacterFaction(struct AWTLCharacter* Character, enum class EWTLFaction& Result); // Function WTL.WTLBPLibraryCharacter.SwitchCharacterFaction // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1783be0
	void SetCharacterThirstValue(struct AWTLCharacter* Character, char Value); // Function WTL.WTLBPLibraryCharacter.SetCharacterThirstValue // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1780fd0
	void SetCharacterReputation(struct AWTLCharacter* Character, char Reputation, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCharacter.SetCharacterReputation // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1783a20
	void SetCharacterHungerValue(struct AWTLCharacter* Character, char Value); // Function WTL.WTLBPLibraryCharacter.SetCharacterHungerValue // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1780fd0
	void RecoverCharacterStaminaByPercent(struct AWTLCharacter* Character, float PercentValue); // Function WTL.WTLBPLibraryCharacter.RecoverCharacterStaminaByPercent // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x178a2b0
	void RecoverCharacterStamina(struct AWTLCharacter* Character, float Value); // Function WTL.WTLBPLibraryCharacter.RecoverCharacterStamina // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x178a2b0
	void KillCharacter(struct AWTLCharacter* Character, struct UDamageType* DamageTypeClass); // Function WTL.WTLBPLibraryCharacter.KillCharacter // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x178b020
	void IsPointNearLocalCharacter(struct UObject* WorldContextObject, struct FVector Position, float MaxDistance, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCharacter.IsPointNearLocalCharacter // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1781360
	bool IsPlayedCurrentEmotion(struct AWTLCharacter* Character, int32_t EmotionTypeID, int32_t EmotionID); // Function WTL.WTLBPLibraryCharacter.IsPlayedCurrentEmotion // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x17818d0
	bool IsCharacterRegularPlayer(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.IsCharacterRegularPlayer // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1787110
	bool IsCharacterModerator(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.IsCharacterModerator // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1787030
	void IsCharacterHoldingBreath(struct AWTLCharacter* Character, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCharacter.IsCharacterHoldingBreath // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x178c090
	bool IsCharacterAdministator(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.IsCharacterAdministator // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1786f50
	void IsActorNearLocalCharacter(struct AActor* Actor, float MaxDistance, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCharacter.IsActorNearLocalCharacter // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1781120
	void InstallPDAModule(struct AWTLCharacter* Character, int32_t ModuleID, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCharacter.InstallPDAModule // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1787aa0
	void IncCharacterThirstValue(struct AWTLCharacter* Character, int32_t Delta); // Function WTL.WTLBPLibraryCharacter.IncCharacterThirstValue // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1780e90
	void IncCharacterHungerValue(struct AWTLCharacter* Character, int32_t Delta); // Function WTL.WTLBPLibraryCharacter.IncCharacterHungerValue // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1780e90
	void HealCharacterByPercentRet(struct AWTLCharacter* Character, float PercentValue, float& RestoredHealth); // Function WTL.WTLBPLibraryCharacter.HealCharacterByPercentRet // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x178ae50
	void HealCharacterByPercent(struct AWTLCharacter* Character, float PercentValue); // Function WTL.WTLBPLibraryCharacter.HealCharacterByPercent // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x178a2b0
	void HealCharacter(struct AWTLCharacter* Character, float Value); // Function WTL.WTLBPLibraryCharacter.HealCharacter // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x178a2b0
	void GiveExperienceToCharacter(struct AWTLCharacter* Character, int32_t ExperienceAmount); // Function WTL.WTLBPLibraryCharacter.GiveExperienceToCharacter // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1784920
	struct AWTLCharacter* GetLocalCharacter(struct UObject* WorldContextObject); // Function WTL.WTLBPLibraryCharacter.GetLocalCharacter // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1781800
	float GetDistanceToLocalCharacter(struct UObject* WorldContextObject, struct FVector Position); // Function WTL.WTLBPLibraryCharacter.GetDistanceToLocalCharacter // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x17815d0
	char GetCharacterStrength(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterStrength // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x17860c0
	float GetCharacterStaminaValue(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterStaminaValue // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x178a660
	float GetCharacterStaminaPercent(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterStaminaPercent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x178a400
	char GetCharacterStamina(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterStamina // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1785be0
	struct TArray<struct AWTLCharacter*> GetCharactersInVolume(struct UObject* WorldContextObject, struct UStaticMeshComponent* Volume); // Function WTL.WTLBPLibraryCharacter.GetCharactersInVolume // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x178d750
	struct TArray<struct AWTLCharacter*> GetCharactersInRange(struct UObject* WorldContextObject, struct FVector Origin, float Range); // Function WTL.WTLBPLibraryCharacter.GetCharactersInRange // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x178da30
	enum class EWTLSex GetCharacterSex(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterSex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1786750
	float GetCharacterRepurtationPercent(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterRepurtationPercent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1784f60
	char GetCharacterRepurtation(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterRepurtation // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x17851f0
	enum class EWTLPlayerType GetCharacterPlayerType(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterPlayerType // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x17871f0
	float GetCharacterParameterValue(struct AWTLCharacter* Character, enum class EWTLCharacterParameter Parameter); // Function WTL.WTLBPLibraryCharacter.GetCharacterParameterValue // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1784e00
	struct FString GetCharacterName(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1786c40
	char GetCharacterLevel(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterLevel // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x17869f0
	int32_t GetCharacterInventoryWeight(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterInventoryWeight // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1784190
	char GetCharacterIntelligence(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterIntelligence // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1785700
	float GetCharacterHealthValue(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterHealthValue // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x178ab80
	float GetCharacterHealthPercent(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterHealthPercent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x178a8b0
	char GetCharacterFortune(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterFortune // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1785490
	enum class EWTLFaction GetCharacterFaction(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterFaction // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1783ef0
	float GetCharacterEffectValue(struct AWTLCharacter* Character, enum class EWTLCharacterEffectType EffectType); // Function WTL.WTLBPLibraryCharacter.GetCharacterEffectValue // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x178d450
	char GetCharacterDexterity(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterDexterity // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1785e50
	void GetCharacterClanMemberType(struct AWTLCharacter* Character, enum class EWTLClanMemberType& Result); // Function WTL.WTLBPLibraryCharacter.GetCharacterClanMemberType // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1783590
	char GetCharacterAccuracy(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.GetCharacterAccuracy // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1785970
	void DecrementInventoryItem(struct AWTLCharacter* Character, enum class EWTLItemType ItemType, int32_t ItemTypeID, int32_t Count, bool CheckInContainers, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCharacter.DecrementInventoryItem // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1787e80
	void DecrementCharacterStaminaByPercent(struct AWTLCharacter* Character, float PercentValue); // Function WTL.WTLBPLibraryCharacter.DecrementCharacterStaminaByPercent // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x178a2b0
	void DecrementCharacterStamina(struct AWTLCharacter* Character, float Value); // Function WTL.WTLBPLibraryCharacter.DecrementCharacterStamina // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x178a2b0
	void DecrementCharactersHealthToPercentInRange(struct UObject* WorldContextObject, struct FVector Origin, float Range, float HealthPercent, bool KillIfLessOrEqual, struct UDamageType* DamageTypeClass, struct AController* EventInstigator, struct AActor* DamageCauser); // Function WTL.WTLBPLibraryCharacter.DecrementCharactersHealthToPercentInRange // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x178b170
	void DecrementCharacterHealthToPercent(struct AWTLCharacter* Character, float HealthPercent, bool KillIfLessOrEqual, struct UDamageType* DamageTypeClass, struct AController* EventInstigator, struct AActor* DamageCauser); // Function WTL.WTLBPLibraryCharacter.DecrementCharacterHealthToPercent // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x178b5e0
	void ClearCameraLimits(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.ClearCameraLimits // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x17809a0
	void CheckCharacterHaveEnoughAvailableInventorySlots(struct AWTLCharacter* Character, int32_t Count, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCharacter.CheckCharacterHaveEnoughAvailableInventorySlots // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1781ee0
	void CheckCharacterHaveArtefactWithInteactiveObjectID(struct AWTLCharacter* Character, int32_t ArtefactID, int32_t InteractiveObjectID, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCharacter.CheckCharacterHaveArtefactWithInteactiveObjectID // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x17874f0
	void CharacterTravel(struct AWTLCharacter* Character, int32_t LocationID, int32_t PortalID, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCharacter.CharacterTravel // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1782240
	void CharacterShowNote(struct AWTLCharacter* Character, struct FText& NoteName, int32_t NoteID); // Function WTL.WTLBPLibraryCharacter.CharacterShowNote // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1780c70
	char CharacterRandomDropItem(struct AWTLCharacter* Character, struct FVector Location); // Function WTL.WTLBPLibraryCharacter.CharacterRandomDropItem // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1784ca0
	void CharacterLeaveClan(struct AWTLCharacter* Character, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCharacter.CharacterLeaveClan // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x17838e0
	bool CharacterIsInvulnerable(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.CharacterIsInvulnerable // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x17899d0
	bool CharacterHaveEquipedDevice(struct AWTLCharacter* Character, int32_t StuffID); // Function WTL.WTLBPLibraryCharacter.CharacterHaveEquipedDevice // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1783200
	void CharacterHaveAnyItemsExcept(struct AWTLCharacter* Character, struct TArray<struct FWTLBPIdentityItemType> AllowedItems, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCharacter.CharacterHaveAnyItemsExcept // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1789370
	void CharacterHaveAnyItemOfTypeExcept(struct AWTLCharacter* Character, enum class EWTLItemType ItemType, struct TArray<int32_t> ExceptIDList, bool CheckInContainers, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCharacter.CharacterHaveAnyItemOfTypeExcept // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1788440
	void CharacterHaveAnyItemFromList(struct AWTLCharacter* Character, struct TArray<struct FWTLBPIdentityItemType> Items, bool CheckInContainers, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCharacter.CharacterHaveAnyItemFromList // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1788d70
	void CharacterHaveAllItemsFromList(struct AWTLCharacter* Character, struct TArray<struct FWTLBPIdentityItemType> Items, bool CheckInContainers, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCharacter.CharacterHaveAllItemsFromList // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1788770
	bool CharacterHaveActiveNDPDetector(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.CharacterHaveActiveNDPDetector // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1782cc0
	bool CharacterHaveActiveMetalDetector(struct AWTLCharacter* Character); // Function WTL.WTLBPLibraryCharacter.CharacterHaveActiveMetalDetector // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1782a60
	bool CharacterHaveActiveEquipment(struct AWTLCharacter* Character, int32_t StuffID); // Function WTL.WTLBPLibraryCharacter.CharacterHaveActiveEquipment // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1782f20
	void BeginInformationDialog(struct AWTLCharacter* Character, int32_t InformationDialogID, struct FText Title); // Function WTL.WTLBPLibraryCharacter.BeginInformationDialog // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1781ab0
	void AssignItemToFastAccessSlot(struct AWTLCharacter* Character, enum class EWTLItemType ItemType, int32_t ItemTypeID, char SlotNumber, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCharacter.AssignItemToFastAccessSlot // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1782780
	void ApplyRandomPercentDamage(struct AWTLCharacter* Character, float MinPercent, float MaxPercent, struct UDamageType* DamageTypeClass, struct AController* EventInstigator, struct AActor* DamageCauser); // Function WTL.WTLBPLibraryCharacter.ApplyRandomPercentDamage // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x178b940
	void ApplyRadialDamage(struct UObject* WorldContextObject, float DamageValue, struct FVector DamageOrigin, float DamageRadius, struct UDamageType* DamageTypeClass, struct TArray<struct AActor*> IgnoreActors, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCharacter.ApplyRadialDamage // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x178bc90
	void ApplyHearingDamageToCharacter(struct AWTLCharacter* Character, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCharacter.ApplyHearingDamageToCharacter // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x178c090
	void ApplyCameraLimits(struct AWTLCharacter* Character, struct FWTLCameraLimits CameraLimits, struct FRotator& ViewOrigin); // Function WTL.WTLBPLibraryCharacter.ApplyCameraLimits // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1780a70
	void AddEffectToCharacterWithFalloff(struct AWTLCharacter* Character, enum class EWTLCharacterEffectType EffectType, float EffectValue, struct FVector Origin, float FalloffRadius, float MinEffectValue, enum class EWTLBPActionResult& Result, bool UseStuffProtection, float MaxEffectValue); // Function WTL.WTLBPLibraryCharacter.AddEffectToCharacterWithFalloff // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x178c8f0
	void AddEffectToCharactersWithFalloff(struct TArray<struct AWTLCharacter*> Characters, enum class EWTLCharacterEffectType EffectType, float EffectValue, struct FVector Origin, float FalloffRadius, float MinEffectValue, enum class EWTLBPActionResult& Result, bool UseStuffProtection, float MaxEffectValue); // Function WTL.WTLBPLibraryCharacter.AddEffectToCharactersWithFalloff // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x178c3f0
	void AddEffectToCharacters(struct TArray<struct AWTLCharacter*> Characters, enum class EWTLCharacterEffectType EffectType, float EffectValue, enum class EWTLBPActionResult& Result, bool UseStuffProtection, float MaxEffectValue); // Function WTL.WTLBPLibraryCharacter.AddEffectToCharacters // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x178cd90
	void AddEffectToCharacterOnNextSpawn(struct AWTLCharacter* Character, enum class EWTLCharacterEffectType EffectType, float EffectValue, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCharacter.AddEffectToCharacterOnNextSpawn // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x178c1c0
	void AddEffectToCharacter(struct AWTLCharacter* Character, enum class EWTLCharacterEffectType EffectType, float EffectValue, enum class EWTLBPActionResult& Result, bool UseStuffProtection, float MaxEffectValue); // Function WTL.WTLBPLibraryCharacter.AddEffectToCharacter // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x178d110
};

// Class WTL.WTLBPLibraryCommon
// Size: 0x28 (Inherited: 0x28)
struct UWTLBPLibraryCommon : UBlueprintFunctionLibrary {

	void WTLSwitchHasAuthority(struct UObject* WorldContextObject, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCommon.WTLSwitchHasAuthority // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x179b810
	void WriteLog(struct UObject* WorldContextObject, enum class EWTLBPLogVerbosity Verbosity, struct FString Text, struct FString MethodName); // Function WTL.WTLBPLibraryCommon.WriteLog // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x179be10
	void UpdateReflectionSphere(struct UObject* WorldContextObject, struct UReflectionCaptureComponent* CaptureComponent); // Function WTL.WTLBPLibraryCommon.UpdateReflectionSphere // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x179a400
	void TakeMoneyFromCharacter(struct AWTLCharacter* Character, int32_t MoneyAmount, struct FString Reason, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCommon.TakeMoneyFromCharacter // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1798740
	void SwitchIsValidActor(struct AActor* Actor, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCommon.SwitchIsValidActor // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x179b980
	void SpawnWeaponProjectile(struct UObject* WorldContextObject, struct APawn* Instigator, struct AActor* Owner, int32_t WeaponID, int32_t AmmoID, struct FTransform SpawnTransform, float MinDamage, float MaxDamage); // Function WTL.WTLBPLibraryCommon.SpawnWeaponProjectile // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1796e40
	struct AWTLMonsterPawn* SpawnMonster(struct UObject* WorldContextObject, struct AWTLMonsterPawn* MonsterClass, struct AActor* Owner, int32_t MinLevel, int32_t MaxLevel, struct FTransform Transform, struct FWTLMonsterBurst Burst, enum class EWTLFaction MonsterFaction, bool ReactionOnElectronicBait, float LifespanAfterDeath, bool IsSpawnDefaultController); // Function WTL.WTLBPLibraryCommon.SpawnMonster // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1799a60
	struct AWTLEnemyNPC* SpawnEnemyNPC(struct UObject* WorldContextObject, struct AWTLEnemyNPC* NPCClass, struct AActor* Owner, int32_t MinLevel, int32_t MaxLevel, struct FTransform Transform); // Function WTL.WTLBPLibraryCommon.SpawnEnemyNPC // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1798ac0
	void SpawnAirDrop(struct UObject* WorldContextObject, struct FVector SpawnLocation, int32_t DropID, int32_t MaxUseCount, float LifeSpan, bool CanSpawnGuard, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCommon.SpawnAirDrop // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1791200
	struct AWTLAIFlying* SpawnAIFlying(struct UObject* WorldContextObject, struct AWTLAIFlying* AIFlyingClass, struct AActor* Owner, int32_t MinLevel, int32_t MaxLevel, struct FTransform Transform, struct FWTLMonsterBurst Burst, bool ReactionOnElectronicBait, float LifespanAfterDeath); // Function WTL.WTLBPLibraryCommon.SpawnAIFlying // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1798ea0
	struct AWTLAICharacter* SpawnAICharacter(struct UObject* WorldContextObject, struct AWTLAICharacter* AICharacterClass, struct AActor* Owner, int32_t MinLevel, int32_t MaxLevel, struct FTransform Transform, struct FWTLMonsterBurst Burst, bool ReactionOnElectronicBait, float LifespanAfterDeath); // Function WTL.WTLBPLibraryCommon.SpawnAICharacter // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1798ea0
	void ShowItemStoreOverlay(struct UObject* WorldContextObject); // Function WTL.WTLBPLibraryCommon.ShowItemStoreOverlay // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1798980
	void SetServerEventInfo(struct UObject* WorldContextObject, enum class EWTLServerEventType Type, float MinutesToEvent, struct FString Comment); // Function WTL.WTLBPLibraryCommon.SetServerEventInfo // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1796150
	void SendDedicatedServerMessage(struct UObject* WorldContextObject, int32_t LocationID, struct FString MessageType, struct FString MessageData); // Function WTL.WTLBPLibraryCommon.SendDedicatedServerMessage // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1793790
	void ReportCrime(struct UObject* WorldContextObject, struct APawn* Instigator, struct APawn* Victim, bool bIsLethal); // Function WTL.WTLBPLibraryCommon.ReportCrime // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x179a6a0
	struct USkeletalMesh* MergeMeshes(struct FSkeletalMeshMergeParams& Params); // Function WTL.WTLBPLibraryCommon.MergeMeshes // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1793b90
	struct AWTLMonsterPawn* K2_SpawnMonster(struct UObject* WorldContextObject, struct AWTLMonsterPawn* MonsterClass, struct AActor* Owner, int32_t MinLevel, int32_t MaxLevel, struct FTransform Transform, struct FWTLMonsterBurst Burst, enum class EWTLFaction MonsterFaction, bool ReactionOnElectronicBait, float LifespanAfterDeath, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCommon.K2_SpawnMonster // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x17993e0
	bool IsWithEditor(); // Function WTL.WTLBPLibraryCommon.IsWithEditor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xe5dd90
	bool IsValidVectorAI(struct FVector Vector); // Function WTL.WTLBPLibraryCommon.IsValidVectorAI // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x179bc40
	bool IsValidActor(struct AActor* Actor); // Function WTL.WTLBPLibraryCommon.IsValidActor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x179bd40
	void IsDay(struct UObject* WorldContextObject, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCommon.IsDay // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x179a210
	void HasItemInCharacterInventoryResult(struct AWTLCharacter* Character, enum class EWTLItemType ItemType, int32_t ItemTypeID, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCommon.HasItemInCharacterInventoryResult // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1797870
	bool HasItemInCharacterInventory(struct AWTLCharacter* Character, enum class EWTLItemType ItemType, int32_t ItemTypeID); // Function WTL.WTLBPLibraryCommon.HasItemInCharacterInventory // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1797ad0
	void GiveMoneyToCharacter(struct AWTLCharacter* Character, int32_t MoneyAmount, struct FString Reason, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCommon.GiveMoneyToCharacter // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1798740
	void GiveItemToCharacterEx(struct AWTLCharacter* Character, enum class EWTLItemType ItemType, int32_t ItemTypeID, int32_t Count, int32_t Condition, char CustomizationScalar, char CustomizationColor, struct FString CustomizationName, struct FString ModificationData, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCommon.GiveItemToCharacterEx // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1797ec0
	void GiveItemToCharacter(struct AWTLCharacter* Character, enum class EWTLItemType ItemType, int32_t ItemTypeID, int32_t Count, int32_t Condition, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCommon.GiveItemToCharacter // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1798410
	void GiveItemsToCharacter(struct AWTLCharacter* Character, struct TArray<struct FWTLGiveItemInfo> ItemsToGive, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryCommon.GiveItemsToCharacter // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1797cb0
	struct FWTLSettings GetSettings(struct UObject* WorldContextObject); // Function WTL.WTLBPLibraryCommon.GetSettings // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1791730
	float GetServerTimeSeconds(struct UObject* WorldContextObject); // Function WTL.WTLBPLibraryCommon.GetServerTimeSeconds // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1793a80
	struct FVector GetRandomPointInRange(struct UObject* WorldContextObject, struct FVector OriginLocation, float MinRange, float MaxRange); // Function WTL.WTLBPLibraryCommon.GetRandomPointInRange // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1793ed0
	void GetRandomCharactersInRange(struct UObject* WorldContextObject, struct FVector ObserverLocation, struct FVector ObserverForwardVector, enum class EWTLFaction ObserverFaction, float InRange, bool AsEnemy, float HalfAnglePitch, float HalfAngleYaw, int32_t MaxCount, struct TArray<struct AWTLCharacter*>& ResultList, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCommon.GetRandomCharactersInRange // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1795b60
	float GetMouseSensitivityInMiniGames(struct UObject* WorldContextObject); // Function WTL.WTLBPLibraryCommon.GetMouseSensitivityInMiniGames // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1791610
	int32_t GetMonsterLevelByCharactersInfo(struct UObject* WorldContextObject, int32_t NumCharactersToIncreaseLevel, bool ApplyAverageLevel, int32_t MinLevel, int32_t MaxLevel, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCommon.GetMonsterLevelByCharactersInfo // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1790ca0
	struct FWTLMonsterItemData GetMonsterInfo_LoadSynch(struct UObject* WorldContextObject, int32_t MonsterID, struct AWTLMonsterPawn*& MonsterClass, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCommon.GetMonsterInfo_LoadSynch // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1794260
	struct FWTLMonsterItemData GetMonsterInfo(struct UObject* WorldContextObject, int32_t MonsterID, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCommon.GetMonsterInfo // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x17949a0
	float GetLocationSkyDayTime(struct UObject* WorldContextObject); // Function WTL.WTLBPLibraryCommon.GetLocationSkyDayTime // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1793da0
	void GetListPlaceableStuffInRange(struct UObject* WorldContextObject, struct FVector ObserverLocation, struct FVector ObserverForwardVector, enum class EWTLFaction ObserverFaction, float InRange, bool AsEnemy, float HalfAnglePitch, float HalfAngleYaw, struct TArray<int32_t> ListIgnoreID, struct TArray<struct AWTLPlaceableStuff*>& ResultList, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCommon.GetListPlaceableStuffInRange // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1795120
	void GetListMonstersInRange(struct UObject* WorldContextObject, struct FVector ObserverLocation, struct FVector ObserverForwardVector, enum class EWTLFaction ObserverFaction, float InRange, bool AsEnemy, float HalfAnglePitch, float HalfAngleYaw, struct TArray<struct AWTLMonsterPawn*>& ResultList, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCommon.GetListMonstersInRange // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1794bb0
	void GetListCharactersInRange(struct UObject* WorldContextObject, struct FVector ObserverLocation, struct FVector ObserverForwardVector, enum class EWTLFaction ObserverFaction, float InRange, bool AsEnemy, float HalfAnglePitch, float HalfAngleYaw, struct TArray<struct AWTLCharacter*>& ResultList, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCommon.GetListCharactersInRange // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1794bb0
	struct FKey GetKeyFromAction(struct FName ActionName); // Function WTL.WTLBPLibraryCommon.GetKeyFromAction // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1792370
	struct FString GetItemDisplayName(struct UGameInstance* GameInstance, enum class EWTLItemType ItemType, int32_t ItemTypeID); // Function WTL.WTLBPLibraryCommon.GetItemDisplayName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1797600
	struct FInputAxisKeyMapping GetInputAxisKeyMappingFromKey(struct FKey Key); // Function WTL.WTLBPLibraryCommon.GetInputAxisKeyMappingFromKey // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1792830
	struct FInputActionKeyMapping GetInputActionKeyMappingFromKey(struct FKey Key); // Function WTL.WTLBPLibraryCommon.GetInputActionKeyMappingFromKey // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1792540
	float GetCurrentLevelTime(struct UObject* WorldContextObject); // Function WTL.WTLBPLibraryCommon.GetCurrentLevelTime // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x179a0a0
	struct AWTLCharacter* GetClosestCharacterForMonster(struct UObject* WorldContextObject, struct AWTLMonsterPawn* Monster, struct TArray<struct AActor*> CharacterList, struct FVector ObserverLocation, enum class EWTLBPCheckResult& Result, float InRadiusSquare); // Function WTL.WTLBPLibraryCommon.GetClosestCharacterForMonster // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1796870
	struct AActor* GetClosestAITargetInterfaceForMonster(struct UObject* WorldContextObject, struct TArray<struct AActor*> ActorList, struct FVector ObserverLocation, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCommon.GetClosestAITargetInterfaceForMonster // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x17965b0
	void GetAllCharactersForMonster(struct UObject* WorldContextObject, struct TArray<struct AWTLCharacter*>& Characters, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCommon.GetAllCharactersForMonster // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x17963c0
	struct TArray<struct AActor*> GetActorsInRadius(struct UObject* WorldContextObject, struct UObject* ActorClass, struct FVector Origin, float Distance); // Function WTL.WTLBPLibraryCommon.GetActorsInRadius // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1797310
	float DistanceSSE2D(struct FVector From, struct FVector To); // Function WTL.WTLBPLibraryCommon.DistanceSSE2D // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x179a900
	float DistanceSSE(struct FVector From, struct FVector To); // Function WTL.WTLBPLibraryCommon.DistanceSSE // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x179aa70
	void DelayedSpawnActor(struct UObject* WorldContextObject, struct FWTLDelayedSpawnActorInfo Info); // Function WTL.WTLBPLibraryCommon.DelayedSpawnActor // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1793190
	void DelayedDamage(struct UObject* WorldContextObject, struct FWTLDelayedDamageInfo Info); // Function WTL.WTLBPLibraryCommon.DelayedDamage // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1793450
	void ClientShowWarningText(struct AWTLCharacter* Character, struct FText Text); // Function WTL.WTLBPLibraryCommon.ClientShowWarningText // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x179b5e0
	void ClientShowTutorialMessagesByIDs(struct AWTLCharacter* Character, struct TArray<int32_t>& TutorialMessagesIDs); // Function WTL.WTLBPLibraryCommon.ClientShowTutorialMessagesByIDs // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x179b1c0
	void ClientShowTutorialMessages(struct AWTLCharacter* Character, struct TArray<enum class EWTLTutorialMessage>& TutorialMessages); // Function WTL.WTLBPLibraryCommon.ClientShowTutorialMessages // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x179ae10
	void ClientShowTutorialMessageByID(struct AWTLCharacter* Character, int32_t TutorialMessageID); // Function WTL.WTLBPLibraryCommon.ClientShowTutorialMessageByID // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x179b440
	void ClientShowTutorialMessage(struct AWTLCharacter* Character, enum class EWTLTutorialMessage TutorialMessage); // Function WTL.WTLBPLibraryCommon.ClientShowTutorialMessage // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x179b020
	void ClientDestoryActor(struct AActor* Actor); // Function WTL.WTLBPLibraryCommon.ClientDestoryActor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x179ac00
	void CheckNPC(struct UObject* WorldContextObject); // Function WTL.WTLBPLibraryCommon.CheckNPC // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x17941a0
	struct AWTLControlledMonsterPawn* CharactersInToAControllMonster(struct UObject* WorldContextObject, struct AWTLCharacter* Character, int32_t MonsterID, int32_t MonsterLevel, float MonsterLifeSpan, enum class EWTLFaction MonsterFaction, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCommon.CharactersInToAControllMonster // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1795780
	struct FVector CalculationOfTheLead(struct FVector SelfLocation, struct FVector TargetLocation, struct FVector TargetVelocity, float ProjectileSpeed); // Function WTL.WTLBPLibraryCommon.CalculationOfTheLead // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1792e20
	void BranchMonsterCanUseBrains(struct APawn* Pawn, enum class EWTLBPCheckResult& Result); // Function WTL.WTLBPLibraryCommon.BranchMonsterCanUseBrains // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1792af0
};

// Class WTL.WTLBPLibraryQuestSystem
// Size: 0x28 (Inherited: 0x28)
struct UWTLBPLibraryQuestSystem : UBlueprintFunctionLibrary {

	void SetQuestState(struct AWTLCharacter* Character, int32_t QuestID, enum class EWTLQuestState State, enum class EWTLNPCActionResult& Result); // Function WTL.WTLBPLibraryQuestSystem.SetQuestState // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x17a0d50
	void SetCharacterQuestState(struct AWTLCharacter* Character, int32_t QuestID, enum class EWTLQuestState State, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryQuestSystem.SetCharacterQuestState // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x17a1150
	void SetCharacterQuestProgressBits(struct AWTLCharacter* Character, int32_t QuestID, int32_t BitMask, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryQuestSystem.SetCharacterQuestProgressBits // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x179f7b0
	void SetCharacterQuestProgress(struct AWTLCharacter* Character, int32_t QuestID, char Progress1, char Progress2, char Progress3, char Progress4, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryQuestSystem.SetCharacterQuestProgress // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x17a07c0
	void IsCharacterQuestInState(struct AWTLCharacter* Character, int32_t QuestID, enum class EWTLQuestState QuestState, bool& Result); // Function WTL.WTLBPLibraryQuestSystem.IsCharacterQuestInState // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x179ecc0
	void IncrementCharacterQuestProgress(struct AWTLCharacter* Character, int32_t QuestID, char Progress1Delta, char Progress2Delta, char Progress3Delta, char Progress4Delta, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryQuestSystem.IncrementCharacterQuestProgress // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x17a07c0
	void GetCharacterQuestState(struct AWTLCharacter* Character, int32_t QuestID, enum class EWTLQuestState& QuestState); // Function WTL.WTLBPLibraryQuestSystem.GetCharacterQuestState // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x179f280
	void GetCharacterQuestProgressDescription(struct AWTLCharacter* Character, int32_t QuestID, struct TArray<struct FWTLMonsterKillRequirementState>& MonsterKills, struct TArray<struct FWTLEnemyNPCKillRequirementState>& EnemyNPCKills, struct TArray<struct FWTLCustomQuestRequirementState>& CustomRequirements, enum class EWTLBPActionResult& Result); // Function WTL.WTLBPLibraryQuestSystem.GetCharacterQuestProgressDescription // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x17a0190
	void GetCharacterQuestProgress(struct AWTLCharacter* Character, int32_t QuestID, char ProgressNumber, char& ProgressValue); // Function WTL.WTLBPLibraryQuestSystem.GetCharacterQuestProgress // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x179fbb0
	void CharacterHasAvailableInventorySlotsForCompleteQuest(struct AWTLCharacter* Character, int32_t QuestID, enum class EWTLNPCCheckResult& Result); // Function WTL.WTLBPLibraryQuestSystem.CharacterHasAvailableInventorySlotsForCompleteQuest // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x179dc30
	void CharacterHasAndReturnAvailableInventorySlotsForCompleteQuest(struct AWTLCharacter* Character, int32_t QuestID, enum class EWTLNPCCheckResult& Result, int32_t& InventoryRequiredSlotCount, int32_t& InventoryAvailableSlotCount); // Function WTL.WTLBPLibraryQuestSystem.CharacterHasAndReturnAvailableInventorySlotsForCompleteQuest // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x179d730
	void CharacterCanTakeQuest(struct AWTLCharacter* Character, int32_t QuestID, enum class EWTLNPCCheckResult& Result); // Function WTL.WTLBPLibraryQuestSystem.CharacterCanTakeQuest // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x179e3b0
	void CharacterCanCompleteQuest(struct AWTLCharacter* Character, int32_t QuestID, enum class EWTLNPCCheckResult& Result); // Function WTL.WTLBPLibraryQuestSystem.CharacterCanCompleteQuest // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x179dff0
};

// Class WTL.WTLBTService_AICheckForAttack
// Size: 0x98 (Inherited: 0x98)
struct UWTLBTService_AICheckForAttack : UBTService_BlackboardBase {
};

// Class WTL.WTLBTService_BlueprintBase
// Size: 0x98 (Inherited: 0x98)
struct UWTLBTService_BlueprintBase : UBTService_BlueprintBase {
};

// Class WTL.WTLBTService_CheckEnemy
// Size: 0xb0 (Inherited: 0x98)
struct UWTLBTService_CheckEnemy : UBTService_BlackboardBase {
	char pad_98[0x14]; // 0x98(0x14)
	enum class EWTLMonsterState SetState; // 0xac(0x01)
	bool ClearKeyVisibleEnemy; // 0xad(0x01)
	char pad_AE[0x2]; // 0xae(0x02)
};

// Class WTL.WTLBTService_CheckForFarAttack
// Size: 0x98 (Inherited: 0x98)
struct UWTLBTService_CheckForFarAttack : UBTService_BlackboardBase {
};

// Class WTL.WTLBTService_CheckForJump
// Size: 0xa0 (Inherited: 0x98)
struct UWTLBTService_CheckForJump : UBTService_BlackboardBase {
	enum class EWTLMonsterState SetState; // 0x98(0x01)
	enum class EWTLMonsterStateFollowTarget SetStateFollowTarget; // 0x99(0x01)
	char pad_9A[0x6]; // 0x9a(0x06)
};

// Class WTL.WTLBTService_Enemy_Sensing
// Size: 0xe0 (Inherited: 0x70)
struct UWTLBTService_Enemy_Sensing : UBTService {
	bool bSensePlayers; // 0x70(0x01)
	bool bSenseOtherEnemies; // 0x71(0x01)
	bool bHearNoises; // 0x72(0x01)
	bool bInterruptCurrentTaskOnSpotted; // 0x73(0x01)
	float SightRadius; // 0x74(0x04)
	float PeripheralVisionAngle; // 0x78(0x04)
	float HearingMaxSoundAge; // 0x7c(0x04)
	float HearingThreshold; // 0x80(0x04)
	float LOSHearingThreshold; // 0x84(0x04)
	enum class ECollisionChannel SoundOcclusionChannel; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
	struct FBlackboardKeySelector TargetSpottedKey; // 0x90(0x28)
	struct FBlackboardKeySelector RemoteLocationListenedKey; // 0xb8(0x28)
};

// Class WTL.WTLBTService_FrightRadius
// Size: 0xb0 (Inherited: 0x98)
struct UWTLBTService_FrightRadius : UBTService_BlackboardBase {
	enum class EWTLMonsterState SetState; // 0x98(0x01)
	char pad_99[0x3]; // 0x99(0x03)
	float ApplyRadius; // 0x9c(0x04)
	float DelayExecution; // 0xa0(0x04)
	float RandomDelayExecution; // 0xa4(0x04)
	float m_CurrentDelayExecution; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class WTL.WTLBTService_MonsterMovementMode
// Size: 0x78 (Inherited: 0x70)
struct UWTLBTService_MonsterMovementMode : UBTService {
	enum class EWTLMonsterMovementMode MovementMode; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class WTL.WTLBTService_SightAI
// Size: 0xa0 (Inherited: 0x98)
struct UWTLBTService_SightAI : UBTService_BlackboardBase {
	enum class EWTLMonsterState SetState; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class WTL.WTLBTService_StateIfHealthLess
// Size: 0xa8 (Inherited: 0x98)
struct UWTLBTService_StateIfHealthLess : UBTService_BlackboardBase {
	enum class EWTLMonsterState SetState; // 0x98(0x01)
	enum class EWTMonsterSecondaryState SetSecondaryState; // 0x99(0x01)
	char pad_9A[0x2]; // 0x9a(0x02)
	float HealthPercent; // 0x9c(0x04)
	bool InverseCondition; // 0xa0(0x01)
	char pad_A1[0x7]; // 0xa1(0x07)
};

// Class WTL.WTLBTTask_ActionFromBlackBoard
// Size: 0x98 (Inherited: 0x98)
struct UWTLBTTask_ActionFromBlackBoard : UBTTask_BlackboardBase {
};

// Class WTL.WTLBTTask_AvailableAction
// Size: 0x78 (Inherited: 0x70)
struct UWTLBTTask_AvailableAction : UBTTaskNode {
	bool bExceptMainAction; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class WTL.WTLBTTask_BlueprintBase
// Size: 0xa8 (Inherited: 0xa8)
struct UWTLBTTask_BlueprintBase : UBTTask_BlueprintBase {
};

// Class WTL.WTLBTTask_EnemyNPC_MoveTo
// Size: 0xd8 (Inherited: 0x98)
struct UWTLBTTask_EnemyNPC_MoveTo : UBTTask_BlackboardBase {
	float AcceptableRadius; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
	struct UNavigationQueryFilter* FilterClass; // 0xa0(0x08)
	float ObservedBlackboardValueTolerance; // 0xa8(0x04)
	char bObserveBlackboardValue : 1; // 0xac(0x01)
	char bAllowStrafe : 1; // 0xac(0x01)
	char bAllowPartialPath : 1; // 0xac(0x01)
	char bTrackMovingGoal : 1; // 0xac(0x01)
	char bProjectGoalLocation : 1; // 0xac(0x01)
	char bReachTestIncludesAgentRadius : 1; // 0xac(0x01)
	char bReachTestIncludesGoalRadius : 1; // 0xac(0x01)
	char bStopOnOverlap : 1; // 0xac(0x01)
	char bStopOnOverlapNeedsUpdate : 1; // 0xad(0x01)
	char pad_AD_1 : 7; // 0xad(0x01)
	char pad_AE[0x2]; // 0xae(0x02)
	struct FBlackboardKeySelector AcceptableRadiusKey; // 0xb0(0x28)
};

// Class WTL.WTLBTTask_FindClosestMonster
// Size: 0x78 (Inherited: 0x70)
struct UWTLBTTask_FindClosestMonster : UBTTaskNode {
	float ApplyRadius; // 0x70(0x04)
	bool EdibleForMonster; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
};

// Class WTL.WTLBTTask_FrightRadius
// Size: 0x78 (Inherited: 0x70)
struct UWTLBTTask_FrightRadius : UBTTaskNode {
	float ApplyRadius; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class WTL.WTLBTTask_Idle
// Size: 0x70 (Inherited: 0x70)
struct UWTLBTTask_Idle : UBTTaskNode {
};

// Class WTL.WTLBTTask_MonsterAction
// Size: 0x78 (Inherited: 0x70)
struct UWTLBTTask_MonsterAction : UBTTaskNode {
	enum class EWTLMonsterActionType Action; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class WTL.WTLBTTask_MoveDirectlyToward
// Size: 0xe8 (Inherited: 0xb8)
struct UWTLBTTask_MoveDirectlyToward : UBTTask_MoveDirectlyToward {
	bool bUseAcceptableRadiusFromBlackboard; // 0xb8(0x01)
	char pad_B9[0x7]; // 0xb9(0x07)
	struct FBlackboardKeySelector AcceptableRadiusBlackboardKey; // 0xc0(0x28)
};

// Class WTL.WTLBTTask_RunBehaviorStealth
// Size: 0x88 (Inherited: 0x78)
struct UWTLBTTask_RunBehaviorStealth : UBTTask_RunBehavior {
	struct TArray<enum class EWTLMonsterState> StatesForExecute; // 0x78(0x10)
};

// Class WTL.WTLBTTask_SetAIState
// Size: 0x78 (Inherited: 0x70)
struct UWTLBTTask_SetAIState : UBTTaskNode {
	enum class EWTLMonsterState SetState; // 0x70(0x01)
	enum class EWTMonsterSecondaryState SetSecondaryState; // 0x71(0x01)
	char pad_72[0x6]; // 0x72(0x06)
};

// Class WTL.WTLBTTask_SetMovementMode
// Size: 0x78 (Inherited: 0x70)
struct UWTLBTTask_SetMovementMode : UBTTaskNode {
	enum class EWTLMonsterMovementMode MovementMode; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class WTL.WTLBTTask_SetStealthMode
// Size: 0x78 (Inherited: 0x70)
struct UWTLBTTask_SetStealthMode : UBTTaskNode {
	bool Value; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class WTL.WTLBTTask_WTLMoveTo
// Size: 0xe0 (Inherited: 0xb0)
struct UWTLBTTask_WTLMoveTo : UBTTask_MoveTo {
	bool bUseAcceptableRadiusFromBlackboard; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
	struct FBlackboardKeySelector AcceptableRadiusBlackboardKey; // 0xb8(0x28)
};

// Class WTL.WTLBulletHellBase
// Size: 0x440 (Inherited: 0x220)
struct AWTLBulletHellBase : AActor {
	char pad_220[0x100]; // 0x220(0x100)
	struct UProceduralMeshComponent* m_ProcMesh; // 0x320(0x08)
	bool UseBillboard; // 0x328(0x01)
	char pad_329[0x7]; // 0x329(0x07)
	struct UMaterialInterface* Material; // 0x330(0x08)
	struct UStaticMesh* RenderMesh; // 0x338(0x08)
	struct UMaterialInterface* TailMaterial; // 0x340(0x08)
	bool AutoDestroy; // 0x348(0x01)
	char pad_349[0x3]; // 0x349(0x03)
	int32_t AttackMode; // 0x34c(0x04)
	struct FVector SpawnAxisX; // 0x350(0x0c)
	float PhysicsFps; // 0x35c(0x04)
	float ServerStartDelay; // 0x360(0x04)
	float ClientStartDelay; // 0x364(0x04)
	float MeshUpdateRate; // 0x368(0x04)
	float LoopDuration; // 0x36c(0x04)
	float SpawnRate; // 0x370(0x04)
	struct FRotator RotateSpawnAxisX; // 0x374(0x0c)
	float SpawnCountBurst; // 0x380(0x04)
	bool IsLinearSpawn; // 0x384(0x01)
	char pad_385[0x3]; // 0x385(0x03)
	struct FVector2D BulletSpeed; // 0x388(0x08)
	struct FVector2D LifeTime; // 0x390(0x08)
	struct FVector2D BounceCount; // 0x398(0x08)
	bool OnlyNegativeZ; // 0x3a0(0x01)
	bool UseConeSpread; // 0x3a1(0x01)
	char pad_3A2[0x2]; // 0x3a2(0x02)
	struct FVector2D ConeSpread; // 0x3a4(0x08)
	struct FVector2D ConeSpreadRadius; // 0x3ac(0x08)
	struct FVector Drag; // 0x3b4(0x0c)
	struct FVector Gravity; // 0x3c0(0x0c)
	bool UseCurveBulletSpeed; // 0x3cc(0x01)
	char pad_3CD[0x3]; // 0x3cd(0x03)
	struct UCurveFloat* CurveBulletSpeed; // 0x3d0(0x08)
	bool UseCurveScaleLocation; // 0x3d8(0x01)
	char pad_3D9[0x7]; // 0x3d9(0x07)
	struct UCurveVector* CurveScaleLocation; // 0x3e0(0x08)
	float CurveSpeedScale; // 0x3e8(0x04)
	bool UseTail; // 0x3ec(0x01)
	char pad_3ED[0x3]; // 0x3ed(0x03)
	float DistFromVelocity; // 0x3f0(0x04)
	struct FVector2D Damage; // 0x3f4(0x08)
	float CollisionTime; // 0x3fc(0x04)
	float SphereTraceRadius; // 0x400(0x04)
	char pad_404[0x4]; // 0x404(0x04)
	struct TArray<enum class EObjectTypeQuery> CollisionTraceQuery; // 0x408(0x10)
	bool SpawnActorOnHit; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct AActor* SpawnActor; // 0x420(0x08)
	float DrawDebugTime; // 0x428(0x04)
	enum class EDrawDebugTrace ServerDrawDebugTrace; // 0x42c(0x01)
	enum class EDrawDebugTrace ClientDrawDebugTrace; // 0x42d(0x01)
	char pad_42E[0x2]; // 0x42e(0x02)
	float BulletRadius; // 0x430(0x04)
	float StartTime; // 0x434(0x04)
	char pad_438[0x8]; // 0x438(0x08)
};

// Class WTL.WTLBulletHellBillboardComponent
// Size: 0x480 (Inherited: 0x470)
struct UWTLBulletHellBillboardComponent : UMeshComponent {
	struct TArray<struct FWTLMaterialSpriteElement> Elements; // 0x468(0x10)

	void SetElements(struct TArray<struct FWTLMaterialSpriteElement>& NewElements); // Function WTL.WTLBulletHellBillboardComponent.SetElements // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x17a40a0
	void AddElement(struct UMaterialInterface* Material, struct UCurveFloat* DistanceToOpacityCurve, bool bSizeIsInScreenSpace, float BaseSizeX, float BaseSizeY, struct UCurveFloat* DistanceToSizeCurve); // Function WTL.WTLBulletHellBillboardComponent.AddElement // (Final|Native|Public|BlueprintCallable) // @ game+0x17a3ca0
};

// Class WTL.WTLBulletinBoard
// Size: 0x2d8 (Inherited: 0x220)
struct AWTLBulletinBoard : AActor {
	char pad_220[0x20]; // 0x220(0x20)
	struct UStaticMeshComponent* Mesh; // 0x240(0x08)
	struct UStaticMeshComponent* BulletinMesh1; // 0x248(0x08)
	struct UStaticMeshComponent* BulletinMesh2; // 0x250(0x08)
	struct UStaticMeshComponent* BulletinMesh3; // 0x258(0x08)
	struct FVector Bulletin1CenterLocation; // 0x260(0x0c)
	struct FVector Bulletin2CenterLocation; // 0x26c(0x0c)
	struct FVector Bulletin3CenterLocation; // 0x278(0x0c)
	float BulletinHorizontalLocationDelta; // 0x284(0x04)
	float BulletinVerticalLocationDelta; // 0x288(0x04)
	float BulletinRotationDelta; // 0x28c(0x04)
	struct FVector BulletinOriginalScale; // 0x290(0x0c)
	float BulletinScaleDelta; // 0x29c(0x04)
	struct TArray<struct UMaterialInstance*> BulletinMaterials; // 0x2a0(0x10)
	struct TArray<int32_t> QuestList; // 0x2b0(0x10)
	enum class EWTLFaction Faction; // 0x2c0(0x01)
	bool m_IsActive; // 0x2c1(0x01)
	char pad_2C2[0x16]; // 0x2c2(0x16)

	void SetIsActive(bool Value); // Function WTL.WTLBulletinBoard.SetIsActive // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1773b90
	void OnRep_IsActive(); // Function WTL.WTLBulletinBoard.OnRep_IsActive // (Final|Native|Private) // @ game+0x17a5a70
	void OnIsActiveChanged(bool IsActive); // Function WTL.WTLBulletinBoard.OnIsActiveChanged // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	bool GetIsActive(); // Function WTL.WTLBulletinBoard.GetIsActive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17a5a50
};

// Class WTL.WTLProjectile
// Size: 0x248 (Inherited: 0x220)
struct AWTLProjectile : AActor {
	struct USphereComponent* CollisionComp; // 0x220(0x08)
	struct UWTLProjectileMovementComponent* ProjectileMovement; // 0x228(0x08)
	enum class EProjectileType Type; // 0x230(0x01)
	bool bShowDebugInfo; // 0x231(0x01)
	bool bDrawAimingTrajectory; // 0x232(0x01)
	char pad_233[0x1]; // 0x233(0x01)
	struct FColor AimingTrajectoryColor; // 0x234(0x04)
	float AimingTrajectoryThickness; // 0x238(0x04)
	bool bDrawActualTrajectory; // 0x23c(0x01)
	char pad_23D[0x3]; // 0x23d(0x03)
	float ActualTrajectoryThickness; // 0x240(0x04)
	float DebugInfoLifetime; // 0x244(0x04)
};

// Class WTL.WTLBulletProjectile
// Size: 0x338 (Inherited: 0x248)
struct AWTLBulletProjectile : AWTLProjectile {
	char pad_248[0xb1]; // 0x248(0xb1)
	bool CanRicochet; // 0x2f9(0x01)
	char RicochetChance; // 0x2fa(0x01)
	char MaxRicochetCount; // 0x2fb(0x01)
	float MinRicochetAngle; // 0x2fc(0x04)
	float MinRicochetVelocity; // 0x300(0x04)
	float MinRicochetVelocityDelta; // 0x304(0x04)
	float MaxRicochetVelocityDelta; // 0x308(0x04)
	float PenetrationEndRandomHalfCone; // 0x30c(0x04)
	float InitialDamage; // 0x310(0x04)
	bool bDrawHitPoints; // 0x314(0x01)
	char pad_315[0x3]; // 0x315(0x03)
	struct FColor HitPointsColor; // 0x318(0x04)
	bool bDrawPenetrationExitPoints; // 0x31c(0x01)
	char pad_31D[0x3]; // 0x31d(0x03)
	struct FColor PenetrationExitPointsColor; // 0x320(0x04)
	bool bDrawRicochetPoints; // 0x324(0x01)
	char pad_325[0x3]; // 0x325(0x03)
	struct FColor RicochetPointsColor; // 0x328(0x04)
	bool bDrawDestroyPoint; // 0x32c(0x01)
	char pad_32D[0x3]; // 0x32d(0x03)
	struct FColor DestroyPointColor; // 0x330(0x04)
	char pad_334[0x4]; // 0x334(0x04)

	void OnProjectileBounce(struct FHitResult& ImpactResult, struct FVector& ImpactVelocity); // Function WTL.WTLBulletProjectile.OnProjectileBounce // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x17a5d20
	void OnHit(struct UPrimitiveComponent* HitComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult& Hit); // Function WTL.WTLBulletProjectile.OnHit // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x17a5ef0
};

// Class WTL.WTLBulletTracer
// Size: 0x2b0 (Inherited: 0x220)
struct AWTLBulletTracer : AActor {
	char pad_220[0x60]; // 0x220(0x60)
	struct UWTLProjectileMovementComponent* ProjectileMovement; // 0x280(0x08)
	float InitialVelocity; // 0x288(0x04)
	char pad_28C[0x4]; // 0x28c(0x04)
	struct UCurveFloat* VelocityCurve; // 0x290(0x08)
	struct UCurveFloat* GravityCurve; // 0x298(0x08)
	bool DrawDebugInfo; // 0x2a0(0x01)
	char pad_2A1[0x3]; // 0x2a1(0x03)
	float DebugInfoLifetime; // 0x2a4(0x04)
	float DebugInfoLineThickness; // 0x2a8(0x04)
	char pad_2AC[0x4]; // 0x2ac(0x04)

	void OnTracerDestroyed(struct AActor* DestroyedActor); // Function WTL.WTLBulletTracer.OnTracerDestroyed // (Final|Native|Private) // @ game+0x17a6330
};

// Class WTL.WTLUsable
// Size: 0x3c0 (Inherited: 0x220)
struct AWTLUsable : AActor {
	char pad_220[0x18]; // 0x220(0x18)
	int64_t m_ItemID; // 0x238(0x08)
	int16_t m_ItemTypeID; // 0x240(0x02)
	char pad_242[0x50]; // 0x242(0x50)
	bool m_bIsSnuggled; // 0x292(0x01)
	char pad_293[0x25]; // 0x293(0x25)
	float PauseBetweenUse; // 0x2b8(0x04)
	int32_t m_FastAccessSlotIndex; // 0x2bc(0x04)
	struct USkeletalMeshComponent* SkeletalMesh; // 0x2c0(0x08)
	char pad_2C8[0x8]; // 0x2c8(0x08)
	bool HideFastAccessSlots; // 0x2d0(0x01)
	char pad_2D1[0xf]; // 0x2d1(0x0f)
	struct FItemAnimationSet EquipSequenceSet; // 0x2e0(0x18)
	float EquipTimeWithoutAnimation; // 0x2f8(0x04)
	char pad_2FC[0x4]; // 0x2fc(0x04)
	struct FItemAnimationSet UnequipSequenceSet; // 0x300(0x18)
	float UnequipTimeWithoutAnimation; // 0x318(0x04)
	char pad_31C[0x4]; // 0x31c(0x04)
	struct UAnimationAsset* MaleIdleStateAnimation; // 0x320(0x08)
	struct UAnimationAsset* FemaleIdleStateAnimation; // 0x328(0x08)
	struct UAnimationAsset* MaleSnuggleAnimation; // 0x330(0x08)
	struct UAnimationAsset* FemaleSnuggleAnimation; // 0x338(0x08)
	struct UAimOffsetBlendSpace1D* MaleAimOffsetBlendSpace; // 0x340(0x08)
	struct UAimOffsetBlendSpace1D* FemaleAimOffsetBlendSpace; // 0x348(0x08)
	struct TArray<struct FItemAnimationSet> IdleSequenceSetArray; // 0x350(0x10)
	float IdleAnimationTimeoutMin; // 0x360(0x04)
	float IdleAnimationTimeoutMax; // 0x364(0x04)
	bool bCanBeSnuggled; // 0x368(0x01)
	char pad_369[0x3]; // 0x369(0x03)
	float SnuggleTraceRange; // 0x36c(0x04)
	struct TArray<float> AnimationFloatParameters; // 0x370(0x10)
	struct TArray<struct FVector> AnimationVectorParameters; // 0x380(0x10)
	struct TArray<float> FemaleAnimationFloatParameters; // 0x390(0x10)
	struct TArray<struct FVector> FemaleAnimationVectorParameters; // 0x3a0(0x10)
	struct FVector HandsOffset; // 0x3b0(0x0c)
	char pad_3BC[0x4]; // 0x3bc(0x04)

	void NetMulticast_PutToInventory(); // Function WTL.WTLUsable.NetMulticast_PutToInventory // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x17ee270
	struct USkeletalMeshComponent* GetMesh(); // Function WTL.WTLUsable.GetMesh // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x19461e0
	void BP_CustomActionTrigger(struct FName Name); // Function WTL.WTLUsable.BP_CustomActionTrigger // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
};

// Class WTL.WTLStuff
// Size: 0x458 (Inherited: 0x3c0)
struct AWTLStuff : AWTLUsable {
	char pad_3C0[0x28]; // 0x3c0(0x28)
	struct FItemAnimationSet UseSequenceSet; // 0x3e8(0x18)
	struct FItemAnimationSet AlternateUseSequenceSet; // 0x400(0x18)
	struct FItemAnimationSet RechargeSequenceSet; // 0x418(0x18)
	char pad_430[0x4]; // 0x430(0x04)
	bool UseActivity; // 0x434(0x01)
	char pad_435[0x3]; // 0x435(0x03)
	float ActivityUpInterpSpeed; // 0x438(0x04)
	float ActivityDownInterpSpeed; // 0x43c(0x04)
	struct FVector AimingHandsTranslationMale; // 0x440(0x0c)
	struct FVector AimingHandsTranslationFemale; // 0x44c(0x0c)

	void Server_OnCharge(); // Function WTL.WTLStuff.Server_OnCharge // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x192dd70
	void OnReload(); // Function WTL.WTLStuff.OnReload // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x10fc6a0
	void NetMulticast_Recharge(); // Function WTL.WTLStuff.NetMulticast_Recharge // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x191d950
};

// Class WTL.WTLCameraDisplay
// Size: 0x4d8 (Inherited: 0x458)
struct AWTLCameraDisplay : AWTLStuff {
	char pad_458[0x10]; // 0x458(0x10)
	float DesiredFOV; // 0x468(0x04)
	float FOVChangeSpeed; // 0x46c(0x04)
	struct UWidgetComponent* ScreenWidget; // 0x470(0x08)
	float CameraPitchDesiredValue; // 0x478(0x04)
	char pad_47C[0x4]; // 0x47c(0x04)
	struct TArray<struct FWTLDisplayAnimationSet> AnimationsList; // 0x480(0x10)
	char pad_490[0x20]; // 0x490(0x20)
	struct UAnimMontage* CharacterUsingMontage; // 0x4b0(0x08)
	struct UAnimMontage* TabletUsingMontage; // 0x4b8(0x08)
	struct UAnimMontage* CharacterButtonMontage; // 0x4c0(0x08)
	struct UAnimMontage* TabletButtonMontage; // 0x4c8(0x08)
	struct UAnimationAsset* TabletWithOpenedAntennasAnim; // 0x4d0(0x08)

	void K2_StickInputDirection(float InputUp, float InputRight); // Function WTL.WTLCameraDisplay.K2_StickInputDirection // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
};

// Class WTL.WTLStaticReplicatedActor
// Size: 0x220 (Inherited: 0x220)
struct AWTLStaticReplicatedActor : AActor {
};

// Class WTL.WTLPlaceableStuff
// Size: 0x398 (Inherited: 0x220)
struct AWTLPlaceableStuff : AWTLStaticReplicatedActor {
	char pad_220[0x70]; // 0x220(0x70)
	uint64_t m_CharacterID; // 0x290(0x08)
	struct FString m_CharacterName; // 0x298(0x10)
	uint64_t m_CharacterGroupID; // 0x2a8(0x08)
	uint16_t m_CharacterClanID; // 0x2b0(0x02)
	enum class EWTLFaction m_CharacterFaction; // 0x2b2(0x01)
	char pad_2B3[0xad]; // 0x2b3(0xad)
	bool CanTakeDamageFromFactionMembers; // 0x360(0x01)
	char pad_361[0x3]; // 0x361(0x03)
	float DamageToConditionMultiplier; // 0x364(0x04)
	float ExplosionDamageMultiplier; // 0x368(0x04)
	uint32_t m_Condition; // 0x36c(0x04)
	int32_t StuffID; // 0x370(0x04)
	bool SaveStateToDB; // 0x374(0x01)
	char pad_375[0x3]; // 0x375(0x03)
	float SaveStateToDBInterval; // 0x378(0x04)
	char pad_37C[0x4]; // 0x37c(0x04)
	struct FText FullStuffName; // 0x380(0x18)

	void OnTakedBack(struct AWTLCharacter* EventInstigator); // Function WTL.WTLPlaceableStuff.OnTakedBack // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnRep_Condition(); // Function WTL.WTLPlaceableStuff.OnRep_Condition // (Native|Protected) // @ game+0xba4570
	void OnPlaced(struct AWTLCharacter* EventInstigator); // Function WTL.WTLPlaceableStuff.OnPlaced // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnEnergyChanged(float EnergyValue); // Function WTL.WTLPlaceableStuff.OnEnergyChanged // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnConditionChanged(float ConditionValue); // Function WTL.WTLPlaceableStuff.OnConditionChanged // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void NetMulticast_OnDestroyed(); // Function WTL.WTLPlaceableStuff.NetMulticast_OnDestroyed // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x17ee270
	void K2_OnDestroyed(); // Function WTL.WTLPlaceableStuff.K2_OnDestroyed // (Event|Protected|BlueprintEvent) // @ game+0x1ad0090
	void BPCustomAnimTrigger(struct FName TriggerName); // Function WTL.WTLPlaceableStuff.BPCustomAnimTrigger // (Event|Protected|BlueprintEvent) // @ game+0x1ad0090
	int32_t BP_GetMaxCondition(); // Function WTL.WTLPlaceableStuff.BP_GetMaxCondition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1898480
	int32_t BP_GetCondition(); // Function WTL.WTLPlaceableStuff.BP_GetCondition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x18984a0
};

// Class WTL.WTLCampfire
// Size: 0x550 (Inherited: 0x398)
struct AWTLCampfire : AWTLPlaceableStuff {
	char pad_398[0xa8]; // 0x398(0xa8)
	float m_Energy; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)
	struct FWTLStorageContent m_StorageContent; // 0x448(0xa8)
	char pad_4F0[0x30]; // 0x4f0(0x30)
	struct UStaticMeshComponent* Mesh; // 0x520(0x08)
	struct TArray<enum class EObjectTypeQuery> WarmzoneObjectTypes; // 0x528(0x10)
	float WarmzoneRadius; // 0x538(0x04)
	float WarmzoneHealingPercentPerSecond; // 0x53c(0x04)
	float StartEnergy; // 0x540(0x04)
	float MaxEnergy; // 0x544(0x04)
	float EnergyDecrementPerSecond; // 0x548(0x04)
	char pad_54C[0x4]; // 0x54c(0x04)

	void OnRep_StorageContent(); // Function WTL.WTLCampfire.OnRep_StorageContent // (Final|Native|Private) // @ game+0x17a6930
	void OnRep_Energy(); // Function WTL.WTLCampfire.OnRep_Energy // (Final|Native|Private) // @ game+0x17a68b0
};

// Class WTL.WTLCanvasDrawableInterface
// Size: 0x28 (Inherited: 0x28)
struct UWTLCanvasDrawableInterface : UInterface {
};

// Class WTL.WTLCaptureComponent2D
// Size: 0x8b0 (Inherited: 0x8b0)
struct UWTLCaptureComponent2D : USceneCaptureComponent2D {
};

// Class WTL.WTLCharacter
// Size: 0x19d0 (Inherited: 0x4c0)
struct AWTLCharacter : ACharacter {
	char pad_4C0[0x70]; // 0x4c0(0x70)
	bool bIsMovementEnabled; // 0x530(0x01)
	char pad_531[0x1f]; // 0x531(0x1f)
	float m_ReplicatedStamina; // 0x550(0x04)
	char pad_554[0x4]; // 0x554(0x04)
	float m_ReplicatedOxygen; // 0x558(0x04)
	char pad_55C[0xbc]; // 0x55c(0xbc)
	bool m_FlashlightEnabled; // 0x618(0x01)
	bool m_IsInvulnerable; // 0x619(0x01)
	bool m_IsInSafeZone; // 0x61a(0x01)
	bool m_CanSpawnOnSafeZone; // 0x61b(0x01)
	bool m_IsInMobileResurectionPointWorkZone; // 0x61c(0x01)
	bool m_IsInPVPZone; // 0x61d(0x01)
	bool m_IsTraveling; // 0x61e(0x01)
	char pad_61F[0x61]; // 0x61f(0x61)
	struct AWTLEventPoint* m_LastEventPoint; // 0x680(0x08)
	bool m_AdminSprintMode; // 0x688(0x01)
	char pad_689[0x2f]; // 0x689(0x2f)
	bool m_IsHoldingBreath; // 0x6b8(0x01)
	char pad_6B9[0x1f]; // 0x6b9(0x1f)
	bool m_AgressorFlag; // 0x6d8(0x01)
	char pad_6D9[0x17]; // 0x6d9(0x17)
	bool bIsInFishingZone; // 0x6f0(0x01)
	bool bIsPlacingItem; // 0x6f1(0x01)
	char pad_6F2[0x1]; // 0x6f2(0x01)
	bool m_bIsInQuickThrowingState; // 0x6f3(0x01)
	char pad_6F4[0x24]; // 0x6f4(0x24)
	float m_CurrentRadiationLevel; // 0x718(0x04)
	char pad_71C[0xbc]; // 0x71c(0xbc)
	struct FSpeedModifiers m_SpeedModifiers; // 0x7d8(0x08)
	float ScopeOccluderDelta; // 0x7e0(0x04)
	float MonocularOccluderDelta; // 0x7e4(0x04)
	struct TSoftObjectPtr<UFMODEvent> DeathBreathSoundEvent; // 0x7e8(0x28)
	struct TSoftObjectPtr<UFMODEvent> StartHoldingBreathSoundEvent; // 0x810(0x28)
	struct TSoftObjectPtr<UFMODEvent> StopHoldingBreathSoundEvent; // 0x838(0x28)
	struct TSoftObjectPtr<UFMODEvent> TeleportSoundEvent; // 0x860(0x28)
	struct TSoftObjectPtr<UFMODEvent> HearingDamageEvent; // 0x888(0x28)
	struct TSoftObjectPtr<USoundMix> DrunkSoundMix; // 0x8b0(0x28)
	float WalkFootstepMinInterval; // 0x8d8(0x04)
	float WalkFootstepVolume; // 0x8dc(0x04)
	float SprintFootstepMinInterval; // 0x8e0(0x04)
	float SprintFootstepVolume; // 0x8e4(0x04)
	float CrouchFootstepMinInterval; // 0x8e8(0x04)
	float CrouchFootstepVolume; // 0x8ec(0x04)
	float AimFootstepVolumeMultiplier; // 0x8f0(0x04)
	char pad_8F4[0xc]; // 0x8f4(0x0c)
	struct USkeletalMeshComponent* MeshTorso; // 0x900(0x08)
	struct USkeletalMeshComponent* MeshLegs; // 0x908(0x08)
	struct USkeletalMeshComponent* MeshFeet; // 0x910(0x08)
	struct USkeletalMeshComponent* MeshHead; // 0x918(0x08)
	struct USkeletalMeshComponent* MeshNeck; // 0x920(0x08)
	struct USkeletalMeshComponent* MeshHeadSlot; // 0x928(0x08)
	struct USkeletalMeshComponent* MeshTorsoSlot; // 0x930(0x08)
	struct USkeletalMeshComponent* MeshLegsSlot; // 0x938(0x08)
	struct USkeletalMeshComponent* MeshFeetSlot; // 0x940(0x08)
	struct USkeletalMeshComponent* BackpackSlot; // 0x948(0x08)
	struct USkeletalMeshComponent* GlassesSlot; // 0x950(0x08)
	struct USkeletalMeshComponent* WatchesSlot; // 0x958(0x08)
	struct USkeletalMeshComponent* EquipmentSlot1; // 0x960(0x08)
	struct USkeletalMeshComponent* EquipmentSlot2; // 0x968(0x08)
	struct USkeletalMeshComponent* EquipmentSlot3; // 0x970(0x08)
	struct USkeletalMeshComponent* EquipmentSlot4; // 0x978(0x08)
	struct UStaticMeshComponent* EquippedWeaponPreviewSlot0; // 0x980(0x08)
	struct UStaticMeshComponent* EquippedWeaponPreviewSlot0MuzzleMount; // 0x988(0x08)
	struct UStaticMeshComponent* EquippedWeaponPreviewSlot0MuzzleAttachment; // 0x990(0x08)
	struct UStaticMeshComponent* EquippedWeaponPreviewSlot0FlashlightMount; // 0x998(0x08)
	struct UStaticMeshComponent* EquippedWeaponPreviewSlot0FlashlightAttachment; // 0x9a0(0x08)
	struct UStaticMeshComponent* EquippedWeaponPreviewSlot0ScopeMount; // 0x9a8(0x08)
	struct UStaticMeshComponent* EquippedWeaponPreviewSlot0ScopeAttachment; // 0x9b0(0x08)
	struct UStaticMeshComponent* EquippedWeaponPreviewSlot1; // 0x9b8(0x08)
	struct UStaticMeshComponent* EquippedWeaponPreviewSlot1MuzzleMount; // 0x9c0(0x08)
	struct UStaticMeshComponent* EquippedWeaponPreviewSlot1MuzzleAttachment; // 0x9c8(0x08)
	struct UStaticMeshComponent* EquippedWeaponPreviewSlot1FlashlightMount; // 0x9d0(0x08)
	struct UStaticMeshComponent* EquippedWeaponPreviewSlot1FlashlightAttachment; // 0x9d8(0x08)
	struct UStaticMeshComponent* EquippedWeaponPreviewSlot1ScopeMount; // 0x9e0(0x08)
	struct UStaticMeshComponent* EquippedWeaponPreviewSlot1ScopeAttachment; // 0x9e8(0x08)
	struct UStaticMeshComponent* EquippedStuffPreviewSlot5; // 0x9f0(0x08)
	struct UStaticMeshComponent* HolsterSlot; // 0x9f8(0x08)
	struct UStaticMeshComponent* EquippedPistolPreviewSlot; // 0xa00(0x08)
	struct UStaticMeshComponent* SheathSlot; // 0xa08(0x08)
	struct UStaticMeshComponent* SheathPreviewSlot; // 0xa10(0x08)
	struct UWTLFlashlightMountComponent* FlashlightComponent; // 0xa18(0x08)
	struct USpotLightComponent* LightComponent; // 0xa20(0x08)
	struct UStaticMeshComponent* FlashlightMesh; // 0xa28(0x08)
	struct UStaticMeshComponent* ScopeOccluderMesh; // 0xa30(0x08)
	struct USphereComponent* BulletFlyNearVolume; // 0xa38(0x08)
	struct UAudioComponent* HeartbeatAudioComponent; // 0xa40(0x08)
	struct UFMODAudioComponent* CharacterVoiceComponent; // 0xa48(0x08)
	struct UFMODAudioComponent* NDPDetectorAudioComponent; // 0xa50(0x08)
	struct UFMODAudioComponent* RadiationDetectorAudioComponent; // 0xa58(0x08)
	struct UWTLFMODCharacterVoiceComponent* VOIPComponent; // 0xa60(0x08)
	struct UWTLCharacterIdentityComponent* IdentityComponent; // 0xa68(0x08)
	struct UMaterialBillboardComponent* VOIPIndicatorSprite; // 0xa70(0x08)
	char pad_A78[0x8]; // 0xa78(0x08)
	struct UPawnNoiseEmitterComponent* NoiseEmitterComponent; // 0xa80(0x08)
	struct UWidgetInteractionComponent* WidgetInteraction; // 0xa88(0x08)
	char pad_A90[0x4]; // 0xa90(0x04)
	bool bIsDying; // 0xa94(0x01)
	bool bIsAimToggle; // 0xa95(0x01)
	bool bIsCrouchToggle; // 0xa96(0x01)
	bool bIsSprintToggle; // 0xa97(0x01)
	bool bAllowRebasing; // 0xa98(0x01)
	char pad_A99[0x3]; // 0xa99(0x03)
	float RebasingDistance; // 0xa9c(0x04)
	struct FTakeHitInfo LastTakeHitInfo; // 0xaa0(0x220)
	char pad_CC0[0x21]; // 0xcc0(0x21)
	enum class EWTLHandsState HandsState; // 0xce1(0x01)
	char pad_CE2[0x6]; // 0xce2(0x06)
	struct AWTLUsable* UsableItemInHands; // 0xce8(0x08)
	struct AWTLUsable* QuickItemInHands; // 0xcf0(0x08)
	bool bIsAiming; // 0xcf8(0x01)
	bool bIsSprinting; // 0xcf9(0x01)
	char pad_CFA[0x2]; // 0xcfa(0x02)
	bool bIsJumping; // 0xcfc(0x01)
	enum class EWTLCharacterPose CurrentPose; // 0xcfd(0x01)
	char pad_CFE[0x2]; // 0xcfe(0x02)
	float SprintSpeed; // 0xd00(0x04)
	float WalkSpeed; // 0xd04(0x04)
	float CrouchSpeed; // 0xd08(0x04)
	float ProneSpeed; // 0xd0c(0x04)
	float SwimSpeed; // 0xd10(0x04)
	float AimSpeedMultiplier; // 0xd14(0x04)
	float MaxStamina; // 0xd18(0x04)
	float StaminaNotMovingIncrement; // 0xd1c(0x04)
	float StaminaMovingIncrement; // 0xd20(0x04)
	float StaminaSprintDecrement; // 0xd24(0x04)
	float StaminaPercentSprintAvailability; // 0xd28(0x04)
	float StaminaJumpDecrementPercent; // 0xd2c(0x04)
	float StaminaHoldingBreathDecrement; // 0xd30(0x04)
	float StaminaWaterMovementDecrement; // 0xd34(0x04)
	float StaminaUnderwaterDecrement; // 0xd38(0x04)
	float MaxOxygen; // 0xd3c(0x04)
	float OxygenNoBreatheDecrement; // 0xd40(0x04)
	float OxygenBreatheIncrement; // 0xd44(0x04)
	float StandMinPitchAngle; // 0xd48(0x04)
	float StandMaxPitchAngle; // 0xd4c(0x04)
	float CrouchMinPitchAngle; // 0xd50(0x04)
	float CrouchMaxPitchAngle; // 0xd54(0x04)
	float ProneMinPitchAngle; // 0xd58(0x04)
	float ProneMaxPitchAngle; // 0xd5c(0x04)
	float SwimMinPitchAngle; // 0xd60(0x04)
	float SwimMaxPitchAngle; // 0xd64(0x04)
	float GravityScaleInWater; // 0xd68(0x04)
	float GravityScaleUnderWater; // 0xd6c(0x04)
	float GravityScaleOnLand; // 0xd70(0x04)
	char pad_D74[0x18]; // 0xd74(0x18)
	float m_CameraOffsetInterpSpeed; // 0xd8c(0x04)
	char pad_D90[0x1a8]; // 0xd90(0x1a8)
	struct AActor* m_InteractiveObjectInFocus; // 0xf38(0x08)
	char pad_F40[0x10]; // 0xf40(0x10)
	struct TArray<enum class EObjectTypeQuery> InterestObjectTypes; // 0xf50(0x10)
	float InterestTraceRadius; // 0xf60(0x04)
	char pad_F64[0x24]; // 0xf64(0x24)
	bool bEnableHandsStateDebugging; // 0xf88(0x01)
	char pad_F89[0x1f]; // 0xf89(0x1f)
	bool m_bIsUnderWater; // 0xfa8(0x01)
	bool m_bIsInWater; // 0xfa9(0x01)
	bool m_bMovesOnWater; // 0xfaa(0x01)
	char pad_FAB[0x5]; // 0xfab(0x05)
	struct TSoftObjectPtr<UTexture2D> m_CharacterEffectsTexture; // 0xfb0(0x28)
	struct TMap<enum class EWTLCharacterEffectType, struct FVector2D> m_CharacterEffectIconsCoords; // 0xfd8(0x50)
	struct TMap<enum class EWTLCharacterStateIndicatorType, struct FVector2D> m_CharacterIndicatorIconsCoords; // 0x1028(0x50)
	struct TSoftObjectPtr<UFont> Font; // 0x1078(0x28)
	struct TSoftObjectPtr<UTexture2D> DotPointerTexture; // 0x10a0(0x28)
	char pad_10C8[0x5c]; // 0x10c8(0x5c)
	float m_DesiredTiltValue; // 0x1124(0x04)
	struct TSoftObjectPtr<UMaterialInterface> m_PlacementPreviewItemMaterial; // 0x1128(0x28)
	struct FLinearColor m_RightPlacementColor; // 0x1150(0x10)
	struct FLinearColor m_WrongPlacementColor; // 0x1160(0x10)
	char pad_1170[0x10]; // 0x1170(0x10)
	struct AStaticMeshActor* M_PlacementPointer; // 0x1180(0x08)
	char pad_1188[0x10]; // 0x1188(0x10)
	struct UMaterialInstanceDynamic* m_PlacementPreviewMaterialInstance; // 0x1198(0x08)
	char pad_11A0[0xc]; // 0x11a0(0x0c)
	float UndergroundFlashlightIntensityMultiplier; // 0x11ac(0x04)
	float OtherCharacterFlashlightIntensityMultiplier; // 0x11b0(0x04)
	char pad_11B4[0x1c]; // 0x11b4(0x1c)
	bool m_bIsFishing; // 0x11d0(0x01)
	char pad_11D1[0x3]; // 0x11d1(0x03)
	struct FWTLQTEState QTEState; // 0x11d4(0x10)
	char pad_11E4[0x74]; // 0x11e4(0x74)
	enum class EWTLSex BlueprintSex; // 0x1258(0x01)
	char pad_1259[0x87]; // 0x1259(0x87)
	struct AActor* m_CurrentActionGameplayActor; // 0x12e0(0x08)
	char pad_12E8[0x2]; // 0x12e8(0x02)
	uint16_t m_CurrentEmotionKey; // 0x12ea(0x02)
	char pad_12EC[0x9]; // 0x12ec(0x09)
	bool m_LeavingFromVehicle; // 0x12f5(0x01)
	char pad_12F6[0x23]; // 0x12f6(0x23)
	bool PersonalEnergyShieldState; // 0x1319(0x01)
	char pad_131A[0xe]; // 0x131a(0x0e)
	struct AWTLDrone* m_Drone; // 0x1328(0x08)
	struct AWTLCameraDisplay* m_DroneCameraDisplay; // 0x1330(0x08)
	struct FMulticastInlineDelegate OnCharacterDestroy; // 0x1338(0x10)
	struct FMulticastInlineDelegate OnTravelingResult; // 0x1348(0x10)
	struct FMulticastInlineDelegate OnCharacterDied; // 0x1358(0x10)
	struct FMulticastInlineDelegate OnCoreHackngResult; // 0x1368(0x10)
	struct FMulticastInlineDelegate OnCharacterLeavedFishingZone; // 0x1378(0x10)
	struct FMulticastInlineDelegate OnCharacterEnteredInFishingZone; // 0x1388(0x10)
	struct FMulticastInlineDelegate OnGameplayActionStarted; // 0x1398(0x10)
	struct FMulticastInlineDelegate OnGameplayActionFinished; // 0x13a8(0x10)
	char pad_13B8[0x1]; // 0x13b8(0x01)
	bool m_bCanUseVehicleInAnomaly; // 0x13b9(0x01)
	char pad_13BA[0x26]; // 0x13ba(0x26)
	struct TSoftClassPtr<UObject> MaleAnimBlueprint; // 0x13e0(0x28)
	struct TSoftClassPtr<UObject> MaleWatchesAnimBlueprint; // 0x1408(0x28)
	struct TSoftClassPtr<UObject> FemaleAnimBlueprint; // 0x1430(0x28)
	struct TSoftClassPtr<UObject> FemaleWatchesAnimBlueprint; // 0x1458(0x28)
	struct FWTLLowerBodyAnimation StandLowerBodyRotation; // 0x1480(0x10)
	struct FWTLLowerBodyAnimation CrouchLowerBodyRotation; // 0x1490(0x10)
	struct UAnimMontage* MaleTimeCheckAnimationMontage; // 0x14a0(0x08)
	struct UAnimMontage* FemaleTimeCheckAnimationMontage; // 0x14a8(0x08)
	struct UAnimMontage* LadderUpStartMontage; // 0x14b0(0x08)
	struct UAnimMontage* LadderUpEndMontage; // 0x14b8(0x08)
	struct UAnimMontage* LadderDownStartMontage; // 0x14c0(0x08)
	struct UAnimMontage* LadderDownEndMontage; // 0x14c8(0x08)
	struct UAnimMontage* ThrowNutMontage; // 0x14d0(0x08)
	struct UAnimMontage* PickItemMontage; // 0x14d8(0x08)
	struct TMap<enum class EWTLCharacterStunhitDirection, struct UAnimMontage*> StunhitAnimations; // 0x14e0(0x50)
	struct TArray<enum class EWTLCharacterStunhitDirection> DrunkAnimationStunhitSet; // 0x1530(0x10)
	struct TSoftObjectPtr<USkeletalMesh> MaleNeckMesh; // 0x1540(0x28)
	struct TSoftObjectPtr<USkeletalMesh> FemaleNeckMesh; // 0x1568(0x28)
	struct TSoftObjectPtr<USkeletalMesh> MaleTorsoMeshFullArms; // 0x1590(0x28)
	struct TSoftObjectPtr<USkeletalMesh> MaleTorsoMeshHalfArms; // 0x15b8(0x28)
	struct TSoftObjectPtr<USkeletalMesh> MaleTorsoMeshHandsOnly; // 0x15e0(0x28)
	struct TSoftObjectPtr<USkeletalMesh> FemaleTorsoMeshFullArms; // 0x1608(0x28)
	struct TSoftObjectPtr<USkeletalMesh> FemaleTorsoMeshHalfArms; // 0x1630(0x28)
	struct TSoftObjectPtr<USkeletalMesh> FemaleTorsoMeshHandsOnly; // 0x1658(0x28)
	struct TSoftClassPtr<UObject> CameraShakeMoveForward; // 0x1680(0x28)
	struct TSoftClassPtr<UObject> CameraShakeMoveForwardAiming; // 0x16a8(0x28)
	struct TSoftClassPtr<UObject> CameraShakeMoveRight; // 0x16d0(0x28)
	struct TSoftClassPtr<UObject> CameraShakeMoveRightAiming; // 0x16f8(0x28)
	struct TSoftClassPtr<UObject> CameraShakeSprint; // 0x1720(0x28)
	struct TSoftClassPtr<UObject> CameraShakeConsternation; // 0x1748(0x28)
	struct TSoftClassPtr<UObject> NutClass; // 0x1770(0x28)
	float NutThrowForce; // 0x1798(0x04)
	char pad_179C[0x4]; // 0x179c(0x04)
	struct FTransform AdditionalNutTransform; // 0x17a0(0x30)
	struct FVector AdditionalNutRotation; // 0x17d0(0x0c)
	bool bIsDead; // 0x17dc(0x01)
	char pad_17DD[0x3]; // 0x17dd(0x03)
	float NormalFOV; // 0x17e0(0x04)
	float SprintFOV; // 0x17e4(0x04)
	float NormalFOVChangeSpeed; // 0x17e8(0x04)
	float OpticsFOVChangeSpeed; // 0x17ec(0x04)
	struct FName CameraBoneName; // 0x17f0(0x08)
	char pad_17F8[0x4]; // 0x17f8(0x04)
	float DissolveLifespanTrigger; // 0x17fc(0x04)
	char pad_1800[0x10]; // 0x1800(0x10)
	bool bIsClimbingLadder; // 0x1810(0x01)
	char pad_1811[0xb7]; // 0x1811(0xb7)
	char m_ChickenStatus; // 0x18c8(0x01)
	char pad_18C9[0xf]; // 0x18c9(0x0f)
	float BaseTurnRate; // 0x18d8(0x04)
	float BaseLookUpRate; // 0x18dc(0x04)
	float MouseSensivityMultiplier; // 0x18e0(0x04)
	char pad_18E4[0x4]; // 0x18e4(0x04)
	struct UDataTable* WeaponDataTable; // 0x18e8(0x08)
	struct FVector IKFloorTraceOffset; // 0x18f0(0x0c)
	float IKFloorTraceLenth; // 0x18fc(0x04)
	bool bIKIsEnabled; // 0x1900(0x01)
	bool bIKIsDebug; // 0x1901(0x01)
	char pad_1902[0x2]; // 0x1902(0x02)
	float IKTraceDistance; // 0x1904(0x04)
	struct FName IKRightFootSocketName; // 0x1908(0x08)
	struct FName IKLeftFootSocketName; // 0x1910(0x08)
	float IKScale; // 0x1918(0x04)
	float PronedEyeHeight; // 0x191c(0x04)
	char bIsProned : 1; // 0x1920(0x01)
	char pad_1920_1 : 7; // 0x1920(0x01)
	char pad_1921[0x3]; // 0x1921(0x03)
	bool bIsQuickItemChange; // 0x1924(0x01)
	char pad_1925[0x7]; // 0x1925(0x07)
	float DissolveInterpSpeed; // 0x192c(0x04)
	char pad_1930[0xd]; // 0x1930(0x0d)
	bool m_bLockCameraRotation; // 0x193d(0x01)
	char pad_193E[0x5a]; // 0x193e(0x5a)
	struct AWTLLadder* CurrentLadder; // 0x1998(0x08)
	char RemoteViewYaw; // 0x19a0(0x01)
	char pad_19A1[0x7]; // 0x19a1(0x07)
	uint64_t StandaloneCharacterID; // 0x19a8(0x08)
	char pad_19B0[0x8]; // 0x19b0(0x08)
	bool bIsMonstersFollowing; // 0x19b8(0x01)
	char pad_19B9[0x3]; // 0x19b9(0x03)
	int32_t MaxNumMonstersFollowing; // 0x19bc(0x04)
	float RadiusMonsterNear; // 0x19c0(0x04)
	char pad_19C4[0xc]; // 0x19c4(0x0c)

	void UpdateEquipmentItemStates(); // Function WTL.WTLCharacter.UpdateEquipmentItemStates // (Final|Native|Private) // @ game+0x17acb60
	void StopEmotion(); // Function WTL.WTLCharacter.StopEmotion // (Final|Native|Public|BlueprintCallable) // @ game+0x17a8410
	void StopCameraShake(struct UMatineeCameraShake* CameraShake); // Function WTL.WTLCharacter.StopCameraShake // (Final|Native|Public|BlueprintCallable) // @ game+0x17a9660
	void StartQTE(struct AActor* QTEInstigator); // Function WTL.WTLCharacter.StartQTE // (Native|Public|BlueprintCallable) // @ game+0x17aa910
	void StartInteractionWithActionGameplayObject(struct AActor* ActionGameplayActor); // Function WTL.WTLCharacter.StartInteractionWithActionGameplayObject // (Final|Native|Public|BlueprintCallable) // @ game+0x17a8690
	void SpawnVehicle(uint64_t ItemId, uint16_t VehicleID); // Function WTL.WTLCharacter.SpawnVehicle // (Final|Native|Private) // @ game+0x17b08b0
	void ShowSteamStoreInterface(); // Function WTL.WTLCharacter.ShowSteamStoreInterface // (Final|Native|Public|BlueprintCallable) // @ game+0x17a8620
	void ShowDeathScreen(); // Function WTL.WTLCharacter.ShowDeathScreen // (Final|Native|Public|BlueprintCallable) // @ game+0xe77850
	void ShowAllMeshesVisibleOnClient(bool bVisible); // Function WTL.WTLCharacter.ShowAllMeshesVisibleOnClient // (Final|Native|Public|BlueprintCallable) // @ game+0x17a8c30
	void SetShowAllMeshes(bool ShowAllMeshes); // Function WTL.WTLCharacter.SetShowAllMeshes // (Final|Native|Private|BlueprintCallable) // @ game+0x17ad470
	void SetDeathFromAnomaly(bool DeathFromAnomaly, bool ShowAllMeshes, bool DeathSimulatePhysics); // Function WTL.WTLCharacter.SetDeathFromAnomaly // (Final|Native|Private|BlueprintCallable) // @ game+0x17ad980
	void SetDeathByTimer(float DelayValue, struct UDamageType* DamageTypeClass, enum class EWTLCharacterEffectType EffectType, struct AController* DeathInstigator, struct AActor* DeathCauser); // Function WTL.WTLCharacter.SetDeathByTimer // (Final|Native|Public|BlueprintCallable) // @ game+0x17a7d90
	void SetCurrentPose(enum class EWTLCharacterPose Value); // Function WTL.WTLCharacter.SetCurrentPose // (Final|Native|Private|BlueprintCallable) // @ game+0x17adb80
	void SetAllMeshesVisible(bool bVisible); // Function WTL.WTLCharacter.SetAllMeshesVisible // (Final|Native|Public|BlueprintCallable) // @ game+0x1773b90
	void Server_UseEquipmentSlot(char SlotNumber); // Function WTL.WTLCharacter.Server_UseEquipmentSlot // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x17ab600
	void Server_Use(struct AActor* Actor); // Function WTL.WTLCharacter.Server_Use // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x17ab490
	void Server_ThrowNut(); // Function WTL.WTLCharacter.Server_ThrowNut // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x17ab700
	void Server_SwitchFireMode(); // Function WTL.WTLCharacter.Server_SwitchFireMode // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17afd50
	void Server_Suicide(); // Function WTL.WTLCharacter.Server_Suicide // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17b1130
	void Server_StopItemPlacement(); // Function WTL.WTLCharacter.Server_StopItemPlacement // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17acd70
	void Server_StopEmotion(); // Function WTL.WTLCharacter.Server_StopEmotion // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x17a8430
	void Server_StartItemPlacement(); // Function WTL.WTLCharacter.Server_StartItemPlacement // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17acdd0
	void Server_SetSprintMode(bool Value); // Function WTL.WTLCharacter.Server_SetSprintMode // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17b1020
	void Server_SetHoldingBreath(bool Value); // Function WTL.WTLCharacter.Server_SetHoldingBreath // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17b0d50
	void Server_SetFlashlightEnabled(bool Value); // Function WTL.WTLCharacter.Server_SetFlashlightEnabled // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x17a7940
	void Server_SetDeathFromAnomaly(bool DeathFromAnomaly, bool ShowAllMeshes, bool DeathSimulatePhysics); // Function WTL.WTLCharacter.Server_SetDeathFromAnomaly // (Final|Native|Private|BlueprintCallable) // @ game+0x17ad750
	void Server_SetCurrentPose(enum class EWTLCharacterPose Value); // Function WTL.WTLCharacter.Server_SetCurrentPose // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17adc80
	void Server_SetAppearanceProcessed(); // Function WTL.WTLCharacter.Server_SetAppearanceProcessed // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17b13a0
	void Server_SetAimMode(bool Value, bool IgnoreHandsState); // Function WTL.WTLCharacter.Server_SetAimMode // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17b0e80
	void Server_SendQTEAction(char ActionID); // Function WTL.WTLCharacter.Server_SendQTEAction // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17b1280
	void Server_SelectSlot(char SlotNumber, bool AllowReselect, bool Force); // Function WTL.WTLCharacter.Server_SelectSlot // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x17b0680
	void Server_RequestStuffPlacement(uint64_t StuffItemID); // Function WTL.WTLCharacter.Server_RequestStuffPlacement // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17ad080
	void Server_RequestSpecialStuffPlacement(uint16_t StuffID); // Function WTL.WTLCharacter.Server_RequestSpecialStuffPlacement // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17acf70
	void Server_RequestActionGameplayActorToUse(struct AActor* ActionGameplayActor); // Function WTL.WTLCharacter.Server_RequestActionGameplayActorToUse // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17ac840
	void Server_RequestActionGameplayActorToStopUse(); // Function WTL.WTLCharacter.Server_RequestActionGameplayActorToStopUse // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17ac7e0
	void Server_QuickThrow(); // Function WTL.WTLCharacter.Server_QuickThrow // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x17ab430
	void Server_QuickMeleeHit(); // Function WTL.WTLCharacter.Server_QuickMeleeHit // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x17ab5a0
	void Server_ProcessBulletFlyNear(struct FVector_NetQuantize Location, enum class EWTLCaliber Caliber); // Function WTL.WTLCharacter.Server_ProcessBulletFlyNear // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x17ab190
	void Server_PlayEmotion(int32_t EmotionTypeID, int32_t EmotionID); // Function WTL.WTLCharacter.Server_PlayEmotion // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x17a8490
	void Server_PlaceStuff(); // Function WTL.WTLCharacter.Server_PlaceStuff // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17acd10
	void Server_OnUse(struct AActor* InteractiveActor); // Function WTL.WTLCharacter.Server_OnUse // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17affb0
	void Server_OnTiltRight(); // Function WTL.WTLCharacter.Server_OnTiltRight // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17afcf0
	void Server_OnTiltLeft(); // Function WTL.WTLCharacter.Server_OnTiltLeft // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17afc90
	void Server_OnStopTilt(); // Function WTL.WTLCharacter.Server_OnStopTilt // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17afc30
	void Server_OnStartUse(); // Function WTL.WTLCharacter.Server_OnStartUse // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17aff50
	void Server_OnFinishUse(struct AActor* InteractiveObject, bool Success); // Function WTL.WTLCharacter.Server_OnFinishUse // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17afdb0
	void Server_NotifyClientCheatState(enum class EWTLCheatType CheatType, struct FString Info); // Function WTL.WTLCharacter.Server_NotifyClientCheatState // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17b1400
	void Server_MainUseStop(int32_t OptionalValue1, int32_t OptionalValue2); // Function WTL.WTLCharacter.Server_MainUseStop // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17b0ac0
	void Server_MainUseStart(struct FVector2D AimOffset); // Function WTL.WTLCharacter.Server_MainUseStart // (Final|Net|NetReliableNative|Event|Private|NetServer|HasDefaults|NetValidate) // @ game+0x17b0c50
	void Server_HideItem(bool Force); // Function WTL.WTLCharacter.Server_HideItem // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17ad270
	void Server_HideDrone(); // Function WTL.WTLCharacter.Server_HideDrone // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17accb0
	void Server_CoreHacking_Process(char InputValue, struct AWTLFortificationCommandCore* CommandCore); // Function WTL.WTLCharacter.Server_CoreHacking_Process // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0x17aa660
	void Server_ClearCurrentSlot(); // Function WTL.WTLCharacter.Server_ClearCurrentSlot // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17b0620
	void Server_CancelStuffPlacementMode(); // Function WTL.WTLCharacter.Server_CancelStuffPlacementMode // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17acf10
	void Server_CancelQTE(); // Function WTL.WTLCharacter.Server_CancelQTE // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17b1220
	void Server_AssignItemToFastAccessSlot(char SlotNumber, enum class EWTLItemType ItemType, uint64_t ItemId); // Function WTL.WTLCharacter.Server_AssignItemToFastAccessSlot // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17b03f0
	void Server_AlternativeUseStop(); // Function WTL.WTLCharacter.Server_AlternativeUseStop // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17b0a00
	void Server_AlternativeUseStart(); // Function WTL.WTLCharacter.Server_AlternativeUseStart // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x17b0a60
	void ResetIdleTimer(); // Function WTL.WTLCharacter.ResetIdleTimer // (Final|Native|Public|BlueprintCallable) // @ game+0x17a6fc0
	void PostDeath(); // Function WTL.WTLCharacter.PostDeath // (Native|Public) // @ game+0x17ac3e0
	void PlayStunhit(enum class EWTLCharacterStunhitDirection StunhitDirection, bool IsHideUsableItem); // Function WTL.WTLCharacter.PlayStunhit // (Final|Native|Public|BlueprintCallable) // @ game+0x17a9280
	void PlaySoundEventAttached(struct UFMODEvent* Sound); // Function WTL.WTLCharacter.PlaySoundEventAttached // (Final|Native|Public|BlueprintCallable) // @ game+0x17a9a50
	void PlaySoundEvent2D(struct UFMODEvent* Sound); // Function WTL.WTLCharacter.PlaySoundEvent2D // (Final|Native|Public|BlueprintCallable) // @ game+0x17a9b30
	void PlayMontage(struct UAnimMontage* MontageToPlay, bool BlockInput); // Function WTL.WTLCharacter.PlayMontage // (Final|Native|Public|BlueprintCallable) // @ game+0x17a9070
	void PlayCameraShake(struct UMatineeCameraShake* CameraShake, float Value, bool IsHideUsableItem, bool RemoveAiming); // Function WTL.WTLCharacter.PlayCameraShake // (Final|Native|Public|BlueprintCallable) // @ game+0x17a97b0
	void OnUnmuteCharacter(); // Function WTL.WTLCharacter.OnUnmuteCharacter // (Final|Native|Private) // @ game+0x17ae260
	void OnTextChatUnmuteCharacter(); // Function WTL.WTLCharacter.OnTextChatUnmuteCharacter // (Final|Native|Private) // @ game+0x17ae0c0
	void OnTextChatMuteCharacter(); // Function WTL.WTLCharacter.OnTextChatMuteCharacter // (Final|Native|Private) // @ game+0x17ae240
	void OnShowInformationAboutCharacter(); // Function WTL.WTLCharacter.OnShowInformationAboutCharacter // (Final|Native|Private) // @ game+0x17ae720
	void OnShortCharacterInfoChanged(); // Function WTL.WTLCharacter.OnShortCharacterInfoChanged // (Final|Native|Private) // @ game+0x17ad190
	void OnSendTextChatMessageToCharacter(); // Function WTL.WTLCharacter.OnSendTextChatMessageToCharacter // (Final|Native|Private) // @ game+0x17ae700
	void OnReportCharacter(); // Function WTL.WTLCharacter.OnReportCharacter // (Final|Native|Private) // @ game+0x17adf60
	void OnRep_UsableItemInHands(); // Function WTL.WTLCharacter.OnRep_UsableItemInHands // (Final|Native|Private) // @ game+0x17afa90
	void OnRep_Stamina(); // Function WTL.WTLCharacter.OnRep_Stamina // (Final|Native|Private) // @ game+0x17af620
	void OnRep_QTEState(); // Function WTL.WTLCharacter.OnRep_QTEState // (Final|Native|Private) // @ game+0x17b1380
	void OnRep_PersonalEnergyShieldState(); // Function WTL.WTLCharacter.OnRep_PersonalEnergyShieldState // (Final|Native|Private) // @ game+0x17b1a70
	void OnRep_Oxygen(); // Function WTL.WTLCharacter.OnRep_Oxygen // (Final|Native|Private) // @ game+0x17af580
	void OnRep_LastTakeHitInfo(); // Function WTL.WTLCharacter.OnRep_LastTakeHitInfo // (Final|Native|Private) // @ game+0x17afa70
	void OnRep_LastEventPoint(); // Function WTL.WTLCharacter.OnRep_LastEventPoint // (Final|Native|Private) // @ game+0x17af420
	void OnRep_IsTraveling(); // Function WTL.WTLCharacter.OnRep_IsTraveling // (Final|Native|Private) // @ game+0x17af960
	void OnRep_IsProned(); // Function WTL.WTLCharacter.OnRep_IsProned // (Native|Public) // @ game+0x17ac6e0
	void OnRep_IsPlacingItem(); // Function WTL.WTLCharacter.OnRep_IsPlacingItem // (Final|Native|Private) // @ game+0x17af440
	void OnRep_IsInvulnerable(); // Function WTL.WTLCharacter.OnRep_IsInvulnerable // (Final|Native|Private) // @ game+0x17afa50
	void OnRep_IsInSafeZone(); // Function WTL.WTLCharacter.OnRep_IsInSafeZone // (Final|Native|Private) // @ game+0x17afa30
	void OnRep_IsInPVPZone(); // Function WTL.WTLCharacter.OnRep_IsInPVPZone // (Final|Native|Private) // @ game+0x17af9c0
	void OnRep_IsInMobileResurectionPointWorkZone(); // Function WTL.WTLCharacter.OnRep_IsInMobileResurectionPointWorkZone // (Final|Native|Private) // @ game+0x17af9c0
	void OnRep_IsInFishingZone(); // Function WTL.WTLCharacter.OnRep_IsInFishingZone // (Final|Native|Private) // @ game+0x17af560
	void OnRep_IsHoldingBreath(); // Function WTL.WTLCharacter.OnRep_IsHoldingBreath // (Final|Native|Private) // @ game+0x17af7e0
	void OnRep_IsClimbingLadder(); // Function WTL.WTLCharacter.OnRep_IsClimbingLadder // (Final|Native|Public) // @ game+0x17ac650
	void OnRep_HandsState(enum class EWTLHandsState PreviousHandsState); // Function WTL.WTLCharacter.OnRep_HandsState // (Final|Native|Private) // @ game+0x17af710
	void OnRep_FlashlightEnabled(); // Function WTL.WTLCharacter.OnRep_FlashlightEnabled // (Final|Native|Private) // @ game+0x17af3e0
	void OnRep_DroneRenderTargetActor(); // Function WTL.WTLCharacter.OnRep_DroneRenderTargetActor // (Final|Native|Private) // @ game+0xe77850
	void OnRep_Drone(); // Function WTL.WTLCharacter.OnRep_Drone // (Final|Native|Private) // @ game+0x17b1ac0
	void OnRep_CurrentRadiationLevel(); // Function WTL.WTLCharacter.OnRep_CurrentRadiationLevel // (Final|Native|Private) // @ game+0x17af400
	void OnRep_CurrentPose(enum class EWTLCharacterPose PrevValue); // Function WTL.WTLCharacter.OnRep_CurrentPose // (Final|Native|Private) // @ game+0x17afab0
	void OnRep_CurrentEmotionKey(); // Function WTL.WTLCharacter.OnRep_CurrentEmotionKey // (Final|Native|Private) // @ game+0x17b15c0
	void OnRep_CurrentActionGameplayActor(struct AActor* PrevActor); // Function WTL.WTLCharacter.OnRep_CurrentActionGameplayActor // (Final|Native|Private) // @ game+0x17b15e0
	void OnRep_bIsSprinting(); // Function WTL.WTLCharacter.OnRep_bIsSprinting // (Final|Native|Private) // @ game+0x17afbf0
	void OnRep_bIsJumping(); // Function WTL.WTLCharacter.OnRep_bIsJumping // (Final|Native|Private) // @ game+0x17afb80
	void OnRep_bIsAiming(); // Function WTL.WTLCharacter.OnRep_bIsAiming // (Final|Native|Private) // @ game+0x17afc10
	void OnPickupPlaceableStuffConfirmed(); // Function WTL.WTLCharacter.OnPickupPlaceableStuffConfirmed // (Final|Native|Private) // @ game+0x17ade60
	void OnPickupPlaceableStuff(); // Function WTL.WTLCharacter.OnPickupPlaceableStuff // (Final|Native|Private) // @ game+0x17adf40
	void OnOfferBarterToCharacter(); // Function WTL.WTLCharacter.OnOfferBarterToCharacter // (Final|Native|Private) // @ game+0x17ae600
	void OnOfferBarter(struct FString Message); // Function WTL.WTLCharacter.OnOfferBarter // (Final|Native|Private) // @ game+0x17ae510
	void OnMuteCharacter(); // Function WTL.WTLCharacter.OnMuteCharacter // (Final|Native|Private) // @ game+0x17ae380
	void OnMontageStarted(struct UAnimMontage* Montage); // Function WTL.WTLCharacter.OnMontageStarted // (Final|Native|Private) // @ game+0x17ae8f0
	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function WTL.WTLCharacter.OnMontageEnded // (Final|Native|Private) // @ game+0x17ae9d0
	void OnInviteCharacterToGroup(); // Function WTL.WTLCharacter.OnInviteCharacterToGroup // (Final|Native|Private) // @ game+0x17ae4f0
	void OnGiveTokensToCharacter(); // Function WTL.WTLCharacter.OnGiveTokensToCharacter // (Final|Native|Private) // @ game+0x17ae620
	void OnCommendCharacter(); // Function WTL.WTLCharacter.OnCommendCharacter // (Final|Native|Private) // @ game+0xe77850
	void OnChargePlaceableStuff(); // Function WTL.WTLCharacter.OnChargePlaceableStuff // (Final|Native|Private) // @ game+0x17add80
	void OnCharacterInfoChanged(); // Function WTL.WTLCharacter.OnCharacterInfoChanged // (Final|Native|Private) // @ game+0x17ad1f0
	void OnCapsuleEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function WTL.WTLCharacter.OnCapsuleEndOverlap // (Final|Native|Public) // @ game+0x17abdc0
	void OnCapsuleBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function WTL.WTLCharacter.OnCapsuleBeginOverlap // (Final|Native|Public|HasOutParms) // @ game+0x17ac030
	void OnBulletFlyNearVolumeBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function WTL.WTLCharacter.OnBulletFlyNearVolumeBeginOverlap // (Final|Native|Private|HasOutParms) // @ game+0x17b16c0
	void NetMulticast_ThrowNut(); // Function WTL.WTLCharacter.NetMulticast_ThrowNut // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x17ab9e0
	void NetMulticast_ShowTeleportationDeviceEffect(); // Function WTL.WTLCharacter.NetMulticast_ShowTeleportationDeviceEffect // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x17ab780
	void NetMulticast_SetBrokenLight(bool Value); // Function WTL.WTLCharacter.NetMulticast_SetBrokenLight // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x17a7a50
	void NetMulticast_PlayPickupAnimation(float Rate); // Function WTL.WTLCharacter.NetMulticast_PlayPickupAnimation // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x17ab910
	void NetMulticast_PlayAnimMontage(struct UAnimMontage* Montage, float Rate); // Function WTL.WTLCharacter.NetMulticast_PlayAnimMontage // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x17ab7a0
	void NetMulticast_OnTeleportedWithDevice(); // Function WTL.WTLCharacter.NetMulticast_OnTeleportedWithDevice // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x17ab760
	void NetMulticast_OnStuffEquipmentStateChanged(uint64_t CharacterID, uint16_t StuffID, bool State); // Function WTL.WTLCharacter.NetMulticast_OnStuffEquipmentStateChanged // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x17ac950
	void LevelLoadedAtStart(); // Function WTL.WTLCharacter.LevelLoadedAtStart // (Final|Native|Private) // @ game+0x17b11f0
	void Kill(struct AController* Killer, struct AActor* DamageCauser, struct UDamageType* DamageTypeClass, enum class EWTLCharacterEffectType EffectType); // Function WTL.WTLCharacter.Kill // (Final|Native|Public|BlueprintCallable) // @ game+0x17ac400
	void K2_ShowTeleportationDeviceEffect(); // Function WTL.WTLCharacter.K2_ShowTeleportationDeviceEffect // (Event|Protected|BlueprintEvent) // @ game+0x1ad0090
	void K2_ShowExplosionEffectsAfterDeath(); // Function WTL.WTLCharacter.K2_ShowExplosionEffectsAfterDeath // (Event|Protected|BlueprintEvent) // @ game+0x1ad0090
	void K2_ShowEffectsAfterDeath(); // Function WTL.WTLCharacter.K2_ShowEffectsAfterDeath // (Event|Protected|BlueprintEvent) // @ game+0x1ad0090
	void K2_SetMovementEnabled(bool Value); // Function WTL.WTLCharacter.K2_SetMovementEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x17a72a0
	void K2_OnStartProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function WTL.WTLCharacter.K2_OnStartProne // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void K2_OnEndProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function WTL.WTLCharacter.K2_OnEndProne // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void K2_OnEffectRemoved(enum class EWTLCharacterEffectType EffectType); // Function WTL.WTLCharacter.K2_OnEffectRemoved // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void K2_OnEffectAdded(enum class EWTLCharacterEffectType EffectType); // Function WTL.WTLCharacter.K2_OnEffectAdded // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void K2_OnDeath(); // Function WTL.WTLCharacter.K2_OnDeath // (Event|Protected|BlueprintEvent) // @ game+0x1ad0090
	void K2_LockCameraRotation(bool Value); // Function WTL.WTLCharacter.K2_LockCameraRotation // (Final|Native|Public|BlueprintCallable) // @ game+0x17a71c0
	struct FGenericTeamId K2_GetGenericTeamID(); // Function WTL.WTLCharacter.K2_GetGenericTeamID // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aa550
	enum class EWTLCharacterClass K2_GetCharacterClass(); // Function WTL.WTLCharacter.K2_GetCharacterClass // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aa2c0
	bool K2_CanBeSeenFrom(struct FVector& ObserverLocation, struct FVector& OutSeenLocation, int32_t& NumberOfLoSChecksPerformed, float& OutSightStrength, struct AActor* IgnoreActor); // Function WTL.WTLCharacter.K2_CanBeSeenFrom // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x17a8070
	bool IsReadyToSpawnVehicle(); // Function WTL.WTLCharacter.IsReadyToSpawnVehicle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17a74d0
	bool IsPVPEnabled(); // Function WTL.WTLCharacter.IsPVPEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aa0f0
	bool IsPlayingEmotion(); // Function WTL.WTLCharacter.IsPlayingEmotion // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17a83e0
	bool IsInSafeZone(); // Function WTL.WTLCharacter.IsInSafeZone // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aa1c0
	bool IsInPVPZone(); // Function WTL.WTLCharacter.IsInPVPZone // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aa120
	bool IsInMobileResurectionPointWorkZone(); // Function WTL.WTLCharacter.IsInMobileResurectionPointWorkZone // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aa180
	bool IsInFortificationScoreZone(); // Function WTL.WTLCharacter.IsInFortificationScoreZone // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aa160
	bool IsInFishingZone(); // Function WTL.WTLCharacter.IsInFishingZone // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17a7d70
	bool IsInExactSafeZone(struct AWTLSafeZone* SafeZone); // Function WTL.WTLCharacter.IsInExactSafeZone // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17a9ff0
	bool IsInAir(); // Function WTL.WTLCharacter.IsInAir // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17a7120
	void IncrementMonstersNear(int32_t Value); // Function WTL.WTLCharacter.IncrementMonstersNear // (Final|Native|Public|BlueprintCallable) // @ game+0x17a7790
	void IncrementMonstersFollowing(int32_t Value); // Function WTL.WTLCharacter.IncrementMonstersFollowing // (Final|Native|Public|BlueprintCallable) // @ game+0x17a7860
	void HideAllMeshes(); // Function WTL.WTLCharacter.HideAllMeshes // (Final|Native|Private|BlueprintCallable) // @ game+0x17ad380
	void GetSkeletalMeshComponentsByRef(struct TArray<struct USkeletalMeshComponent*>& Meshes); // Function WTL.WTLCharacter.GetSkeletalMeshComponentsByRef // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x17a7b30
	struct TArray<struct USkeletalMeshComponent*> GetSkeletalMeshComponents(); // Function WTL.WTLCharacter.GetSkeletalMeshComponents // (Final|Native|Public|BlueprintCallable) // @ game+0x17a7cb0
	float GetPercentHealth(); // Function WTL.WTLCharacter.GetPercentHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aa4a0
	struct AWTLEventPoint* GetLastEventPoint(); // Function WTL.WTLCharacter.GetLastEventPoint // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17a8770
	bool GetIsInQTE(); // Function WTL.WTLCharacter.GetIsInQTE // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17a9e40
	struct AWTLHUD* GetHUD(); // Function WTL.WTLCharacter.GetHUD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aa4d0
	bool GetDeathFromAnomaly(); // Function WTL.WTLCharacter.GetDeathFromAnomaly // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17a71a0
	enum class EWTLCharacterPose GetCurrentPose(); // Function WTL.WTLCharacter.GetCurrentPose // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aa500
	struct AActor* GetCurrentActionGameplayObject(); // Function WTL.WTLCharacter.GetCurrentActionGameplayObject // (Final|Native|Public|BlueprintCallable) // @ game+0x17a8660
	char GetComplexion(); // Function WTL.WTLCharacter.GetComplexion // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17abd50
	float GetChickenStatusAlpha(); // Function WTL.WTLCharacter.GetChickenStatusAlpha // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17a70c0
	char GetChickenStatus(); // Function WTL.WTLCharacter.GetChickenStatus // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17a7100
	struct FString GetCharacterRankName(); // Function WTL.WTLCharacter.GetCharacterRankName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aab50
	char GetCharacterRank(); // Function WTL.WTLCharacter.GetCharacterRank // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aabd0
	char GetCharacterLevel(); // Function WTL.WTLCharacter.GetCharacterLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aac00
	enum class EWTLAITeam GetAITeam(); // Function WTL.WTLCharacter.GetAITeam // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aa520
	void FinishInteractionWithActionGameplayObject(); // Function WTL.WTLCharacter.FinishInteractionWithActionGameplayObject // (Final|Native|Public|BlueprintCallable) // @ game+0x17a8640
	void FailQTE(); // Function WTL.WTLCharacter.FailQTE // (Final|Native|Public|BlueprintCallable) // @ game+0x17aa7f0
	void DecrementMonstersNear(int32_t Value); // Function WTL.WTLCharacter.DecrementMonstersNear // (Final|Native|Public|BlueprintCallable) // @ game+0x17a75a0
	void DecrementMonstersFollowing(int32_t Value); // Function WTL.WTLCharacter.DecrementMonstersFollowing // (Final|Native|Public|BlueprintCallable) // @ game+0x17a7690
	void Client_WrongPlacementSpotMessage(struct FText Message); // Function WTL.WTLCharacter.Client_WrongPlacementSpotMessage // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x17acb80
	void Client_UpdateEquipmentItemStates(); // Function WTL.WTLCharacter.Client_UpdateEquipmentItemStates // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x17acb40
	void Client_ShowWarningText(struct FText WarningText, bool IsPlaySound); // Function WTL.WTLCharacter.Client_ShowWarningText // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x17aba00
	void Client_ShowWarning(enum class EWTLWarningTitleWidgetType WarningTitleWidgetType, bool IsPlaySound); // Function WTL.WTLCharacter.Client_ShowWarning // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x17abbd0
	void Client_ShowTeleportationDeviceWindowWidget(uint64_t TeleportationDeviceItemID); // Function WTL.WTLCharacter.Client_ShowTeleportationDeviceWindowWidget // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x17ac700
	void Client_ShowSteamStoreInterface(); // Function WTL.WTLCharacter.Client_ShowSteamStoreInterface // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x17abd30
	void Client_ShowContentInventory(struct AActor* Actor); // Function WTL.WTLCharacter.Client_ShowContentInventory // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x17ab350
	void Client_ShowActionTimerWidget(float Timeout, enum class EWTLActionTimerWidgetType Type, enum class EWTLCountdownSliderWidgetFillingType FillingType); // Function WTL.WTLCharacter.Client_ShowActionTimerWidget // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x17aefb0
	void Client_SetDeathFromAnomaly(bool DeathFromAnomaly, bool ShowAllMeshes, bool DeathSimulatePhysics); // Function WTL.WTLCharacter.Client_SetDeathFromAnomaly // (Final|Net|Native|Event|Private|NetClient) // @ game+0x17ad550
	void Client_SetAllMeshesVisible(bool bVisible); // Function WTL.WTLCharacter.Client_SetAllMeshesVisible // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x17a8d50
	void Client_SetAdminGodMode(bool Value); // Function WTL.WTLCharacter.Client_SetAdminGodMode // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x17a9d60
	void Client_SetAdminDropMode(bool Value); // Function WTL.WTLCharacter.Client_SetAdminDropMode // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x17a9c80
	void Client_SelectSlot(char SlotNumber, bool AllowReselect, bool Force); // Function WTL.WTLCharacter.Client_SelectSlot // (Final|Net|NetReliableNative|Event|Private|NetClient|NetValidate) // @ game+0x17b01c0
	void Client_ResetCurrentInteractiveObjetHighlight(); // Function WTL.WTLCharacter.Client_ResetCurrentInteractiveObjetHighlight // (Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // @ game+0x17a8c10
	void Client_ResetAimMode(); // Function WTL.WTLCharacter.Client_ResetAimMode // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x17b0e60
	void Client_RadiationDetectorSignal(float Power); // Function WTL.WTLCharacter.Client_RadiationDetectorSignal // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x17a8a70
	void Client_OnUsePortalError(); // Function WTL.WTLCharacter.Client_OnUsePortalError // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x17aaf20
	void Client_OnUsePortal(); // Function WTL.WTLCharacter.Client_OnUsePortal // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x17aaf40
	void Client_OnStuffPlacementMode(uint16_t StuffID); // Function WTL.WTLCharacter.Client_OnStuffPlacementMode // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x17ace30
	void Client_OnPostSelectSlot(char SlotNumber); // Function WTL.WTLCharacter.Client_OnPostSelectSlot // (Final|Net|NetReliableNative|Event|Private|NetClient|NetValidate) // @ game+0x17b00c0
	void Client_OnPosses(uint64_t PossesedCharacterID); // Function WTL.WTLCharacter.Client_OnPosses // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x17af300
	void Client_OnPlaceableStuffUsed(struct AActor* Actor); // Function WTL.WTLCharacter.Client_OnPlaceableStuffUsed // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x17ae7f0
	void Client_OnMedicineApplied(uint16_t MedicineID); // Function WTL.WTLCharacter.Client_OnMedicineApplied // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x17a8990
	void Client_OnItemUnequipped(); // Function WTL.WTLCharacter.Client_OnItemUnequipped // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x17ad210
	void Client_OnItemEquipped(); // Function WTL.WTLCharacter.Client_OnItemEquipped // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x17ad230
	void Client_OnHideItem(); // Function WTL.WTLCharacter.Client_OnHideItem // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x17ad250
	void Client_OnEventZoneLeave(struct AWTLEventPoint* EventPoint); // Function WTL.WTLCharacter.Client_OnEventZoneLeave // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x17aec90
	void Client_OnEventZoneFinished(struct AWTLEventPoint* EventPoint, bool Successful); // Function WTL.WTLCharacter.Client_OnEventZoneFinished // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x17aeb30
	void Client_OnEventZoneEnter(struct AWTLEventPoint* EventPoint, bool ShowInformer); // Function WTL.WTLCharacter.Client_OnEventZoneEnter // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x17aed70
	void Client_OnEquipmentItemStateChanged(uint16_t StuffID, bool bIsEnabled); // Function WTL.WTLCharacter.Client_OnEquipmentItemStateChanged // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x17aa9f0
	void Client_OnEffectRemoved(enum class EWTLCharacterEffectType EffectType); // Function WTL.WTLCharacter.Client_OnEffectRemoved // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x17aac30
	void Client_OnEffectAdded(enum class EWTLCharacterEffectType EffectType); // Function WTL.WTLCharacter.Client_OnEffectAdded // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x17aad00
	void Client_OnCharacterUsed(); // Function WTL.WTLCharacter.Client_OnCharacterUsed // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x17ae8d0
	void Client_OnBulletFlyNear(struct FVector_NetQuantize Position, enum class EWTLCaliber Caliber); // Function WTL.WTLCharacter.Client_OnBulletFlyNear // (Final|Net|Native|Event|Private|NetClient) // @ game+0x17af190
	void Client_NDPDetectorSignal(float Power); // Function WTL.WTLCharacter.Client_NDPDetectorSignal // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x17a8b40
	void Client_LockInputUnequipUsableItemAndUse(); // Function WTL.WTLCharacter.Client_LockInputUnequipUsableItemAndUse // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x17a9e60
	void Client_HideActionTimerWidget(bool Success); // Function WTL.WTLCharacter.Client_HideActionTimerWidget // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x17aeed0
	void Client_EffectCameraManager(float AddVingette, float AddFringe, bool IsHideUsableItem, bool RemoveAiming); // Function WTL.WTLCharacter.Client_EffectCameraManager // (Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // @ game+0x17a93d0
	void Client_CoreHacking_Result(char Result); // Function WTL.WTLCharacter.Client_CoreHacking_Result // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x17aa590
	void Client_ClearChat(); // Function WTL.WTLCharacter.Client_ClearChat // (Net|Native|Event|Public|NetClient) // @ game+0x17a6fe0
	void Client_ApplyHearingDamage(float Duration, float Falloff); // Function WTL.WTLCharacter.Client_ApplyHearingDamage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x17a9e80
	void Client_AddMarkers(struct TArray<struct FWTLMarkerMemoryElement> Markers); // Function WTL.WTLCharacter.Client_AddMarkers // (Net|Native|Event|Public|NetClient) // @ game+0x17a7380
	void CleanMotionVector(); // Function WTL.WTLCharacter.CleanMotionVector // (Final|Native|Public|BlueprintCallable) // @ game+0x17a8790
	void ChickenStatusDelta(int32_t Delta); // Function WTL.WTLCharacter.ChickenStatusDelta // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x17a7000
	bool CharacterStunned(); // Function WTL.WTLCharacter.CharacterStunned // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17a74f0
	bool CanSpawnOnSafeZone(); // Function WTL.WTLCharacter.CanSpawnOnSafeZone // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aa1a0
	void CancelQTE(bool bIsFromClientside); // Function WTL.WTLCharacter.CancelQTE // (Final|Native|Public|BlueprintCallable) // @ game+0x17aa810
	void Broadcast_SetAllMeshesVisible(bool bVisible); // Function WTL.WTLCharacter.Broadcast_SetAllMeshesVisible // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x17a8e30
	void Broadcast_PlayMontage(struct UAnimMontage* MontageToPlay, bool BlockInput); // Function WTL.WTLCharacter.Broadcast_PlayMontage // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x17a8f10
	void Broadcast_OnStunhit(enum class EWTLCharacterStunhitDirection StunhitDirection); // Function WTL.WTLCharacter.Broadcast_OnStunhit // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x17a91b0
	bool BPHavePremium(); // Function WTL.WTLCharacter.BPHavePremium // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aa1e0
	struct FString BPGetCharacterName(); // Function WTL.WTLCharacter.BPGetCharacterName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aa330
	int64_t BPGetCharacterID(); // Function WTL.WTLCharacter.BPGetCharacterID // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aa420
	bool AvailableNear(); // Function WTL.WTLCharacter.AvailableNear // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17a7520
	bool AvailableForPursuit(); // Function WTL.WTLCharacter.AvailableForPursuit // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17a7560
	void ApplyHearingDamage(float Duration, float Falloff); // Function WTL.WTLCharacter.ApplyHearingDamage // (Final|Native|Public|BlueprintCallable) // @ game+0x17a9e80
	void ApplyEffectToCharacter(enum class EWTLCharacterEffectType EffectType, float Value); // Function WTL.WTLCharacter.ApplyEffectToCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x17aadd0
	void AllLevelsLoadedAtStart(); // Function WTL.WTLCharacter.AllLevelsLoadedAtStart // (Final|Native|Private) // @ game+0x17b1190
	bool AIInterface_IsInSafeZone(); // Function WTL.WTLCharacter.AIInterface_IsInSafeZone // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17ab040
	bool AIInterface_IsCanBeAttacked(enum class EWTLFaction InstigatorFaction); // Function WTL.WTLCharacter.AIInterface_IsCanBeAttacked // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17aaf60
	bool AIInterface_IsAlive(); // Function WTL.WTLCharacter.AIInterface_IsAlive // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17ab150
	struct FVector AIInterface_GetVelocity(); // Function WTL.WTLCharacter.AIInterface_GetVelocity // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x17ab0c0
	int32_t AIInterface_GetGroupID(); // Function WTL.WTLCharacter.AIInterface_GetGroupID // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17ab110
	enum class EWTLFaction AIInterface_GetFaction(); // Function WTL.WTLCharacter.AIInterface_GetFaction // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17ab080
};

// Class WTL.WTLAnimationMetaData
// Size: 0x30 (Inherited: 0x28)
struct UWTLAnimationMetaData : UAnimMetaData {
	bool bShouldReplaceAnimInstance; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float RagdollBlendWeight; // 0x2c(0x04)
};

// Class WTL.WTLRootMotionAnimationMetaData
// Size: 0x30 (Inherited: 0x28)
struct UWTLRootMotionAnimationMetaData : UAnimMetaData {
	enum class EWTLRootMotionControlLockingType RootMotionControllerLockingType; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// Class WTL.WTLCameraLimitsAnimationMetaData
// Size: 0x38 (Inherited: 0x28)
struct UWTLCameraLimitsAnimationMetaData : UAnimMetaData {
	float YawLimit; // 0x28(0x04)
	float MinPitchLimit; // 0x2c(0x04)
	float MaxPitchLimit; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class WTL.WTLCameraStyleAnimationMetaData
// Size: 0x38 (Inherited: 0x28)
struct UWTLCameraStyleAnimationMetaData : UAnimMetaData {
	struct FName CameraStyle; // 0x28(0x08)
	float FreeCameraDistance; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class WTL.WTLPawnRotationLockingAnimationMetaData
// Size: 0x30 (Inherited: 0x28)
struct UWTLPawnRotationLockingAnimationMetaData : UAnimMetaData {
	bool bOverrideUseControllerPitch; // 0x28(0x01)
	bool bNewUseControllerPitchValue; // 0x29(0x01)
	bool bOverrideUseControllerYaw; // 0x2a(0x01)
	bool bNewUseControllerYawValue; // 0x2b(0x01)
	bool bOverrideUseControllerRoll; // 0x2c(0x01)
	bool bNewUseControllerRollValue; // 0x2d(0x01)
	char pad_2E[0x2]; // 0x2e(0x02)
};

// Class WTL.WTLSpecialStatesAnimationMetaData
// Size: 0x30 (Inherited: 0x28)
struct UWTLSpecialStatesAnimationMetaData : UAnimMetaData {
	bool bOverrideCrouchState; // 0x28(0x01)
	bool bNewCrouchState; // 0x29(0x01)
	bool bLockMovement; // 0x2a(0x01)
	bool BlockCameraRotation; // 0x2b(0x01)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class WTL.WTLPawnCapsuleCollisionRemover
// Size: 0x28 (Inherited: 0x28)
struct UWTLPawnCapsuleCollisionRemover : UAnimMetaData {
};

// Class WTL.WTLPawnInVehicleMetaData
// Size: 0x30 (Inherited: 0x28)
struct UWTLPawnInVehicleMetaData : UAnimMetaData {
	bool bShowCharacterMesh; // 0x28(0x01)
	bool bHideMeshIfMontageEnded; // 0x29(0x01)
	char pad_2A[0x6]; // 0x2a(0x06)
};

// Class WTL.WTLResetLowerBodyRotationAnimationMetaData
// Size: 0x28 (Inherited: 0x28)
struct UWTLResetLowerBodyRotationAnimationMetaData : UAnimMetaData {
};

// Class WTL.WTLCharacterBodyAnimInstance
// Size: 0xfa0 (Inherited: 0x2c0)
struct UWTLCharacterBodyAnimInstance : UAnimInstance {
	char pad_2C0[0x40]; // 0x2c0(0x40)
	struct FWTLCharacterAnimInstanceProxy CharacterProxy; // 0x300(0x770)
	struct TMap<uint16_t, uint16_t> WeaponItemRemap; // 0xa70(0x50)
	struct TMap<uint16_t, uint16_t> StuffItemRemap; // 0xac0(0x50)
	bool IsFirstPerson; // 0xb10(0x01)
	enum class EWTLSex CharacterSex; // 0xb11(0x01)
	char pad_B12[0x2]; // 0xb12(0x02)
	struct FVector LookDirection; // 0xb14(0x0c)
	float CameraAimOffset; // 0xb20(0x04)
	float CameraAimOffsetInterpSpeedMultiplier; // 0xb24(0x04)
	float MoveDirection; // 0xb28(0x04)
	float SnuggleValue; // 0xb2c(0x04)
	float MovementSpeed; // 0xb30(0x04)
	float VelocityZ; // 0xb34(0x04)
	float BodyTilt; // 0xb38(0x04)
	bool bIsInAir; // 0xb3c(0x01)
	bool bIsUnderWater; // 0xb3d(0x01)
	bool bIsInWater; // 0xb3e(0x01)
	bool bMovesOnWater; // 0xb3f(0x01)
	bool bIsAiming; // 0xb40(0x01)
	bool bIsCrouch; // 0xb41(0x01)
	bool bIsProne; // 0xb42(0x01)
	bool bIsJumping; // 0xb43(0x01)
	bool bIsSprinting; // 0xb44(0x01)
	bool bIsLadderClimbing; // 0xb45(0x01)
	char pad_B46[0x2]; // 0xb46(0x02)
	struct FVector InputVector; // 0xb48(0x0c)
	float MoveSpeedValue; // 0xb54(0x04)
	float MoveTurnValue; // 0xb58(0x04)
	enum class EWTLCharacterMoveState MovementState; // 0xb5c(0x01)
	char pad_B5D[0x3]; // 0xb5d(0x03)
	float HoldingBreath; // 0xb60(0x04)
	float StaminaValue; // 0xb64(0x04)
	float TirednessValue; // 0xb68(0x04)
	float TirednessValueMultiplier; // 0xb6c(0x04)
	struct UCurveVector* AnimationCurve; // 0xb70(0x08)
	struct FRotator CurrentWeaponRotation; // 0xb78(0x0c)
	enum class EWTLHandsState HandsState; // 0xb84(0x01)
	char pad_B85[0x3]; // 0xb85(0x03)
	float ItemEquipTime; // 0xb88(0x04)
	float ItemUnequipTime; // 0xb8c(0x04)
	float LeftHandThumbInputUp; // 0xb90(0x04)
	float LeftHandThumbInputRight; // 0xb94(0x04)
	bool CanUseHandsLocomotion; // 0xb98(0x01)
	char pad_B99[0x3]; // 0xb99(0x03)
	struct FName IKRightFootAlphaCurveName; // 0xb9c(0x08)
	struct FName IKLeftFootAlphaCurveName; // 0xba4(0x08)
	struct FName IKRightKneeSocketName; // 0xbac(0x08)
	struct FName IKLeftKneeSocketName; // 0xbb4(0x08)
	float IKHipInterpSpeed; // 0xbbc(0x04)
	float IKEffectorPositionInterpSpeed; // 0xbc0(0x04)
	float IKAlphaInterpSpeed; // 0xbc4(0x04)
	float IKFootNormalInterpSpeed; // 0xbc8(0x04)
	float IKHipOffset; // 0xbcc(0x04)
	char pad_BD0[0x4]; // 0xbd0(0x04)
	float IKFloorTraceValue; // 0xbd4(0x04)
	struct FVector IKHipTarget; // 0xbd8(0x0c)
	struct FVector IKRightFootEffectorPosition; // 0xbe4(0x0c)
	char pad_BF0[0xc]; // 0xbf0(0x0c)
	struct FVector IKLeftFootEffectorPosition; // 0xbfc(0x0c)
	char pad_C08[0xc]; // 0xc08(0x0c)
	struct FVector IKRightKneePosition; // 0xc14(0x0c)
	struct FVector IKLeftKneePosition; // 0xc20(0x0c)
	struct FVector IKRightFootNormal; // 0xc2c(0x0c)
	char pad_C38[0xc]; // 0xc38(0x0c)
	struct FVector IKLeftFootNormal; // 0xc44(0x0c)
	char pad_C50[0xc]; // 0xc50(0x0c)
	bool bIKRightFootHit; // 0xc5c(0x01)
	bool bIKLeftFootHit; // 0xc5d(0x01)
	char pad_C5E[0x2]; // 0xc5e(0x02)
	float IKRightFootAlpha; // 0xc60(0x04)
	float IKLeftFootAlpha; // 0xc64(0x04)
	struct FName IKHandsOffsetBoneName; // 0xc68(0x08)
	struct FTransform IKHandsOffsetBoneTransform; // 0xc70(0x30)
	int32_t UsableItemID; // 0xca0(0x04)
	int32_t LastUsableItemID; // 0xca4(0x04)
	enum class EWTLItemType UsableItemType; // 0xca8(0x01)
	char pad_CA9[0x7]; // 0xca9(0x07)
	struct TArray<float> UsableItemAnimationFloatParameters; // 0xcb0(0x10)
	struct TArray<struct FVector> UsableItemAnimationVectorParameters; // 0xcc0(0x10)
	struct FVector HandsOffset; // 0xcd0(0x0c)
	enum class EWTLWeaponType CurrentWeaponType; // 0xcdc(0x01)
	char pad_CDD[0x3]; // 0xcdd(0x03)
	float RotationSpeedVertical; // 0xce0(0x04)
	struct FVector RecoilTranslation; // 0xce4(0x0c)
	struct FRotator RecoilRotation; // 0xcf0(0x0c)
	char pad_CFC[0x4]; // 0xcfc(0x04)
	struct UAnimSequence* IdleAnimation; // 0xd00(0x08)
	struct UAnimSequence* SnuggleAnimation; // 0xd08(0x08)
	struct UAimOffsetBlendSpace1D* AimOffsetBlendSpace; // 0xd10(0x08)
	struct FVector AimingHandsTranslation; // 0xd18(0x0c)
	struct FVector AimingHandsOffset; // 0xd24(0x0c)
	struct FVector MissileSocketOffset; // 0xd30(0x0c)
	struct FVector ThumbLOffset; // 0xd3c(0x0c)
	struct FVector ThumbROffset; // 0xd48(0x0c)
	float FirstSwingingAnimAlphaScaleParameter; // 0xd54(0x04)
	float SecondSwingingAnimAlphaScaleParameter; // 0xd58(0x04)
	float ThirdPersonSwingingAnimAlphaParameter; // 0xd5c(0x04)
	float FirstPersonSwingingAnimAlphaParameter; // 0xd60(0x04)
	float CombatBreathAnimPlayRateScaleParameter; // 0xd64(0x04)
	float CombatBreathAnimPlayRateMaxValueParameter; // 0xd68(0x04)
	float CombatBreathAnimPlayRateMinValueParameter; // 0xd6c(0x04)
	float ThirdPersonCombatBreathAnimAimingAlphaMaxValueParameter; // 0xd70(0x04)
	float ThirdPersonCombatBreathAnimAimingAlphaMinValueParameter; // 0xd74(0x04)
	float FirstPersonCombatBreathAnimAlphaParameter; // 0xd78(0x04)
	float ThirdPersonWeaponRotationAnimAlphaParameter; // 0xd7c(0x04)
	float FirstPersonWeaponRotationAnimStaminaAlphaMinValueParameter; // 0xd80(0x04)
	float FirstPersonWeaponRotationAnimStaminaAlphaMaxValueParameter; // 0xd84(0x04)
	float FirstPersonWeaponRotationAnimAimingAlphaMinValueParameter; // 0xd88(0x04)
	float FirstPersonWeaponRotationAnimAimingAlphaMaxValueParameter; // 0xd8c(0x04)
	float WeaponRotationLocomotionAimingAlphaMinValueParameter; // 0xd90(0x04)
	float WeaponRotationLocomotionAimingAlphaMaxValueParameter; // 0xd94(0x04)
	float WeaponRotationLocomotionHoldingBreathAlphaMinValueParameter; // 0xd98(0x04)
	float WeaponRotationLocomotionHoldingBreathAlphaMaxValueParameter; // 0xd9c(0x04)
	struct FName RightPocketLocationSocketName; // 0xda0(0x08)
	struct FName LeftPocketLocationSocketName; // 0xda8(0x08)
	struct FName LeftJointTargetSocketName; // 0xdb0(0x08)
	struct FName RightJointTargetSocketName; // 0xdb8(0x08)
	float AimingRecoilAlphaMinValueParameter; // 0xdc0(0x04)
	float AimingRecoilAlphaMaxValueParameter; // 0xdc4(0x04)
	float ThirdPersonStaminaValueAnimPlayRateMinValueParameter; // 0xdc8(0x04)
	float ThirdPersonStaminaValueAnimPlayRateMaxValueParameter; // 0xdcc(0x04)
	float WeaponRotationAimOffsetVelocityMinValueParameter; // 0xdd0(0x04)
	float WeaponRotationAimOffsetVelocityMaxValueParameter; // 0xdd4(0x04)
	float StaminaInterpolationSpeed; // 0xdd8(0x04)
	float NonSprintingSpeedTreshold; // 0xddc(0x04)
	struct FVector FloorNormal; // 0xde0(0x0c)
	float DotPCapsule; // 0xdec(0x04)
	float DotPRightFoot; // 0xdf0(0x04)
	float DotPLeftFoot; // 0xdf4(0x04)
	float ForwardVelocity; // 0xdf8(0x04)
	float SideVelocity; // 0xdfc(0x04)
	float LowerBodyRelativeAngle; // 0xe00(0x04)
	float LowerBodyFixedRelativeAngle; // 0xe04(0x04)
	enum class EWTLCharacterAnimationInstanceMovementState LocomotionState; // 0xe08(0x01)
	char pad_E09[0x3]; // 0xe09(0x03)
	float RotationSpeedHorizontalWithDirection; // 0xe0c(0x04)
	float OneMinusIsNoMovementCurveValue; // 0xe10(0x04)
	float OneMinusEmptyHandsCurveValue; // 0xe14(0x04)
	float AimingRecoilAlpha; // 0xe18(0x04)
	float ThirdPersonStaminaValueAnimPlayRate; // 0xe1c(0x04)
	float IsNotFirstPersonAlpha; // 0xe20(0x04)
	float WeaponRotationAimOffsetForwardVelocity; // 0xe24(0x04)
	float WeaponRotationAimOffsetSideVelocity; // 0xe28(0x04)
	float CombatBreathAnimPlayRate; // 0xe2c(0x04)
	float CombatBreathAnimAlpha; // 0xe30(0x04)
	float WeaponRotationAnimAlpha; // 0xe34(0x04)
	float WeaponRotationLocomotionAlpha; // 0xe38(0x04)
	struct FRotator AimOffsetBoneRotation; // 0xe3c(0x0c)
	float AimingAlphaCurveValue; // 0xe48(0x04)
	bool bIsInCombatMode; // 0xe4c(0x01)
	char pad_E4D[0x3]; // 0xe4d(0x03)
	float FirstSwingAnimAlpha; // 0xe50(0x04)
	float SecondSwingAnimAlpha; // 0xe54(0x04)
	float AimOffsetBoneRotationAlpha; // 0xe58(0x04)
	struct FVector HandsTranslationOffset; // 0xe5c(0x0c)
	float OneMinusAimingAlphaCurveValue; // 0xe68(0x04)
	struct FVector AimingHandsTranslationOffset; // 0xe6c(0x0c)
	struct FVector HandsAimOffsetDownTranslationOffset; // 0xe78(0x0c)
	float HandsAimOffsetDownAlpha; // 0xe84(0x04)
	struct FVector RightPocketLocation; // 0xe88(0x0c)
	struct FVector LeftPocketLocation; // 0xe94(0x0c)
	struct FVector LeftJointTargetLocation; // 0xea0(0x0c)
	struct FVector RightJointTargetLocation; // 0xeac(0x0c)
	float RightHandAlphaCurveValue; // 0xeb8(0x04)
	float LeftHandAlphaCurveValue; // 0xebc(0x04)
	struct FRotator LowerBodyRotation; // 0xec0(0x0c)
	struct FRotator IKFootRootBoneRotation; // 0xecc(0x0c)
	struct FVector PelvisOffset; // 0xed8(0x0c)
	struct FRotator RightFootRotation; // 0xee4(0x0c)
	struct FRotator LeftFootRotation; // 0xef0(0x0c)
	float LadderLoopAnimPlayRate; // 0xefc(0x04)
	bool IsLadderNoMovement; // 0xf00(0x01)
	char pad_F01[0x3]; // 0xf01(0x03)
	struct FVector ScaleRibCageVector; // 0xf04(0x0c)
	struct FVector InvertScaleRibCageVector; // 0xf10(0x0c)
	struct FVector ScaleNeckVector; // 0xf1c(0x0c)
	struct FVector ScaleHeadVector; // 0xf28(0x0c)
	struct FVector ScaleHandsVector; // 0xf34(0x0c)
	struct FVector InvertScaleHandsVector; // 0xf40(0x0c)
	struct FVector ScaleFeetVector; // 0xf4c(0x0c)
	struct FVector InvertScaleFeetVector; // 0xf58(0x0c)
	bool bIsUnequip; // 0xf64(0x01)
	char pad_F65[0x3]; // 0xf65(0x03)
	float FIsUnequip; // 0xf68(0x04)
	float FScaleNeck; // 0xf6c(0x04)
	float FScaleHead; // 0xf70(0x04)
	float FScaleRibCage; // 0xf74(0x04)
	float FScaleBody; // 0xf78(0x04)
	float FScaleHands; // 0xf7c(0x04)
	float FScaleFeet; // 0xf80(0x04)
	float FTiltXWithFishingRod; // 0xf84(0x04)
	float FTiltYWithFishingRod; // 0xf88(0x04)
	float FRodResistanceValue; // 0xf8c(0x04)
	bool InFishingMode; // 0xf90(0x01)
	bool NowIsFishing; // 0xf91(0x01)
	bool ShowCathedFish; // 0xf92(0x01)
	char pad_F93[0x1]; // 0xf93(0x01)
	int32_t Complexion; // 0xf94(0x04)
	char pad_F98[0x8]; // 0xf98(0x08)

	void UpdateComplexity(); // Function WTL.WTLCharacterBodyAnimInstance.UpdateComplexity // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x17b8d20
	bool K2_MortarLoadingInProccess(); // Function WTL.WTLCharacterBodyAnimInstance.K2_MortarLoadingInProccess // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17b8680
	struct FVector K2_GetMortarSocketLocationInComponentSpace(struct FName Socket); // Function WTL.WTLCharacterBodyAnimInstance.K2_GetMortarSocketLocationInComponentSpace // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x17b8a00
	struct FVector K2_GetMortarSocketLocationInBoneSpace(struct FName Bone, struct FName Socket); // Function WTL.WTLCharacterBodyAnimInstance.K2_GetMortarSocketLocationInBoneSpace // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x17b87c0
	struct FVector K2_GetMortarSocketLocation(struct FName Socket); // Function WTL.WTLCharacterBodyAnimInstance.K2_GetMortarSocketLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x17b8bd0
	float K2_GetMortarInclineAlpha(); // Function WTL.WTLCharacterBodyAnimInstance.K2_GetMortarInclineAlpha // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17b8710
	struct FVector GetUsableItemAnimationVectorParameter(int32_t Index); // Function WTL.WTLCharacterBodyAnimInstance.GetUsableItemAnimationVectorParameter // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x17b8e40
	float GetUsableItemAnimationFloatParameter(int32_t Index); // Function WTL.WTLCharacterBodyAnimInstance.GetUsableItemAnimationFloatParameter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17b8d40
};

// Class WTL.WTLCharacterCameraComponent
// Size: 0x7d0 (Inherited: 0x7c0)
struct UWTLCharacterCameraComponent : UCameraComponent {
	char pad_7C0[0x10]; // 0x7c0(0x10)
};

// Class WTL.WTLCharacterCustomizationHelper
// Size: 0x28 (Inherited: 0x28)
struct UWTLCharacterCustomizationHelper : UObject {
};

// Class WTL.WTLCharacterDrop
// Size: 0x368 (Inherited: 0x260)
struct AWTLCharacterDrop : AWTLInteractiveObject {
	char pad_260[0x10]; // 0x260(0x10)
	uint64_t m_CharacterID; // 0x270(0x08)
	uint64_t m_CharacterGroupID; // 0x278(0x08)
	uint16_t m_CharacterClanID; // 0x280(0x02)
	enum class EWTLFaction m_CharacterFaction; // 0x282(0x01)
	char pad_283[0x1]; // 0x283(0x01)
	int32_t m_SlotsCount; // 0x284(0x04)
	struct FWTLStorageContent m_StorageContent; // 0x288(0xa8)
	struct USceneComponent* m_SceneComponent; // 0x330(0x08)
	struct UStaticMeshComponent* m_StaticMeshComponent; // 0x338(0x08)
	bool IsHighLighted; // 0x340(0x01)
	char pad_341[0x27]; // 0x341(0x27)

	void OnRep_StorageContent(); // Function WTL.WTLCharacterDrop.OnRep_StorageContent // (Final|Native|Public) // @ game+0x17b94c0
};

// Class WTL.WTLCharacterEffectsSystem
// Size: 0x40 (Inherited: 0x28)
struct UWTLCharacterEffectsSystem : UObject {
	char pad_28[0x18]; // 0x28(0x18)
};

// Class WTL.WTLCharacterIdentityComponent
// Size: 0x880 (Inherited: 0xb0)
struct UWTLCharacterIdentityComponent : UActorComponent {
	char pad_B0[0x448]; // 0xb0(0x448)
	struct TMap<struct AActor*, struct FWTLIdentificationMemoryElement> m_IdentificationMemory; // 0x4f8(0x50)
	struct TArray<struct FWTLMarkerMemoryElement> m_MarkersMemory; // 0x548(0x10)
	struct UFont* m_Font; // 0x558(0x08)
	struct UTexture2D* m_IdentificationIconsAtlas; // 0x560(0x08)
	struct UTexture2D* m_IdentificationAIIconsAtlas; // 0x568(0x08)
	struct UTexture2D* m_HealthbarSliceTexture; // 0x570(0x08)
	struct UTexture2D* m_BorderTexture; // 0x578(0x08)
	struct UTexture2D* m_MobileResurrectionPointIconTexture; // 0x580(0x08)
	struct UTexture2D* m_MobileHealPointIconTexture; // 0x588(0x08)
	struct UTexture2D* m_ElectronicBaitTexture; // 0x590(0x08)
	struct UTexture2D* m_FortificationSafeZoneJammerTexture; // 0x598(0x08)
	struct UTexture2D* m_ConfederationIconTexture; // 0x5a0(0x08)
	struct UTexture2D* m_BlackSunsetIconTexture; // 0x5a8(0x08)
	struct UTexture2D* m_PVPEnabledIconTexture; // 0x5b0(0x08)
	struct UTexture2D* m_FounderIconTexture; // 0x5b8(0x08)
	struct UTexture2D* m_DroneIconTexture; // 0x5c0(0x08)
	struct UTexture2D* m_MortarIconTexture; // 0x5c8(0x08)
	struct UTexture2D* m_ConfederationHealthbarLogo; // 0x5d0(0x08)
	struct UTexture2D* m_BlackSunsetHealthbarLogo; // 0x5d8(0x08)
	struct UTexture2D* m_HealthbarOnlyBackground; // 0x5e0(0x08)
	struct UTexture2D* m_ClanMembersSimplifiedIcon; // 0x5e8(0x08)
	struct UTexture2D* m_ClanCommanderSimplifiedIcon; // 0x5f0(0x08)
	struct TMap<enum class EWTLCharacterClass, struct FCanvasIcon> m_CharacterClassIcons; // 0x5f8(0x50)
	struct TMap<enum class EWTLPlayerType, struct FCanvasIcon> m_CharacterStaffIcons; // 0x648(0x50)
	struct TMap<enum class EWTLCharacterEffectType, struct FCanvasIcon> m_CharacterEffectIcons; // 0x698(0x50)
	char pad_6E8[0x58]; // 0x6e8(0x58)
	struct UCurveFloat* MemoryAlphaColorCurve; // 0x740(0x08)
	struct FLinearColor FriendTextColor; // 0x748(0x10)
	struct FLinearColor NeutralTextColor; // 0x758(0x10)
	struct FLinearColor EnemyTextColor; // 0x768(0x10)
	struct FLinearColor AgressorTextColor; // 0x778(0x10)
	struct FLinearColor FriendClanTextColor; // 0x788(0x10)
	struct FLinearColor NeutralClanTextColor; // 0x798(0x10)
	struct FLinearColor EnemyClanTextColor; // 0x7a8(0x10)
	struct FLinearColor GroupMemberNameColor; // 0x7b8(0x10)
	struct FLinearColor ClanMemberNameColor; // 0x7c8(0x10)
	struct UCurveLinearColor* ReputationColorCurve; // 0x7d8(0x08)
	struct FLinearColor IconTradeForExperienceColor; // 0x7e0(0x10)
	struct FColor MonsterDangerLevelColorNone; // 0x7f0(0x04)
	struct FColor MonsterDangerLevelColorLow; // 0x7f4(0x04)
	struct FColor MonsterDangerLevelColorBelowNormal; // 0x7f8(0x04)
	struct FColor MonsterDangerLevelColorNormal; // 0x7fc(0x04)
	struct FColor MonsterDangerLevelColorAboveNormal; // 0x800(0x04)
	struct FColor MonsterDangerLevelColorHigh; // 0x804(0x04)
	struct FColor MonsterDangerLevelColorCritical; // 0x808(0x04)
	float IdentityConeCheckInterval; // 0x80c(0x04)
	float DistanceDependentIdentityWidgetOffset; // 0x810(0x04)
	float IdentificationWidgetMinimumScale; // 0x814(0x04)
	float IdentificationWidgetMaximumScale; // 0x818(0x04)
	float IdentificationVerticalScreenPositionTreshold; // 0x81c(0x04)
	char pad_820[0x4]; // 0x820(0x04)
	float IdentityGainPerSec; // 0x824(0x04)
	float IdentityCooldownPerSec; // 0x828(0x04)
	float IdentityLimit; // 0x82c(0x04)
	float IdentityLevelToSpot; // 0x830(0x04)
	float FarScreenRadiusStart; // 0x834(0x04)
	float FarScreenRadiusEnd; // 0x838(0x04)
	bool bIsDebugEnabled; // 0x83c(0x01)
	bool bIsIdentityEnabled; // 0x83d(0x01)
	bool bIsPlayersIdentityEnabled; // 0x83e(0x01)
	bool bIsMonstersIdentityEnabled; // 0x83f(0x01)
	bool bIsLevelObjectsIdentityEnabled; // 0x840(0x01)
	bool bIsNPCIdentityEnabled; // 0x841(0x01)
	bool bIsEnemyNPCIdentityEnabled; // 0x842(0x01)
	char pad_843[0x1]; // 0x843(0x01)
	float IdentityDistance; // 0x844(0x04)
	float FOVConeRadiusDivider; // 0x848(0x04)
	float IdentificationScaleup; // 0x84c(0x04)
	enum class EWTLSimplifiedIdentificationType SimplifiedIdentificationType; // 0x850(0x01)
	char pad_851[0x3]; // 0x851(0x03)
	float IdentificationTransparency; // 0x854(0x04)
	struct TSoftObjectPtr<UCurveFloat> IdentificationOverheadOffsetByDistanceCurve; // 0x858(0x28)
};

// Class WTL.WTLCharacterMovementComponent
// Size: 0xb70 (Inherited: 0xb00)
struct UWTLCharacterMovementComponent : UCharacterMovementComponent {
	char pad_B00[0x48]; // 0xb00(0x48)
	float CrouchingSpeed; // 0xb48(0x04)
	float TiltAngle; // 0xb4c(0x04)
	float TiltSpeed; // 0xb50(0x04)
	float LadderClimbingSpeed; // 0xb54(0x04)
	float LadderClimbingFriction; // 0xb58(0x04)
	float LadderMovementFloorTraceDistance; // 0xb5c(0x04)
	float PronedHalfHeight; // 0xb60(0x04)
	float SwimmedHalfHeight; // 0xb64(0x04)
	char bTransportMovementMode : 1; // 0xb68(0x01)
	char pad_B68_1 : 7; // 0xb68(0x01)
	char pad_B69[0x7]; // 0xb69(0x07)

	void Server_SetLadderClimbing(bool Value); // Function WTL.WTLCharacterMovementComponent.Server_SetLadderClimbing // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x17ba560
	void NetMulticast_PlayLadderMontage(struct AWTLLadder* Ladder, enum class EWTLLadderMontageType LadderMontageType); // Function WTL.WTLCharacterMovementComponent.NetMulticast_PlayLadderMontage // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x17ba400
};

// Class WTL.WTLCharacterPreview
// Size: 0x610 (Inherited: 0x220)
struct AWTLCharacterPreview : AActor {
	struct USkeletalMeshComponent* Base; // 0x220(0x08)
	struct USkeletalMeshComponent* TorsoSlot; // 0x228(0x08)
	struct USkeletalMeshComponent* Head; // 0x230(0x08)
	struct USkeletalMeshComponent* HeadSlot; // 0x238(0x08)
	struct USkeletalMeshComponent* Legs; // 0x240(0x08)
	struct USkeletalMeshComponent* LegsSlot; // 0x248(0x08)
	struct USkeletalMeshComponent* Feet; // 0x250(0x08)
	struct USkeletalMeshComponent* FeetSlot; // 0x258(0x08)
	struct USkeletalMeshComponent* BackpackSlot; // 0x260(0x08)
	struct USkeletalMeshComponent* GlassesSlot; // 0x268(0x08)
	struct USkeletalMeshComponent* EquipmentSlot1; // 0x270(0x08)
	struct USkeletalMeshComponent* EquipmentSlot2; // 0x278(0x08)
	struct USkeletalMeshComponent* EquipmentSlot3; // 0x280(0x08)
	struct USkeletalMeshComponent* EquipmentSlot4; // 0x288(0x08)
	struct USkeletalMeshComponent* WatchesSlot; // 0x290(0x08)
	struct UStaticMeshComponent* EquippedWeaponSlot0; // 0x298(0x08)
	struct UStaticMeshComponent* EquippedWeaponSlot0MuzzleMount; // 0x2a0(0x08)
	struct UStaticMeshComponent* EquippedWeaponSlot0MuzzleAttachment; // 0x2a8(0x08)
	struct UStaticMeshComponent* EquippedWeaponSlot0FlashlightMount; // 0x2b0(0x08)
	struct UStaticMeshComponent* EquippedWeaponSlot0FlashlightAttachment; // 0x2b8(0x08)
	struct UStaticMeshComponent* EquippedWeaponSlot0ScopeMount; // 0x2c0(0x08)
	struct UStaticMeshComponent* EquippedWeaponSlot0ScopeAttachment; // 0x2c8(0x08)
	struct UStaticMeshComponent* EquippedWeaponSlot1; // 0x2d0(0x08)
	struct UStaticMeshComponent* EquippedWeaponSlot1MuzzleMount; // 0x2d8(0x08)
	struct UStaticMeshComponent* EquippedWeaponSlot1MuzzleAttachment; // 0x2e0(0x08)
	struct UStaticMeshComponent* EquippedWeaponSlot1FlashlightMount; // 0x2e8(0x08)
	struct UStaticMeshComponent* EquippedWeaponSlot1FlashlightAttachment; // 0x2f0(0x08)
	struct UStaticMeshComponent* EquippedWeaponSlot1ScopeMount; // 0x2f8(0x08)
	struct UStaticMeshComponent* EquippedWeaponSlot1ScopeAttachment; // 0x300(0x08)
	struct UStaticMeshComponent* EquippedStuffSlot1; // 0x308(0x08)
	struct UStaticMeshComponent* HolsterSlot; // 0x310(0x08)
	struct UStaticMeshComponent* EquippedPistolPreviewSlot; // 0x318(0x08)
	struct UStaticMeshComponent* SheathSlot; // 0x320(0x08)
	struct UStaticMeshComponent* SheathPreviewSlot; // 0x328(0x08)
	struct UStaticMeshComponent* ItemInHands; // 0x330(0x08)
	struct UStaticMeshComponent* ItemInHandsMuzzleMount; // 0x338(0x08)
	struct UStaticMeshComponent* ItemInHandsMuzzleAttachmeht; // 0x340(0x08)
	struct UStaticMeshComponent* ItemInHandsFlashlightMount; // 0x348(0x08)
	struct UStaticMeshComponent* ItemInHandsFlashlightAttachment; // 0x350(0x08)
	struct UStaticMeshComponent* ItemInHandsScopeMount; // 0x358(0x08)
	struct UStaticMeshComponent* ItemInHandsScopeAttachment; // 0x360(0x08)
	struct TSoftObjectPtr<USkeletalMesh> MaleTorsoMeshFullArms; // 0x368(0x28)
	struct TSoftObjectPtr<USkeletalMesh> MaleTorsoMeshHalfArms; // 0x390(0x28)
	struct TSoftObjectPtr<USkeletalMesh> MaleTorsoMeshHandsOnly; // 0x3b8(0x28)
	struct TSoftObjectPtr<USkeletalMesh> FemaleTorsoMeshFullArms; // 0x3e0(0x28)
	struct TSoftObjectPtr<USkeletalMesh> FemaleTorsoMeshHalfArms; // 0x408(0x28)
	struct TSoftObjectPtr<USkeletalMesh> FemaleTorsoMeshHandsOnly; // 0x430(0x28)
	struct AWTLCharacterPreviewRoom* m_CharacterPreviewRoom; // 0x458(0x08)
	char pad_460[0x1b0]; // 0x460(0x1b0)

	void UpdateFromStore(struct AWTLCharacter* Character, struct FWTLShortCharacterInfo& ShortCharacterInfo, enum class EWTLItemType ArmsItemType, int32_t ArmsItemTypeID, char CustomizationScalar, char CustomizationColor, int32_t MuzzleAttachmentTypeID, int32_t FlashlightAttachmentTypeID, int32_t ScopeAttachmentTypeID); // Function WTL.WTLCharacterPreview.UpdateFromStore // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x17ba880
	void UpdateFromShortCharacterInfo(struct FWTLShortCharacterInfo& ShortCharacterInfo); // Function WTL.WTLCharacterPreview.UpdateFromShortCharacterInfo // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x17bae00
	void UpdateFromCharacter(struct AWTLCharacter* Character); // Function WTL.WTLCharacterPreview.UpdateFromCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x17baf00
	void SetCharacterPreviewType(enum class EWTLCharacterPreviewType PreviewType); // Function WTL.WTLCharacterPreview.SetCharacterPreviewType // (Final|Native|Public|BlueprintCallable) // @ game+0x17bafe0
};

// Class WTL.WTLCharacterPreviewAnimInstance
// Size: 0x350 (Inherited: 0x2c0)
struct UWTLCharacterPreviewAnimInstance : UAnimInstance {
	struct UAnimSequence* SnuggleAnimation; // 0x2b8(0x08)
	struct UAnimSequence* IdleAnimation; // 0x2c0(0x08)
	struct FVector ScaleFeetVector; // 0x2c8(0x0c)
	struct FVector InvertScaleFeetVector; // 0x2d4(0x0c)
	struct FVector ScaleHandsVector; // 0x2e0(0x0c)
	struct FVector InvertScaleHandsVector; // 0x2ec(0x0c)
	struct FVector ScaleHeadVector; // 0x2f8(0x0c)
	struct FVector ScaleNeckVector; // 0x304(0x0c)
	struct FVector InvertScaleRibCageVector; // 0x310(0x0c)
	struct FVector ScaleRibCageVector; // 0x31c(0x0c)
	float FScaleHands; // 0x328(0x04)
	float FScaleRibCage; // 0x32c(0x04)
	float FScaleFeet; // 0x330(0x04)
	float FScaleHead; // 0x334(0x04)
	float FScaleNeck; // 0x338(0x04)
	bool bIsWeaponInHands; // 0x33c(0x01)
	struct FVector IKHandParameter; // 0x340(0x0c)

	void UpdateComplexity(char BodyType); // Function WTL.WTLCharacterPreviewAnimInstance.UpdateComplexity // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x17bb1e0
};

// Class WTL.WTLCharacterPreviewRoom
// Size: 0x268 (Inherited: 0x220)
struct AWTLCharacterPreviewRoom : AActor {
	struct USceneComponent* Root; // 0x220(0x08)
	struct USceneCaptureComponent2D* CaptureComponent; // 0x228(0x08)
	struct UChildActorComponent* CharacterPreview; // 0x230(0x08)
	char pad_238[0x14]; // 0x238(0x14)
	struct FVector CharacterFaceCaptureComponentLocation; // 0x24c(0x0c)
	struct FVector CharacterFaceWhenItemInHandsCaptureComponentLocation; // 0x258(0x0c)
	char pad_264[0x4]; // 0x264(0x04)

	struct AWTLCharacterPreview* GetCharacterPreview(); // Function WTL.WTLCharacterPreviewRoom.GetCharacterPreview // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17bb480
};

// Class WTL.WTLCharacterTransportBase
// Size: 0x510 (Inherited: 0x4c0)
struct AWTLCharacterTransportBase : ACharacter {
	char pad_4C0[0x38]; // 0x4c0(0x38)
	struct TArray<enum class EObjectTypeQuery> CollisionObjectTypes; // 0x4f8(0x10)
	float SpeedRotation; // 0x508(0x04)
	char pad_50C[0x4]; // 0x50c(0x04)

	void K2_Use(struct AWTLCharacter* Character); // Function WTL.WTLCharacterTransportBase.K2_Use // (Native|Event|Public|BlueprintEvent) // @ game+0xf3f2f0
	void K2_SetHighlightState(bool Value); // Function WTL.WTLCharacterTransportBase.K2_SetHighlightState // (Native|Event|Public|BlueprintEvent) // @ game+0x17bb7f0
	struct FString K2_GetDisplayText(struct AWTLCharacter* Character); // Function WTL.WTLCharacterTransportBase.K2_GetDisplayText // (Native|Event|Public|BlueprintEvent) // @ game+0x17bb6c0
	bool K2_CanBeUsed(struct AWTLCharacter* Character); // Function WTL.WTLCharacterTransportBase.K2_CanBeUsed // (Native|Event|Public|BlueprintEvent) // @ game+0x17bb8d0
	bool IsUses(); // Function WTL.WTLCharacterTransportBase.IsUses // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17bb650
	struct AWTLPlayerController* GetMyController(); // Function WTL.WTLCharacterTransportBase.GetMyController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17bb680
	struct AWTLCharacter* GetMyCharacter(); // Function WTL.WTLCharacterTransportBase.GetMyCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17bb6a0
};

// Class WTL.WTLCharacterWatchAnimInstance
// Size: 0x2d0 (Inherited: 0x2c0)
struct UWTLCharacterWatchAnimInstance : UAnimInstance {
	float HourHandAngle; // 0x2c0(0x04)
	float MinuteHandAngle; // 0x2c4(0x04)
	float SecondHandAngle; // 0x2c8(0x04)
	int32_t Complexion; // 0x2cc(0x04)
};

// Class WTL.WTLChargeablePlaceableStuff
// Size: 0x3c0 (Inherited: 0x398)
struct AWTLChargeablePlaceableStuff : AWTLPlaceableStuff {
	char pad_398[0x1c]; // 0x398(0x1c)
	float ChargeRange; // 0x3b4(0x04)
	float EnergyChargePerSecond; // 0x3b8(0x04)
	float m_Energy; // 0x3bc(0x04)

	void OnRep_Energy(); // Function WTL.WTLChargeablePlaceableStuff.OnRep_Energy // (Native|Protected) // @ game+0x17bbd00
	float BPGetEnergy(); // Function WTL.WTLChargeablePlaceableStuff.BPGetEnergy // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x17bbce0
	float BPGetCondition(); // Function WTL.WTLChargeablePlaceableStuff.BPGetCondition // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x17bbcb0
	void BPCharged(); // Function WTL.WTLChargeablePlaceableStuff.BPCharged // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
};

// Class WTL.WTLRichTextBlock
// Size: 0x8f8 (Inherited: 0x678)
struct UWTLRichTextBlock : URichTextBlock {
	struct TArray<struct UDataTable*> AdditionalStyleSets; // 0x678(0x10)
	struct FTextBlockStyle DefaultTextBlockStyle; // 0x688(0x270)
};

// Class WTL.WTLChatTextBlock
// Size: 0x900 (Inherited: 0x8f8)
struct UWTLChatTextBlock : UWTLRichTextBlock {
	char pad_8F8[0x8]; // 0x8f8(0x08)

	void K2_SetWrapTextAt(float Value); // Function WTL.WTLChatTextBlock.K2_SetWrapTextAt // (Final|Native|Public|BlueprintCallable) // @ game+0x17bbf30
};

// Class WTL.WTLCommandCore
// Size: 0x288 (Inherited: 0x220)
struct AWTLCommandCore : AActor {
	char pad_220[0x10]; // 0x220(0x10)
	struct USphereComponent* ZoneSphere; // 0x230(0x08)
	struct UStaticMeshComponent* GeneratorMesh; // 0x238(0x08)
	char pad_240[0x18]; // 0x240(0x18)
	struct TArray<enum class EWTLFaction> IntrudersFactionList; // 0x258(0x10)
	char pad_268[0x10]; // 0x268(0x10)
	struct TArray<struct FWTLIntruderInfo> Intruders; // 0x278(0x10)

	void OnIntruderKilled(struct APawn* Victim); // Function WTL.WTLCommandCore.OnIntruderKilled // (Final|Native|Public|BlueprintCallable) // @ game+0x17941a0
	void OnIntruderDetected(struct APawn* Intruder, bool bIsLethal); // Function WTL.WTLCommandCore.OnIntruderDetected // (Final|Native|Public|BlueprintCallable) // @ game+0x17a9070
	void K2_OnIntruderKilled(struct APawn* Victim); // Function WTL.WTLCommandCore.K2_OnIntruderKilled // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	bool IsIntruder(struct AWTLCharacter* Character); // Function WTL.WTLCommandCore.IsIntruder // (Final|Native|Public|BlueprintCallable) // @ game+0x17bd040
};

// Class WTL.WTLFortificationCommandCore
// Size: 0x480 (Inherited: 0x288)
struct AWTLFortificationCommandCore : AWTLCommandCore {
	char pad_288[0x8]; // 0x288(0x08)
	struct AWTLFortificationSafeZone* FortificationSafeZone; // 0x290(0x08)
	struct TArray<struct AWTLFortificationEnemyNPCSpawner*> NPCSpawners; // 0x298(0x10)
	struct TArray<struct AWTLSafeZone*> OppositeForcesSafeZones; // 0x2a8(0x10)
	char pad_2B8[0x28]; // 0x2b8(0x28)
	struct UFMODAudioComponent* m_AudioComponent; // 0x2e0(0x08)
	char pad_2E8[0x18]; // 0x2e8(0x18)
	int32_t CommandCoreID; // 0x300(0x04)
	float MaxEnergy; // 0x304(0x04)
	float EnergyDrainPerSecond; // 0x308(0x04)
	float EnergyRecoverPerSecond; // 0x30c(0x04)
	float EnergyPercentForSafeZoneFunctionality; // 0x310(0x04)
	float SignalRange; // 0x314(0x04)
	float ScoreZoneRange; // 0x318(0x04)
	char HackingDificulty; // 0x31c(0x01)
	char pad_31D[0x3]; // 0x31d(0x03)
	float MaxHackingEnergyPercent; // 0x320(0x04)
	float SaveStateToDBInterval; // 0x324(0x04)
	float ScoreMultiplier; // 0x328(0x04)
	float m_Energy; // 0x32c(0x04)
	float HackingStateNoiseInterval; // 0x330(0x04)
	float NoiseEmittingRange; // 0x334(0x04)
	char pad_338[0x8]; // 0x338(0x08)
	struct TArray<struct FWTLFortificationReward> Rewards; // 0x340(0x10)
	struct FWTLDateTime m_LastHackTime; // 0x350(0x08)
	struct FWTLDateTime m_TimeTillNextHack; // 0x358(0x08)
	char pad_360[0x8]; // 0x360(0x08)
	struct FTimespan HackingDelay; // 0x368(0x08)
	struct FTimespan CaptureTimeInterval; // 0x370(0x08)
	struct FLinearColor OperationStateScreenLightColor; // 0x378(0x10)
	struct FLinearColor ExploitingStateScreenLightColor; // 0x388(0x10)
	struct UTexture* OperationStateScreenTexture; // 0x398(0x08)
	struct UTexture* ExploitingStateScreenTexture; // 0x3a0(0x08)
	enum class EWTLFaction m_ControlFaction; // 0x3a8(0x01)
	bool bUseDebugControlFaction; // 0x3a9(0x01)
	enum class EWTLFaction DebugControlFaction; // 0x3aa(0x01)
	char pad_3AB[0x15]; // 0x3ab(0x15)
	bool bIsAnyEngineerConnected; // 0x3c0(0x01)
	char pad_3C1[0x7]; // 0x3c1(0x07)
	struct TSoftClassPtr<UObject> CoreHackingWidgetClass; // 0x3c8(0x28)
	char pad_3F0[0x90]; // 0x3f0(0x90)

	void SetVulnerable(); // Function WTL.WTLFortificationCommandCore.SetVulnerable // (Final|Native|Public|BlueprintCallable) // @ game+0x17f1dd0
	void OnRep_TimeTillNextHack(); // Function WTL.WTLFortificationCommandCore.OnRep_TimeTillNextHack // (Final|Native|Protected) // @ game+0x17f2010
	void OnRep_IsAnyEngineerConnected(); // Function WTL.WTLFortificationCommandCore.OnRep_IsAnyEngineerConnected // (Final|Native|Protected) // @ game+0x17f2050
	void OnRep_Energy(); // Function WTL.WTLFortificationCommandCore.OnRep_Energy // (Final|Native|Protected) // @ game+0x17f21b0
	void OnRep_ControlFaction(); // Function WTL.WTLFortificationCommandCore.OnRep_ControlFaction // (Final|Native|Protected) // @ game+0x17f2150
	void OnControlFactionChanged(enum class EWTLFaction Faction); // Function WTL.WTLFortificationCommandCore.OnControlFactionChanged // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void NetMulticast_OnCaptureEnded(); // Function WTL.WTLFortificationCommandCore.NetMulticast_OnCaptureEnded // (Net|Native|Event|NetMulticast|Protected) // @ game+0xba4570
	bool IsVulnerable(); // Function WTL.WTLFortificationCommandCore.IsVulnerable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17f1ed0
	bool IsStateRestored(); // Function WTL.WTLFortificationCommandCore.IsStateRestored // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17f1cf0
	bool IsJammed(); // Function WTL.WTLFortificationCommandCore.IsJammed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17f1ff0
	bool IsCaptureInProgress(); // Function WTL.WTLFortificationCommandCore.IsCaptureInProgress // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17f1da0
	struct FWTLDateTime GetTimeTillNextHack(); // Function WTL.WTLFortificationCommandCore.GetTimeTillNextHack // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17ec6e0
	float GetSignalRange(); // Function WTL.WTLFortificationCommandCore.GetSignalRange // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17f1f00
	float GetNormalizedEnergy(); // Function WTL.WTLFortificationCommandCore.GetNormalizedEnergy // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17f1f40
	float GetMaxEnergy(); // Function WTL.WTLFortificationCommandCore.GetMaxEnergy // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17f1f20
	struct FWTLDateTime GetLastHackTime(); // Function WTL.WTLFortificationCommandCore.GetLastHackTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17ec700
	struct FWTLDateTime GetHackEndTime(); // Function WTL.WTLFortificationCommandCore.GetHackEndTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17f1d70
	float GetEnergyPercent(); // Function WTL.WTLFortificationCommandCore.GetEnergyPercent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17f1f90
	float GetEnergy(); // Function WTL.WTLFortificationCommandCore.GetEnergy // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17f1fd0
	enum class EWTLFaction GetControlFaction(); // Function WTL.WTLFortificationCommandCore.GetControlFaction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1186730
	void ClientStopInteraction(); // Function WTL.WTLFortificationCommandCore.ClientStopInteraction // (Final|Native|Public) // @ game+0x17f1d10
};

// Class WTL.WTLCheckpointCommandCore
// Size: 0x488 (Inherited: 0x480)
struct AWTLCheckpointCommandCore : AWTLFortificationCommandCore {
	char pad_480[0x8]; // 0x480(0x08)
};

// Class WTL.WTLCheckpointControllerComponent
// Size: 0xf0 (Inherited: 0xb0)
struct UWTLCheckpointControllerComponent : UActorComponent {
	char pad_B0[0x28]; // 0xb0(0x28)
	struct TArray<struct AWTLCheckpointCommandCore*> Checkpoints; // 0xd8(0x10)
	struct AWTLSafeZone* SafeZone; // 0xe8(0x08)

	void OnControlFactionChanged(enum class EWTLFaction Faction); // Function WTL.WTLCheckpointControllerComponent.OnControlFactionChanged // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnCheckpointStateRestored(); // Function WTL.WTLCheckpointControllerComponent.OnCheckpointStateRestored // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void OnAllCheckpointsCaptured(); // Function WTL.WTLCheckpointControllerComponent.OnAllCheckpointsCaptured // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	enum class EWTLFaction GetControlFaction(); // Function WTL.WTLCheckpointControllerComponent.GetControlFaction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17bc9f0
	struct FDateTime GetCaptureEndTime(); // Function WTL.WTLCheckpointControllerComponent.GetCaptureEndTime // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x17bc9b0
};

// Class WTL.WTLCircularProgressBar
// Size: 0x288 (Inherited: 0x260)
struct UWTLCircularProgressBar : UUserWidget {
	struct UImage* imgMaterial; // 0x260(0x08)
	char pad_268[0x8]; // 0x268(0x08)
	float Percent; // 0x270(0x04)
	struct FLinearColor Color; // 0x274(0x10)
	char pad_284[0x4]; // 0x284(0x04)

	void SetPercent(float Value); // Function WTL.WTLCircularProgressBar.SetPercent // (Final|Native|Public|BlueprintCallable) // @ game+0x17bcce0
	void SetColor(struct FLinearColor NewColor); // Function WTL.WTLCircularProgressBar.SetColor // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x17bcc10
};

// Class WTL.WTLDrone
// Size: 0x4d8 (Inherited: 0x280)
struct AWTLDrone : APawn {
	char pad_280[0x10]; // 0x280(0x10)
	struct USkeletalMeshComponent* DroneSkeletalMesh; // 0x290(0x08)
	struct USphereComponent* OverlapComponent; // 0x298(0x08)
	struct UFMODAudioComponent* WingsSound; // 0x2a0(0x08)
	float LifeTimeInWorld; // 0x2a8(0x04)
	float DroneMaxCondition; // 0x2ac(0x04)
	float DroneDamageMultiplier; // 0x2b0(0x04)
	float MaxDistanceFromCharacter; // 0x2b4(0x04)
	float SelfDestructionDamageValue; // 0x2b8(0x04)
	float SelfDestructionMinDamageValue; // 0x2bc(0x04)
	float SelfDestructionRadius; // 0x2c0(0x04)
	float DissolvingSpeed; // 0x2c4(0x04)
	struct TSoftClassPtr<UObject> ExplosionFX; // 0x2c8(0x28)
	struct TSoftClassPtr<UObject> SelfDestructionExplosionFX; // 0x2f0(0x28)
	float DroneHeight; // 0x318(0x04)
	enum class EWTLDroneMovementMode MovementMode; // 0x31c(0x01)
	char pad_31D[0x3]; // 0x31d(0x03)
	float RotationSpeed; // 0x320(0x04)
	char pad_324[0x4]; // 0x324(0x04)
	float Radius; // 0x328(0x04)
	char pad_32C[0x8]; // 0x32c(0x08)
	float Height; // 0x334(0x04)
	struct FVector RotationAxis; // 0x338(0x0c)
	bool Clockwise; // 0x344(0x01)
	char pad_345[0x3]; // 0x345(0x03)
	float HeightAboveCharacter; // 0x348(0x04)
	char pad_34C[0xc]; // 0x34c(0x0c)
	bool RotateAroundCharacter; // 0x358(0x01)
	char pad_359[0x3]; // 0x359(0x03)
	float RotationSpeedIfFollowCharacterFromAbove; // 0x35c(0x04)
	float RotationRadiusIfFollowCharacterFromAbove; // 0x360(0x04)
	float DroneHeightInterpSpeed; // 0x364(0x04)
	char pad_368[0x24]; // 0x368(0x24)
	float MaxHeight; // 0x38c(0x04)
	struct TMap<enum class EWTLWeaponType, float> DamageMultipliers; // 0x390(0x50)
	float ReputationDelta; // 0x3e0(0x04)
	bool AIMakeNoise; // 0x3e4(0x01)
	char pad_3E5[0x3]; // 0x3e5(0x03)
	float AINoiseDistance; // 0x3e8(0x04)
	struct FName AINoiseTag; // 0x3ec(0x08)
	char pad_3F4[0x14]; // 0x3f4(0x14)
	float DroneCondition; // 0x408(0x04)
	char pad_40C[0x1c]; // 0x40c(0x1c)
	uint64_t DroneItemID; // 0x428(0x08)
	uint16_t DroneItemTypeID; // 0x430(0x02)
	enum class EWTLFaction Faction; // 0x432(0x01)
	char pad_433[0x5]; // 0x433(0x05)
	struct AWTLCharacter* m_Character; // 0x438(0x08)
	bool m_bDestroyDrone; // 0x440(0x01)
	bool m_bIsFalling; // 0x441(0x01)
	bool m_bSelfDestruction; // 0x442(0x01)
	char pad_443[0x1]; // 0x443(0x01)
	int32_t WeaponItemID; // 0x444(0x04)
	int32_t AmmoItemID; // 0x448(0x04)
	enum class EWTLFireMode FireMode; // 0x44c(0x01)
	char pad_44D[0x3]; // 0x44d(0x03)
	float TimeBetweenShots; // 0x450(0x04)
	char pad_454[0x84]; // 0x454(0x84)

	void OnRep_IsFalling(); // Function WTL.WTLDrone.OnRep_IsFalling // (Final|Native|Protected) // @ game+0x17dd430
	void OnRep_DroneCondition(); // Function WTL.WTLDrone.OnRep_DroneCondition // (Native|Protected) // @ game+0x17dd450
	void OnRep_DestroyDrone(); // Function WTL.WTLDrone.OnRep_DestroyDrone // (Final|Native|Protected) // @ game+0x17dd240
	void OnRep_Character(); // Function WTL.WTLDrone.OnRep_Character // (Final|Native|Protected) // @ game+0x17dd260
	void OnHit(struct UPrimitiveComponent* HitComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult& Hit); // Function WTL.WTLDrone.OnHit // (Native|Public|HasOutParms|HasDefaults) // @ game+0x17dc8e0
	void OnEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function WTL.WTLDrone.OnEndOverlap // (Native|Protected) // @ game+0x17dcc10
	void OnCharacterDied(struct AWTLCharacter* Character); // Function WTL.WTLDrone.OnCharacterDied // (Final|Native|Protected) // @ game+0x17941a0
	void OnBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function WTL.WTLDrone.OnBeginOverlap // (Native|Protected|HasOutParms) // @ game+0x17dce90
	void K2_UpdateDroneCondition(float ConditionValue); // Function WTL.WTLDrone.K2_UpdateDroneCondition // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	void K2_InitilizeDrone(struct AWTLCharacter* Character); // Function WTL.WTLDrone.K2_InitilizeDrone // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
	bool IsFriendly(enum class EWTLAITeam AIFaction); // Function WTL.WTLDrone.IsFriendly // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x17dc530
	float GetSideVelocity(); // Function WTL.WTLDrone.GetSideVelocity // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17dc8a0
	float GetMovementSpeed(); // Function WTL.WTLDrone.GetMovementSpeed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17dc860
	float GetForwardVelocity(); // Function WTL.WTLDrone.GetForwardVelocity // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17dc8c0
	struct AWTLCharacter* GetCharacter(); // Function WTL.WTLDrone.GetCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17dc880
	bool AIInterface_IsInSafeZone(); // Function WTL.WTLDrone.AIInterface_IsInSafeZone // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17dc710
	bool AIInterface_IsCanBeAttacked(enum class EWTLFaction InstigatorFaction); // Function WTL.WTLDrone.AIInterface_IsCanBeAttacked // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17dc630
	bool AIInterface_IsAlive(); // Function WTL.WTLDrone.AIInterface_IsAlive // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17dc820
	struct FVector AIInterface_GetVelocity(); // Function WTL.WTLDrone.AIInterface_GetVelocity // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x17dc790
	int32_t AIInterface_GetGroupID(); // Function WTL.WTLDrone.AIInterface_GetGroupID // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17dc7e0
	enum class EWTLFaction AIInterface_GetFaction(); // Function WTL.WTLDrone.AIInterface_GetFaction // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17dc750
};

// Class WTL.WTLCombatDrone
// Size: 0x4d8 (Inherited: 0x4d8)
struct AWTLCombatDrone : AWTLDrone {
};

// Class WTL.WTLCommandCoreNode
// Size: 0x28 (Inherited: 0x28)
struct UWTLCommandCoreNode : UInterface {

	void OnIntruderRemovedFromList(struct APawn* Intruder); // Function WTL.WTLCommandCoreNode.OnIntruderRemovedFromList // (Native|Event|Public|BlueprintEvent) // @ game+0x1774ab0
	void OnIntruderDetected(struct APawn* Intruder); // Function WTL.WTLCommandCoreNode.OnIntruderDetected // (Native|Event|Public|BlueprintEvent) // @ game+0x1774b90
	float GetWatchingRange(); // Function WTL.WTLCommandCoreNode.GetWatchingRange // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x17bd260
	struct AWTLCommandCore* GetCommandCore(); // Function WTL.WTLCommandCoreNode.GetCommandCore // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x17bd290
	void CommandCoreLink(struct AWTLCommandCore* CommandCore); // Function WTL.WTLCommandCoreNode.CommandCoreLink // (Native|Event|Public|BlueprintEvent) // @ game+0x17bd2c0
};

// Class WTL.WTLBTTask_TurretFindTarget
// Size: 0x78 (Inherited: 0x70)
struct UWTLBTTask_TurretFindTarget : UBTTaskNode {
	float ScanningInterval; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class WTL.WTLBTTask_TurretExtermination
// Size: 0x78 (Inherited: 0x70)
struct UWTLBTTask_TurretExtermination : UBTTaskNode {
	float TargetHitTimeout; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class WTL.WTLCommandCoreTurret
// Size: 0x360 (Inherited: 0x280)
struct AWTLCommandCoreTurret : APawn {
	char pad_280[0x18]; // 0x280(0x18)
	struct UStaticMeshComponent* Stand; // 0x298(0x08)
	struct USkeletalMeshComponent* Body; // 0x2a0(0x08)
	struct UParticleSystemComponent* Muzzle; // 0x2a8(0x08)
	struct UParticleSystemComponent* ProjectilesEmitter; // 0x2b0(0x08)
	struct USphereComponent* VisionZone; // 0x2b8(0x08)
	struct UFMODAudioComponent* AudioComponent; // 0x2c0(0x08)
	struct TSoftObjectPtr<UFMODEvent> TurretSoundEvent; // 0x2c8(0x28)
	char pad_2F0[0x34]; // 0x2f0(0x34)
	float FireRate; // 0x324(0x04)
	float MinDamage; // 0x328(0x04)
	float MaxDamage; // 0x32c(0x04)
	float Prewarm; // 0x330(0x04)
	float Cooldown; // 0x334(0x04)
	struct APawn* TargetToFollow; // 0x338(0x08)
	char pad_340[0x20]; // 0x340(0x20)

	void OnRep_TargetToFollow(struct APawn* Previous); // Function WTL.WTLCommandCoreTurret.OnRep_TargetToFollow // (Final|Native|Private) // @ game+0x17bd890
	void K2_OnPawnKilled(struct APawn* TargetPawn); // Function WTL.WTLCommandCoreTurret.K2_OnPawnKilled // (Event|Public|BlueprintEvent) // @ game+0x1ad0090
};

// Class WTL.WTLCommandSystem
// Size: 0x50 (Inherited: 0x28)
struct UWTLCommandSystem : UObject {
	char pad_28[0x28]; // 0x28(0x28)

	void CC_Weather_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_Weather_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_Weather(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Weather // (Final|Native|Public|HasOutParms) // @ game+0x17c1500
	bool CC_WE(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_WE // (Final|Native|Public|HasOutParms) // @ game+0x17c1a70
	void CC_VisitPortal_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_VisitPortal_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_VisitPortal(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_VisitPortal // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_VisitLocation_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_VisitLocation_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_VisitLocation(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_VisitLocation // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_UseAdaptiveNetUpdateFrequency_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_UseAdaptiveNetUpdateFrequency_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_UseAdaptiveNetUpdateFrequency(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_UseAdaptiveNetUpdateFrequency // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_UnvisitLocation_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_UnvisitLocation_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_UnvisitLocation(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_UnvisitLocation // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	bool CC_Test(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Test // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_TeleportCharacter_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_TeleportCharacter_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_TeleportCharacter(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_TeleportCharacter // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_Teleport_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_Teleport_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_Teleport(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Teleport // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_SystemMessage_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SystemMessage_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SystemMessage(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SystemMessage // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_SystemEvent_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SystemEvent_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SystemEvent(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SystemEvent // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_SteamConsumeTimeout_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SteamConsumeTimeout_Help // (Final|Native|Public) // @ game+0x17c0f60
	bool CC_SteamConsumeTimeout(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SteamConsumeTimeout // (Final|Native|Public|HasOutParms) // @ game+0x17c1030
	void CC_Sprint_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_Sprint_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_Sprint(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params, struct AWTLCharacter* Character); // Function WTL.WTLCommandSystem.CC_Sprint // (Final|Native|Public|HasOutParms) // @ game+0x17c1ce0
	void CC_Spectate_Help(); // Function WTL.WTLCommandSystem.CC_Spectate_Help // (Final|Native|Public) // @ game+0xe77850
	bool CC_Spectate(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Spectate // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	bool CC_Spawn(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Spawn // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_SlotMachine_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SlotMachine_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SlotMachine(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SlotMachine // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_SetWeaponExperience_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SetWeaponExperience_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SetWeaponExperience(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetWeaponExperience // (Final|Native|Public|HasOutParms) // @ game+0x17c1a70
	void CC_SetThirst_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SetThirst_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SetThirst(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetThirst // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_SetSurvivalExperience_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SetSurvivalExperience_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SetSurvivalExperience(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetSurvivalExperience // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_SetSpectatorMode_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SetSpectatorMode_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SetSpectatorMode(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetSpectatorMode // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_SetReputation_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SetReputation_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SetReputation(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetReputation // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_SetRepairExperience_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SetRepairExperience_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SetRepairExperience(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetRepairExperience // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_SetPvPMode_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SetPvPMode_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SetPvPMode(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetPvPMode // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_SetMiningExperience_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SetMiningExperience_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SetMiningExperience(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetMiningExperience // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_SetMedicExperience_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SetMedicExperience_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SetMedicExperience(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetMedicExperience // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_SetItemCondition_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SetItemCondition_Help // (Final|Native|Public) // @ game+0x17c1430
	bool CC_SetItemCondition(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetItemCondition // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_SetHunger_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SetHunger_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SetHunger(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetHunger // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_SetGroup_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SetGroup_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SetGroup(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetGroup // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_SetFaction_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SetFaction_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SetFaction(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetFaction // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	bool CC_SetEnergy(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetEnergy // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_SetCustomizationPart_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SetCustomizationPart_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SetCustomizationPart(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetCustomizationPart // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_SetCraftExperience_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SetCraftExperience_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SetCraftExperience(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetCraftExperience // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	bool CC_SetCondition(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetCondition // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_SetClass_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SetClass_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SetClass(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetClass // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_SetClan_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SetClan_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SetClan(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SetClan // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_SendLootBox_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SendLootBox_Help // (Final|Native|Public) // @ game+0x17c1290
	bool CC_SendLootBox(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SendLootBox // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_SafeZone_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_SafeZone_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_SafeZone(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_SafeZone // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_Revoke_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_Revoke_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_Revoke(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Revoke // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_Reputation_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_Reputation_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_Reputation(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Reputation // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_RepairAll_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_RepairAll_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_RepairAll(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_RepairAll // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_RemovePDAModule_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_RemovePDAModule_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_RemovePDAModule(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_RemovePDAModule // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_RecoverStamina_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_RecoverStamina_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_RecoverStamina(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_RecoverStamina // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_RecoverHP_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_RecoverHP_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_RecoverHP(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_RecoverHP // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_RecoverHealth_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_RecoverHealth_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_RecoverHealth(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_RecoverHealth // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_RecoverAll_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_RecoverAll_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_RecoverAll(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_RecoverAll // (Final|Native|Public|HasOutParms) // @ game+0x17c1a70
	void CC_RCS_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_RCS_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_RCS(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_RCS // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_Quest_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_Quest_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_Quest(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Quest // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_PVP_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_PVP_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_PVP(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_PVP // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	bool CC_ProjectX(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_ProjectX // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_MSpawner_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_MSpawner_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_MSpawner(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_MSpawner // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_MoveToLocation_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_MoveToLocation_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_MoveToLocation(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_MoveToLocation // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_Monster_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_Monster_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_Monster(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Monster // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_MaxConnectionsPerServerFrame_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_MaxConnectionsPerServerFrame_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_MaxConnectionsPerServerFrame(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_MaxConnectionsPerServerFrame // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_MarkAsPieceOfShit_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_MarkAsPieceOfShit_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_MarkAsPieceOfShit(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_MarkAsPieceOfShit // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_Mail_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_Mail_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_Mail(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Mail // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_ListPlayers_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_ListPlayers_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_ListPlayers(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_ListPlayers // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_Kit_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_Kit_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_Kit(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Kit // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	bool CC_KillAllNPC(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_KillAllNPC // (Final|Native|Public) // @ game+0x17bdd30
	void CC_Kill_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_Kill_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_Kill(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Kill // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_Kick_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_Kick_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_Kick(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Kick // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_JunkMachine_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_JunkMachine_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_JunkMachine(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_JunkMachine // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_GS_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_GS_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_GS(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_GS // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_Grant_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_Grant_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_Grant(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Grant // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_GodMode_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_GodMode_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_GodMode(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_GodMode // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	bool CC_God(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_God // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	bool CC_GM(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_GM // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_GLO_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_GLO_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_GLO(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_GLO // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	bool CC_GL(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_GL // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_GiveScore_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_GiveScore_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_GiveScore(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_GiveScore // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_GiveMoney_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_GiveMoney_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_GiveMoney(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_GiveMoney // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_GiveLevel_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_GiveLevel_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_GiveLevel(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_GiveLevel // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_GiveItem_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_GiveItem_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_GiveItem(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_GiveItem // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_GiveExperience_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_GiveExperience_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_GiveExperience(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_GiveExperience // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_GiveClanSkill_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_GiveClanSkill_Help // (Final|Native|Public) // @ game+0x17bf470
	bool CC_GiveClanSkill(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_GiveClanSkill // (Final|Native|Public|HasOutParms) // @ game+0x17bfd30
	void CC_GiveClanScore_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_GiveClanScore_Help // (Final|Native|Public) // @ game+0x17c0460
	bool CC_GiveClanScore(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_GiveClanScore // (Final|Native|Public|HasOutParms) // @ game+0x17c0d60
	bool CC_GI(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_GI // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_GetMeshInfo_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_GetMeshInfo_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_GetMeshInfo(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_GetMeshInfo // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_GetAccountID(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_GetAccountID // (Final|Native|Public|HasOutParms) // @ game+0x17bde00
	bool CC_GC(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_GC // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_ForceInformer_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_ForceInformer_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_ForceInformer(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_ForceInformer // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	bool CC_FillChat(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_FillChat // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_ExecList_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_ExecList_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_ExecList(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_ExecList // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_ExecCmd_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_ExecCmd_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_ExecCmd(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_ExecCmd // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_Exec_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_Exec_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_Exec(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Exec // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_Events_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_Events_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_Events(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Events // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	bool CC_Energy(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Energy // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_EnemyNPC_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_EnemyNPC_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_EnemyNPC(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_EnemyNPC // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_DropMode_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_DropMode_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_DropMode(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_DropMode // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	bool CC_Drone(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Drone // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_DrainPointEnergy_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_DrainPointEnergy_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_DrainPointEnergy(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_DrainPointEnergy // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_CurrentWeather_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_CurrentWeather_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_CurrentWeather(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_CurrentWeather // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_Craft_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_Craft_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_Craft(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_Craft // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_CommandCore_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_CommandCore_Help // (Final|Native|Public) // @ game+0x17c11c0
	bool CC_CommandCore(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_CommandCore // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_ClearSkills_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_ClearSkills_Help // (Final|Native|Public) // @ game+0x17be1f0
	bool CC_ClearSkills(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_ClearSkills // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_ClearExperience_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_ClearExperience_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_ClearExperience(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_ClearExperience // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_ClearClanSkills_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_ClearClanSkills_Help // (Final|Native|Public) // @ game+0x17beba0
	bool CC_ClearClanSkills(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_ClearClanSkills // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	bool CC_ClearChat(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_ClearChat // (Final|Native|Public) // @ game+0x17bdd30
	void CC_ChangeWeather_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_ChangeWeather_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_ChangeWeather(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_ChangeWeather // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_ChangeSex_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_ChangeSex_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_ChangeSex(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_ChangeSex // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_ChangeClass_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_ChangeClass_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_ChangeClass(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_ChangeClass // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_BlockMonsterSpawnOnFortificationCapture_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_BlockMonsterSpawnOnFortificationCapture_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_BlockMonsterSpawnOnFortificationCapture(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_BlockMonsterSpawnOnFortificationCapture // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_BecomeClanLeader_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_BecomeClanLeader_Help // (Final|Native|Public) // @ game+0x17bead0
	bool CC_BecomeClanLeader(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_BecomeClanLeader // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_BecomeClanLead_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_BecomeClanLead_Help // (Final|Native|Public) // @ game+0x17bead0
	bool CC_BecomeClanLead(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_BecomeClanLead // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_AssignItemToFastAccessSlot_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_AssignItemToFastAccessSlot_Help // (Final|Native|Public) // @ game+0x17c1360
	bool CC_AssignItemToFastAccessSlot(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_AssignItemToFastAccessSlot // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	bool CC_AirDrop(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_AirDrop // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_AddPDAModule_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_AddPDAModule_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_AddPDAModule(struct AWTLPlayerController* Player, struct AWTLPlayerState* PlayerState, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_AddPDAModule // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_AddEffect_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_AddEffect_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_AddEffect(struct AWTLPlayerController* Player, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_AddEffect // (Final|Native|Public|HasOutParms) // @ game+0x17bdbc0
	void CC_AccountInventory_Help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_AccountInventory_Help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_AccountInventory(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_AccountInventory // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
	void CC_AccountBalanceChange_help(struct AWTLPlayerController* Player); // Function WTL.WTLCommandSystem.CC_AccountBalanceChange_help // (Final|Native|Public) // @ game+0x17941a0
	bool CC_AccountBalanceChange(struct AWTLPlayerController* Player, struct AWTLCharacter* Character, struct TArray<struct FString>& Params); // Function WTL.WTLCommandSystem.CC_AccountBalanceChange // (Final|Native|Public|HasOutParms) // @ game+0x17bdff0
};

// Class WTL.WTLWidgetBase
// Size: 0x260 (Inherited: 0x260)
struct UWTLWidgetBase : UUserWidget {

	void Update(); // Function WTL.WTLWidgetBase.Update // (Native|Public) // @ game+0x17c4da0
};

// Class WTL.WTLCommonActionWaiting
// Size: 0x280 (Inherited: 0x260)
struct UWTLCommonActionWaiting : UWTLWidgetBase {
	struct UTextBlock* tbWaitingStatus; // 0x260(0x08)
	struct FText WaitingStatusText; // 0x268(0x18)
};

// Class WTL.WTLCommonAlphaSectionProgressBar
// Size: 0x2c8 (Inherited: 0x260)
struct UWTLCommonAlphaSectionProgressBar : UUserWidget {
	struct UPanelWidget* pwItemsBox; // 0x260(0x08)
	char pad_268[0x18]; // 0x268(0x18)
	char ItemsCount; // 0x280(0x01)
	char pad_281[0x3]; // 0x281(0x03)
	struct FLinearColor FillColor; // 0x284(0x10)
	bool bIsUseInterpolation; // 0x294(0x01)
	char pad_295[0x3]; // 0x295(0x03)
	float InterpolationSpeed; // 0x298(0x04)
	char pad_29C[0x4]; // 0x29c(0x04)
	struct TSoftClassPtr<UObject> ItemWidgetClass; // 0x2a0(0x28)
};

// Class WTL.WTLCommonAlphaSectionProgressBarItem
// Size: 0x268 (Inherited: 0x260)
struct UWTLCommonAlphaSectionProgressBarItem : UUserWidget {
	struct UImage* imgItem; // 0x260(0x08)
};

// Class WTL.WTLCommonBase
// Size: 0x290 (Inherited: 0x260)
struct UWTLCommonBase : UUserWidget {
	bool IsSetTooltipTextByCustomTooltipWidget; // 0x260(0x01)
	char pad_261[0x7]; // 0x261(0x07)
	struct TSoftClassPtr<UObject> ToolTipTextWidgetClass; // 0x268(0x28)
};

// Class WTL.WTLCommonButton
// Size: 0x340 (Inherited: 0x290)
struct UWTLCommonButton : UWTLCommonBase {
	struct UFMODEvent* PressedSoundEvent; // 0x290(0x08)
	struct UFMODEvent* HoveredSoundEvent; // 0x298(0x08)
	char pad_2A0[0x18]; // 0x2a0(0x18)
	struct UButton* btnButton; // 0x2b8(0x08)
	char pad_2C0[0x78]; // 0x2c0(0x78)
	enum class EWTLCommonButtonType CommonButtonType; // 0x338(0x01)
	char pad_339[0x7]; // 0x339(0x07)

	void OnButtonUnhovered(); // Function WTL.WTLCommonButton.OnButtonUnhovered // (Native|Protected) // @ game+0x17c4d60
	void OnButtonReleased(); // Function WTL.WTLCommonButton.OnButtonReleased // (Native|Protected) // @ game+0x17c4da0
	void OnButtonPressed(); // Function WTL.WTLCommonButton.OnButtonPressed // (Native|Protected) // @ game+0x17c4dc0
	void OnButtonHovered(); // Function WTL.WTLCommonButton.OnButtonHovered // (Native|Protected) // @ game+0x17c4d80
	void OnButtonClicked(); // Function WTL.WTLCommonButton.OnButtonClicked // (Native|Protected) // @ game+0x17c4de0
};

// Class WTL.WTLCommonWindowBase
// Size: 0x288 (Inherited: 0x260)
struct UWTLCommonWindowBase : UWTLWidgetBase {
	char pad_260[0x8]; // 0x260(0x08)
	struct UWTLCommonText* ucTitle; // 0x268(0x08)
	struct UWTLCommonButton* ucBtnClose; // 0x270(0x08)
	char pad_278[0x1]; // 0x278(0x01)
	bool bIsAlwaysShowBackgroundBlur; // 0x279(0x01)
	bool bIsUseShowAnimation; // 0x27a(0x01)
	char pad_27B[0x5]; // 0x27b(0x05)
	struct UWidgetAnimation* ShowAnimation; // 0x280(0x08)

	void OnCloseBtnClicked(); // Function WTL.WTLCommonWindowBase.OnCloseBtnClicked // (Native|Protected) // @ game+0x17c4d60
	void Close(); // Function WTL.WTLCommonWindowBase.Close // (Native|Protected) // @ game+0x17d38f0
};

// Class WTL.WTLCommonCharacterPreviewWindow
// Size: 0x298 (Inherited: 0x288)
struct UWTLCommonCharacterPreviewWindow : UWTLCommonWindowBase {
	struct UWTLCommonButton* ucBtnBack; // 0x288(0x08)
	char pad_290[0x8]; // 0x290(0x08)
};

// Class WTL.WTLCommonCharacterRotator
// Size: 0x2c8 (Inherited: 0x260)
struct UWTLCommonCharacterRotator : UUserWidget {
	char pad_260[0x60]; // 0x260(0x60)
	bool bIsMainMenuCharacterRotation; // 0x2c0(0x01)
	char pad_2C1[0x7]; // 0x2c1(0x07)
};

// Class WTL.WTLCommonCheckBox
// Size: 0x2f0 (Inherited: 0x290)
struct UWTLCommonCheckBox : UWTLCommonBase {
	struct UCheckBox* cbCheckBox; // 0x290(0x08)
	struct UFMODEvent* CheckedSoundEvent; // 0x298(0x08)
	struct UFMODEvent* UncheckedSoundEvent; // 0x2a0(0x08)
	struct UFMODEvent* HoveredSoundEvent; // 0x2a8(0x08)
	char pad_2B0[0x38]; // 0x2b0(0x38)
	enum class EWTLCheckBoxType CheckBoxType; // 0x2e8(0x01)
	char pad_2E9[0x7]; // 0x2e9(0x07)

	void OnUnhovered(); // Function WTL.WTLCommonCheckBox.OnUnhovered // (Native|Protected) // @ game+0x17c4da0
	void OnHovered(); // Function WTL.WTLCommonCheckBox.OnHovered // (Native|Protected) // @ game+0x17c4dc0
	void OnCheckBoxStateChanged(bool bIsChecked); // Function WTL.WTLCommonCheckBox.OnCheckBoxStateChanged // (Native|Protected) // @ game+0x17c5280
};

// Class WTL.WTLCommonClickedItem
// Size: 0x2b0 (Inherited: 0x290)
struct UWTLCommonClickedItem : UWTLCommonBase {
	struct UBorder* bBackground; // 0x290(0x08)
	struct UFMODEvent* MouseButtonDownSoundEvent; // 0x298(0x08)
	char pad_2A0[0x8]; // 0x2a0(0x08)
	enum class EWTLCommonClickedItemType CommonClickedItemType; // 0x2a8(0x01)
	char pad_2A9[0x7]; // 0x2a9(0x07)

	void OnBackgroundBorderMouseButtonDown(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function WTL.WTLCommonClickedItem.OnBackgroundBorderMouseButtonDown // (Native|Protected|HasOutParms) // @ game+0x17c5510
};

// Class WTL.WTLCommonColorButton
// Size: 0x2e8 (Inherited: 0x290)
struct UWTLCommonColorButton : UWTLCommonBase {
	struct UBorder* bColor; // 0x290(0x08)
	struct UImage* imgColor; // 0x298(0x08)
	char pad_2A0[0x20]; // 0x2a0(0x20)
	struct UFMODEvent* PressedSoundEvent; // 0x2c0(0x08)
	struct UFMODEvent* HoveredSoundEvent; // 0x2c8(0x08)
	char pad_2D0[0x18]; // 0x2d0(0x18)
};

// Class WTL.WTLCommonColorPicker
// Size: 0x2d0 (Inherited: 0x260)
struct UWTLCommonColorPicker : UUserWidget {
	struct UBorder* bBackground; // 0x260(0x08)
	struct UWTLUtilityColorPicker* ucColorPicker; // 0x268(0x08)
	struct UBorder* bButtons; // 0x270(0x08)
	struct UWTLCommonButton* ucBtnOK; // 0x278(0x08)
	struct UWTLCommonButton* ucBtnCancel; // 0x280(0x08)
	char pad_288[0x48]; // 0x288(0x48)

	void OnOKBtnClicked(); // Function WTL.WTLCommonColorPicker.OnOKBtnClicked // (Final|Native|Private) // @ game+0x17c5af0
	void OnColorPickedColorChanged(struct FLinearColor& ChangedColor); // Function WTL.WTLCommonColorPicker.OnColorPickedColorChanged // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x17c5b20
	void OnCancelBtnClicked(); // Function WTL.WTLCommonColorPicker.OnCancelBtnClicked // (Final|Native|Private) // @ game+0x17c5ac0
};

// Class WTL.WTLCommonColorPresetItem
// Size: 0x380 (Inherited: 0x340)
struct UWTLCommonColorPresetItem : UWTLCommonButton {
	char pad_340[0x40]; // 0x340(0x40)
};

// Class WTL.WTLCommonColorPresets
// Size: 0x310 (Inherited: 0x260)
struct UWTLCommonColorPresets : UUserWidget {
	struct UBorder* bMain; // 0x260(0x08)
	struct UWrapBox* wbPresets; // 0x268(0x08)
	char pad_270[0x28]; // 0x270(0x28)
	struct TSoftClassPtr<UObject> ColorPresetItemWidgetClass; // 0x298(0x28)
	char pad_2C0[0x50]; // 0x2c0(0x50)

	void OnColorPresetItemClicked(int32_t Number, struct FLinearColor PresetColor, struct FLinearColor PreviewColor); // Function WTL.WTLCommonColorPresets.OnColorPresetItemClicked // (Final|Native|Private|HasDefaults) // @ game+0x17c5ea0
};

// Class WTL.WTLCommonComboBoxString
// Size: 0x338 (Inherited: 0x290)
struct UWTLCommonComboBoxString : UWTLCommonBase {
	struct UComboBoxString* cbsComboBoxString; // 0x290(0x08)
	char pad_298[0x8]; // 0x298(0x08)
	struct UFMODEvent* PressedSoundEvent; // 0x2a0(0x08)
	struct UFMODEvent* SelectionChangeSoundEvent; // 0x2a8(0x08)
	char pad_2B0[0x28]; // 0x2b0(0x28)
	enum class EWTLComboBoxStringType ComboBoxStringType; // 0x2d8(0x01)
	char pad_2D9[0x7]; // 0x2d9(0x07)
	struct FSlateFontInfo ComboBoxStringFont; // 0x2e0(0x58)

	void OnSelectionChangedEvent(struct FString SelectedItem, enum class ESelectInfo SelectionType); // Function WTL.WTLCommonComboBoxString.OnSelectionChangedEvent // (Final|Native|Private) // @ game+0x17c6380
	void OnOpeningEvent(); // Function WTL.WTLCommonComboBoxString.OnOpeningEvent // (Final|Native|Private) // @ game+0x17c6360
};

// Class WTL.WTLCommonMessageDialog
// Size: 0x310 (Inherited: 0x260)
struct UWTLCommonMessageDialog : UUserWidget {
	struct UWTLRichTextBlock* rtbMain; // 0x260(0x08)
	char pad_268[0x20]; // 0x268(0x20)
	struct UBorder* bMessageBorder; // 0x288(0x08)
	struct UHorizontalBox* hbButtonsBox; // 0x290(0x08)
	struct TSoftClassPtr<UObject> ButtonWidgetClass; // 0x298(0x28)
	struct UWidgetAnimation* ShowAnimation; // 0x2c0(0x08)
	struct TSoftObjectPtr<UFMODEvent> ShowSoundEvent; // 0x2c8(0x28)
	char pad_2F0[0x20]; // 0x2f0(0x20)

	void OnDialogBtnClicked(bool IsBoundAnyLogic); // Function WTL.WTLCommonMessageDialog.OnDialogBtnClicked // (Final|Native|Private) // @ game+0x17c9680
	void Hide(); // Function WTL.WTLCommonMessageDialog.Hide // (Final|Native|Public) // @ game+0x17c9660
};

// Class WTL.WTLCommonConfirmationDialog
// Size: 0x398 (Inherited: 0x310)
struct UWTLCommonConfirmationDialog : UWTLCommonMessageDialog {
	struct UImage* imgConfirmationType; // 0x310(0x08)
	struct UWidget* m_YesButtonWidget; // 0x318(0x08)
	char pad_320[0x8]; // 0x320(0x08)
	struct TMap<enum class EWTLConfirmationType, struct TSoftObjectPtr<UTexture2D>> ConfirmationTypesTextures; // 0x328(0x50)
	struct FLinearColor OrangeBrushColor; // 0x378(0x10)
	struct FLinearColor RedBrushColor; // 0x388(0x10)
};

// Class WTL.WTLCommonCoreHackingWindow
// Size: 0x2e0 (Inherited: 0x288)
struct UWTLCommonCoreHackingWindow : UWTLCommonWindowBase {
	struct AWTLCoreHackingPreviewRoom* m_Preview; // 0x288(0x08)
	struct UImage* imgPreview; // 0x290(0x08)
	char pad_298[0x8]; // 0x298(0x08)
	struct TSoftClassPtr<UObject> CoreHackingPreviewRoomClass; // 0x2a0(0x28)
	char pad_2C8[0x18]; // 0x2c8(0x18)

	void OnCoreCaptured(); // Function WTL.WTLCommonCoreHackingWindow.OnCoreCaptured // (Final|Native|Public) // @ game+0xe77850
	void OnCharacterDied(); // Function WTL.WTLCommonCoreHackingWindow.OnCharacterDied // (Final|Native|Protected) // @ game+0x17c67d0
	void OnCaptureEnded(); // Function WTL.WTLCommonCoreHackingWindow.OnCaptureEnded // (Final|Native|Protected) // @ game+0x17c67d0
};

// Class WTL.WTLCommonCountdownSlider
// Size: 0x2a0 (Inherited: 0x260)
struct UWTLCommonCountdownSlider : UUserWidget {
	struct UImage* imgCountdownSlider; // 0x260(0x08)
	char pad_268[0x30]; // 0x268(0x30)
	enum class EWTLCountdownSliderWidgetFillingType FillingType; // 0x298(0x01)
	char pad_299[0x3]; // 0x299(0x03)
	float CircleThickness; // 0x29c(0x04)
};

// Class WTL.WTLCommonCountdownWindow
// Size: 0x310 (Inherited: 0x260)
struct UWTLCommonCountdownWindow : UWTLWidgetBase {
	struct UBackgroundBlur* bBackgroundBlur; // 0x260(0x08)
	struct UWTLRichTextBlock* rtbCountDownTitle; // 0x268(0x08)
	struct UWTLCommonCountdownSlider* ucCountdownSlider; // 0x270(0x08)
	struct UTextBlock* tbCountDown; // 0x278(0x08)
	struct UWTLCommonHotkeyButton* ucBtnCancel; // 0x280(0x08)
	char pad_288[0x38]; // 0x288(0x38)
	struct FText CountdownTitleText; // 0x2c0(0x18)
	int32_t Timeout; // 0x2d8(0x04)
	bool bIsBlockCancelButton; // 0x2dc(0x01)
	char pad_2DD[0x3]; // 0x2dd(0x03)
	struct FWTLUFunctionInfo CancelActionFunctionInfo; // 0x2e0(0x18)
	struct FWTLUFunctionInfo CountdownActionFunctionInfo; // 0x2f8(0x18)

	void UpdateCountdown(); // Function WTL.WTLCommonCountdownWindow.UpdateCountdown // (Final|Native|Private) // @ game+0x17c6a20
	void UpdateBlockCancelButton(); // Function WTL.WTLCommonCountdownWindow.UpdateBlockCancelButton // (Final|Native|Private) // @ game+0x17c6a00
	void OnCancelBtnClick(); // Function WTL.WTLCommonCountdownWindow.OnCancelBtnClick // (Final|Native|Private) // @ game+0x17c6a40
};

// Class WTL.WTLCommonCreditsAmount
// Size: 0x2e8 (Inherited: 0x290)
struct UWTLCommonCreditsAmount : UWTLCommonBase {
	struct UTextBlock* tbCreditsAmount; // 0x290(0x08)
	struct UTextBlock* tbCreditsAmountDelta; // 0x298(0x08)
	char pad_2A0[0x10]; // 0x2a0(0x10)
	struct UWidgetAnimation* CreditsTopUpAnimation; // 0x2b0(0x08)
	struct TSoftObjectPtr<UFMODEvent> BalanceIncreasedSoundEvent; // 0x2b8(0x28)
	bool bIsSilentMode; // 0x2e0(0x01)
	char pad_2E1[0x7]; // 0x2e1(0x07)

	void OnAccountBalanceIncreased(int32_t Delta, int32_t CurrentBalance); // Function WTL.WTLCommonCreditsAmount.OnAccountBalanceIncreased // (Final|Native|Private) // @ game+0x17c6c90
	void OnAccountBalanceChanged(int32_t Balance); // Function WTL.WTLCommonCreditsAmount.OnAccountBalanceChanged // (Final|Native|Private) // @ game+0x17c6df0
};

// Class WTL.WTLCommonCreditsAmountWithTopUp
// Size: 0x268 (Inherited: 0x260)
struct UWTLCommonCreditsAmountWithTopUp : UUserWidget {
	struct UWTLCommonCreditsAmount* ucCreditsAmount; // 0x260(0x08)
};

// Class WTL.WTLItemManipulationWidget
// Size: 0x280 (Inherited: 0x260)
struct UWTLItemManipulationWidget : UUserWidget {
	struct UImage* imgPreview; // 0x260(0x08)
	struct AActor* m_ManipulatedItem; // 0x268(0x08)
	char pad_270[0x10]; // 0x270(0x10)
};

// Class WTL.WTLCommonDeminingWindow
// Size: 0x2b0 (Inherited: 0x280)
struct UWTLCommonDeminingWindow : UWTLItemManipulationWidget {
	char pad_280[0x10]; // 0x280(0x10)
	struct URichTextBlock* rtbHintText; // 0x290(0x08)
	struct UImage* imgScissors; // 0x298(0x08)
	char pad_2A0[0x10]; // 0x2a0(0x10)

	void OnShowOrHideScissors(bool Value); // Function WTL.WTLCommonDeminingWindow.OnShowOrHideScissors // (Final|Native|Protected) // @ game+0x17c71a0
	void OnDemined(); // Function WTL.WTLCommonDeminingWindow.OnDemined // (Final|Native|Protected) // @ game+0x17c7280
	void OnCharacterDied(); // Function WTL.WTLCommonDeminingWindow.OnCharacterDied // (Final|Native|Protected) // @ game+0x17c72a0
};

// Class WTL.WTLCommonFormattedTextBlock
// Size: 0xab8 (Inherited: 0xa38)
struct UWTLCommonFormattedTextBlock : UEditableTextBox {
	int32_t BlocksCount; // 0xa38(0x04)
	int32_t CharsInBlockCount; // 0xa3c(0x04)
	struct FString EmptyChar; // 0xa40(0x10)
	struct FString Iterator; // 0xa50(0x10)
	char pad_A60[0x58]; // 0xa60(0x58)
};

// Class WTL.WTLCommonTextButton
// Size: 0x3f8 (Inherited: 0x340)
struct UWTLCommonTextButton : UWTLCommonButton {
	struct UTextBlock* tbButton; // 0x340(0x08)
	struct FText Text; // 0x348(0x18)
	enum class EWTLButtonText ButtonText; // 0x360(0x01)
	bool bUseTextFont; // 0x361(0x01)
	char pad_362[0x6]; // 0x362(0x06)
	struct FSlateFontInfo TextFont; // 0x368(0x58)
	bool bUseTextFontSize; // 0x3c0(0x01)
	char pad_3C1[0x3]; // 0x3c1(0x03)
	int32_t TextFontSize; // 0x3c4(0x04)
	bool bCapitalizeText; // 0x3c8(0x01)
	char pad_3C9[0x7]; // 0x3c9(0x07)
	struct FSlateColor TextColor; // 0x3d0(0x28)
};

// Class WTL.WTLCommonHotkeyButton
// Size: 0x420 (Inherited: 0x3f8)
struct UWTLCommonHotkeyButton : UWTLCommonTextButton {
	char pad_3F8[0x10]; // 0x3f8(0x10)
	struct FKey Key; // 0x408(0x18)
};

// Class WTL.WTLCommonHoveredItem
// Size: 0x400 (Inherited: 0x2b0)
struct UWTLCommonHoveredItem : UWTLCommonClickedItem {
	char pad_2B0[0x8]; // 0x2b0(0x08)
	struct UFMODEvent* HoveredSoundEvent; // 0x2b8(0x08)
	char pad_2C0[0x9]; // 0x2c0(0x09)
	bool bUseBrushes; // 0x2c9(0x01)
	char pad_2CA[0x6]; // 0x2ca(0x06)
	struct FSlateBrush DefaultBorderBrush; // 0x2d0(0x88)
	struct FSlateBrush HoveredBorderBrush; // 0x358(0x88)
	struct FLinearColor DefaultBorderBrushColor; // 0x3e0(0x10)
	struct FLinearColor HoveredBorderBrushColor; // 0x3f0(0x10)
};

// Class WTL.WTLCommonImageButton
// Size: 0x348 (Inherited: 0x340)
struct UWTLCommonImageButton : UWTLCommonButton {
	struct UImage* imgButton; // 0x340(0x08)
};

// Class WTL.WTLCommonItemInformation
// Size: 0x780 (Inherited: 0x260)
struct UWTLCommonItemInformation : UUserWidget {
	struct UTextBlock* tbName; // 0x260(0x08)
	struct UTextBlock* tbCustomName; // 0x268(0x08)
	struct UTextBlock* tbItemType; // 0x270(0x08)
	struct UTextBlock* tbItemSubType; // 0x278(0x08)
	struct UTextBlock* tbSuitableForClass; // 0x280(0x08)
	struct UTextBlock* tbNotSuitableForClass; // 0x288(0x08)
	struct UHorizontalBox* hbCount; // 0x290(0x08)
	struct UHorizontalBox* hbItemTypeID; // 0x298(0x08)
	struct UTextBlock* tbItemTypeID; // 0x2a0(0x08)
	struct UTextBlock* tbCount; // 0x2a8(0x08)
	struct UVerticalBox* vbRequirements; // 0x2b0(0x08)
	struct UVerticalBox* vbParameters; // 0x2b8(0x08)
	struct UHorizontalBox* hbCharacterFaction; // 0x2c0(0x08)
	struct UHorizontalBox* hbCharacterClass; // 0x2c8(0x08)
	struct UHorizontalBox* hbCharacterLevel; // 0x2d0(0x08)
	struct UHorizontalBox* hbCharacterStrength; // 0x2d8(0x08)
	struct UHorizontalBox* hbCharacterDexterity; // 0x2e0(0x08)
	struct UHorizontalBox* hbCharacterStamina; // 0x2e8(0x08)
	struct UHorizontalBox* hbCharacterAccuracy; // 0x2f0(0x08)
	struct UHorizontalBox* hbCharacterIntelligence; // 0x2f8(0x08)
	struct UHorizontalBox* hbCharacterFortune; // 0x300(0x08)
	struct UHorizontalBox* hbCaliber; // 0x308(0x08)
	struct UHorizontalBox* hbDamage; // 0x310(0x08)
	struct UHorizontalBox* hbArmorPiercing; // 0x318(0x08)
	struct UHorizontalBox* hbCriticalHitChanceMultiplier; // 0x320(0x08)
	struct UHorizontalBox* hbMagazine; // 0x328(0x08)
	struct UHorizontalBox* hbAccuracy; // 0x330(0x08)
	struct UHorizontalBox* hbEffectiveRange; // 0x338(0x08)
	struct UHorizontalBox* hbArmorClass; // 0x340(0x08)
	struct UHorizontalBox* hbArmor; // 0x348(0x08)
	struct UHorizontalBox* hbFrontArmor; // 0x350(0x08)
	struct UHorizontalBox* hbBackArmor; // 0x358(0x08)
	struct UHorizontalBox* hbCoverArms; // 0x360(0x08)
	struct UHorizontalBox* hbArmoredPlatesSlotsCount; // 0x368(0x08)
	struct UHorizontalBox* hbWearResistance; // 0x370(0x08)
	struct UPanelWidget* pwMedicineEffects; // 0x378(0x08)
	struct UPanelWidget* pwFoodEffects; // 0x380(0x08)
	struct UPanelWidget* pwCharacterEffectsInfluence; // 0x388(0x08)
	struct UVerticalBox* vbEffectsOfModification; // 0x390(0x08)
	struct UHorizontalBox* hbWeight; // 0x398(0x08)
	struct UHorizontalBox* hbTotalWeight; // 0x3a0(0x08)
	struct UHorizontalBox* hbBasePrice; // 0x3a8(0x08)
	struct UHorizontalBox* hbTotalBasePrice; // 0x3b0(0x08)
	struct UHorizontalBox* hbCondition; // 0x3b8(0x08)
	struct UHorizontalBox* hbDropChance; // 0x3c0(0x08)
	struct UHorizontalBox* hbDescription; // 0x3c8(0x08)
	struct UTextBlock* tbCharacterFactionCaption; // 0x3d0(0x08)
	struct UTextBlock* tbCharacterClassCaption; // 0x3d8(0x08)
	struct UTextBlock* tbCharacterLevelCaption; // 0x3e0(0x08)
	struct UTextBlock* tbCharacterStrengthCaption; // 0x3e8(0x08)
	struct UTextBlock* tbCharacterDexterityCaption; // 0x3f0(0x08)
	struct UTextBlock* tbCharacterStaminaCaption; // 0x3f8(0x08)
	struct UTextBlock* tbCharacterAccuracyCaption; // 0x400(0x08)
	struct UTextBlock* tbCharacterIntelligenceCaption; // 0x408(0x08)
	struct UTextBlock* tbCharacterFortuneCaption; // 0x410(0x08)
	struct UTextBlock* tbPDAModuleAlreadyInstalled; // 0x418(0x08)
	struct URichTextBlock* rtbAttach; // 0x420(0x08)
	struct UHorizontalBox* hbSilencerDamageMult; // 0x428(0x08)
	struct UTextBlock* tbSilencerDamageMult; // 0x430(0x08)
	struct UWTLCommonToggleSwitcher* SilencerDamageArrow; // 0x438(0x08)
	struct UHorizontalBox* hbSilencerSpreadMult; // 0x440(0x08)
	struct UTextBlock* tbSilencerSpreadMult; // 0x448(0x08)
	struct UWTLCommonToggleSwitcher* SilencerSpreadArrow; // 0x450(0x08)
	struct URichTextBlock* rtbSprayCanModification; // 0x458(0x08)
	struct URichTextBlock* rtbSprayCanModificationList; // 0x460(0x08)
	struct URichTextBlock* rtbArmoredPlates; // 0x468(0x08)
	struct UTextBlock* tbRepairHint; // 0x470(0x08)
	struct UTextBlock* tbCannotUseItemCaption; // 0x478(0x08)
	struct UTextBlock* tbCharacterFaction; // 0x480(0x08)
	struct UTextBlock* tbCharacterClass; // 0x488(0x08)
	struct UTextBlock* tbCharacterLevel; // 0x490(0x08)
	struct UTextBlock* tbCharacterStrength; // 0x498(0x08)
	struct UTextBlock* tbCharacterDexterity; // 0x4a0(0x08)
	struct UTextBlock* tbCharacterStamina; // 0x4a8(0x08)
	struct UTextBlock* tbCharacterAccuracy; // 0x4b0(0x08)
	struct UTextBlock* tbCharacterIntelligence; // 0x4b8(0x08)
	struct UTextBlock* tbCharacterFortune; // 0x4c0(0x08)
	struct UTextBlock* tbCaliber; // 0x4c8(0x08)
	struct UTextBlock* tbPvPDamage; // 0x4d0(0x08)
	struct UTextBlock* tbPvEDamage; // 0x4d8(0x08)
	struct UTextBlock* tbPvPArmorPiercing; // 0x4e0(0x08)
	struct UTextBlock* tbPvEArmorPiercing; // 0x4e8(0x08)
	struct UTextBlock* tbCriticalHitChanceMultiplier; // 0x4f0(0x08)
	struct UTextBlock* tbMagazine; // 0x4f8(0x08)
	struct UTextBlock* tbAccuracy; // 0x500(0x08)
	struct UProgressBar* pbAccuracy; // 0x508(0x08)
	struct UTextBlock* tbEffectiveRange; // 0x510(0x08)
	struct UTextBlock* tbArmorClass; // 0x518(0x08)
	struct UTextBlock* tbArmor; // 0x520(0x08)
	struct UTextBlock* tbMonsterArmor; // 0x528(0x08)
	struct UTextBlock* tbFrontArmor; // 0x530(0x08)
	struct UTextBlock* tbFrontMonsterArmor; // 0x538(0x08)
	struct UTextBlock* tbBackArmor; // 0x540(0x08)
	struct UTextBlock* tbBackMonsterArmor; // 0x548(0x08)
	struct UTextBlock* tbCoverArmsValue; // 0x550(0x08)
	struct UTextBlock* tbArmoredPlatesSlotsCount; // 0x558(0x08)
	struct UProgressBar* pbWearResistance; // 0x560(0x08)
	struct UPanelWidget* pwMedicineEffectsBox; // 0x568(0x08)
	struct UPanelWidget* pwFoodEffectsBox; // 0x570(0x08)
	struct UPanelWidget* pwCharacterEffectsInfluenceBox; // 0x578(0x08)
	struct UVerticalBox* vbEffectsOfModificationBox; // 0x580(0x08)
	struct UTextBlock* tbWeight; // 0x588(0x08)
	struct UTextBlock* tbTotalWeight; // 0x590(0x08)
	struct UTextBlock* tbBasePrice; // 0x598(0x08)
	struct UTextBlock* tbTotalBasePrice; // 0x5a0(0x08)
	struct UTextBlock* tbCondition; // 0x5a8(0x08)
	struct UTextBlock* tbDropChance; // 0x5b0(0x08)
	struct UTextBlock* tbDescription; // 0x5b8(0x08)
	struct UHorizontalBox* hbHungerFoodEffect; // 0x5c0(0x08)
	struct UHorizontalBox* hbThirstFoodEffect; // 0x5c8(0x08)
	struct UHorizontalBox* hbHealthFoodEffect; // 0x5d0(0x08)
	struct UHorizontalBox* hbStaminaFoodEffect; // 0x5d8(0x08)
	struct UHorizontalBox* hbAlcoholFoodEffect; // 0x5e0(0x08)
	struct UHorizontalBox* hbPoisonFoodEffect; // 0x5e8(0x08)
	struct UHorizontalBox* hbRadiationFoodEffect; // 0x5f0(0x08)
	struct UHorizontalBox* hbBleedingFoodEffect; // 0x5f8(0x08)
	struct UHorizontalBox* hbWoundedFoodEffect; // 0x600(0x08)
	struct UTextBlock* tbHungerFoodEffect; // 0x608(0x08)
	struct UTextBlock* tbThirstFoodEffect; // 0x610(0x08)
	struct UTextBlock* tbHealthFoodEffect; // 0x618(0x08)
	struct UTextBlock* tbStaminaFoodEffect; // 0x620(0x08)
	struct UTextBlock* tbAlcoholFoodEffect; // 0x628(0x08)
	struct UTextBlock* tbPoisonFoodEffect; // 0x630(0x08)
	struct UTextBlock* tbRadiationFoodEffect; // 0x638(0x08)
	struct UTextBlock* tbBleedingFoodEffect; // 0x640(0x08)
	struct UTextBlock* tbWoundedFoodEffect; // 0x648(0x08)
	struct UHorizontalBox* hbDamageModificationEffect; // 0x650(0x08)
	struct UHorizontalBox* hbAccuracyModificationEffect; // 0x658(0x08)
	struct UHorizontalBox* hbArmorModificationEffect; // 0x660(0x08)
	struct UHorizontalBox* hbWeightModificationEffect; // 0x668(0x08)
	struct UHorizontalBox* hbWearResistanceModificationEffect; // 0x670(0x08)
	struct UWTLHUDItemsModificationPercentDelta* ucDamageModificationPercentDeltaMin; // 0x678(0x08)
	struct UWTLHUDItemsModificationPercentDelta* ucDamageModificationPercentDeltaMax; // 0x680(0x08)
	struct UWTLHUDItemsModificationPercentDelta* ucAccuracyModificationPercentDeltaMin; // 0x688(0x08)
	struct UWTLHUDItemsModificationPercentDelta* ucAccuracyModificationPercentDeltaMax; // 0x690(0x08)
	struct UWTLHUDItemsModificationPercentDelta* ucArmorModificationPercentDeltaMin; // 0x698(0x08)
	struct UWTLHUDItemsModificationPercentDelta* ucArmorModificationPercentDeltaMax; // 0x6a0(0x08)
	struct UWTLHUDItemsModificationPercentDelta* ucWeightModificationPercentDeltaMin; // 0x6a8(0x08)
	struct UWTLHUDItemsModificationPercentDelta* ucWeightModificationPercentDeltaMax; // 0x6b0(0x08)
	struct UWTLHUDItemsModificationPercentDelta* ucWearResistanceModificationPercentDeltaMin; // 0x6b8(0x08)
	struct UWTLHUDItemsModificationPercentDelta* ucWearResistanceModificationPercentDeltaMax; // 0x6c0(0x08)
	char pad_6C8[0x8]; // 0x6c8(0x08)
	struct TSoftClassPtr<UObject> MedicineEffectWidgetClass; // 0x6d0(0x28)
	struct TSoftClassPtr<UObject> EffectInfluenceWidgetClass; // 0x6f8(0x28)
	struct FMargin ParametersVerticalBoxOriginalPadding; // 0x720(0x10)
	struct FLinearColor CustomNameTextColor; // 0x730(0x10)
	struct FLinearColor LowAccuracyBarFillColor; // 0x740(0x10)
	struct FLinearColor LowMiddleAccuracyBarFillColor; // 0x750(0x10)
	struct FLinearColor HighMiddleAccuracyBarFillColor; // 0x760(0x10)
	struct FLinearColor HighAccuracyBarFillColor; // 0x770(0x10)
};

// Class WTL.WTLCommonItemInformationWindow
// Size: 0x298 (Inherited: 0x288)
struct UWTLCommonItemInformationWindow : UWTLCommonWindowBase {
	struct UWTLCommonButton* ucBtnOK; // 0x288(0x08)
	struct UWTLCommonItemInformation* ucItemInformation; // 0x290(0x08)
};

// Class WTL.WTLCommonItemPreview
// Size: 0x818 (Inherited: 0x260)
struct UWTLCommonItemPreview : UWTLWidgetBase {
	struct UBorder* bItemPreview; // 0x260(0x08)
	struct UImage* imgItemPreview; // 0x268(0x08)
	struct UWTLOptionsParameterSwitcher* psPreviewMesh; // 0x270(0x08)
	struct UButton* btnAutoRotateLeft; // 0x278(0x08)
	struct UButton* btnAutoRotateRight; // 0x280(0x08)
	struct UButton* btnRotateTop; // 0x288(0x08)
	struct UButton* btnRotateDown; // 0x290(0x08)
	struct UButton* btnRotateLeft; // 0x298(0x08)
	struct UButton* btnRotateRight; // 0x2a0(0x08)
	struct UButton* btnZoomIn; // 0x2a8(0x08)
	struct UButton* btnZoomOut; // 0x2b0(0x08)
	struct UButton* btnReset; // 0x2b8(0x08)
	char pad_2C0[0x18]; // 0x2c0(0x18)
	struct FButtonStyle NormalButtonStyle; // 0x2d8(0x278)
	struct FButtonStyle ClickedButtonStyle; // 0x550(0x278)
	struct TSoftObjectPtr<UMaterialInterface> SquareMI; // 0x7c8(0x28)
	struct TSoftObjectPtr<UMaterialInterface> LandscapeMI; // 0x7f0(0x28)

	void UpdateAutoRotate(); // Function WTL.WTLCommonItemPreview.UpdateAutoRotate // (Final|Native|Private) // @ game+0x17c8b90
	void OnZoomOutBtnClicked(); // Function WTL.WTLCommonItemPreview.OnZoomOutBtnClicked // (Final|Native|Private) // @ game+0x17c8c10
	void OnZoomInBtnClicked(); // Function WTL.WTLCommonItemPreview.OnZoomInBtnClicked // (Final|Native|Private) // @ game+0x17c8c30
	void OnRotateTopBtnClicked(); // Function WTL.WTLCommonItemPreview.OnRotateTopBtnClicked // (Final|Native|Private) // @ game+0x17c8cb0
	void OnRotateRightBtnClicked(); // Function WTL.WTLCommonItemPreview.OnRotateRightBtnClicked // (Final|Native|Private) // @ game+0x17c8c50
	void OnRotateLeftBtnClicked(); // Function WTL.WTLCommonItemPreview.OnRotateLeftBtnClicked // (Final|Native|Private) // @ game+0x17c8c70
	void OnRotateDownBtnClicked(); // Function WTL.WTLCommonItemPreview.OnRotateDownBtnClicked // (Final|Native|Private) // @ game+0x17c8c90
	void OnResetBtnClicked(); // Function WTL.WTLCommonItemPreview.OnResetBtnClicked // (Final|Native|Private) // @ game+0x17c8bb0
	void OnPreviewMeshSwitcherValueChanged(int32_t CurrentIndex, struct FString Prefix); // Function WTL.WTLCommonItemPreview.OnPreviewMeshSwitcherValueChanged // (Final|Native|Private) // @ game+0x17c8d10
	struct FEventReply OnItemPreviewBorderMouseButtonDown(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function WTL.WTLCommonItemPreview.OnItemPreviewBorderMouseButtonDown // (Final|Native|Private|HasOutParms) // @ game+0x17c8ed0
	void OnAutoRotateRightBtnClicked(); // Function WTL.WTLCommonItemPreview.OnAutoRotateRightBtnClicked // (Final|Native|Private) // @ game+0x17c8cd0
	void OnAutoRotateLeftBtnClicked(); // Function WTL.WTLCommonItemPreview.OnAutoRotateLeftBtnClicked // (Final|Native|Private) // @ game+0x17c8cf0
};

// Class WTL.WTLCommonItemPreviewWindow
// Size: 0x298 (Inherited: 0x288)
struct UWTLCommonItemPreviewWindow : UWTLCommonWindowBase {
	struct UWTLCommonItemPreview* ucItemPreview; // 0x288(0x08)
	struct UWTLCommonButton* ucBtnBack; // 0x290(0x08)
};

// Class WTL.WTLCommonMapMarker
// Size: 0x318 (Inherited: 0x260)
struct UWTLCommonMapMarker : UUserWidget {
	struct UImage* imgMarkerType; // 0x260(0x08)
	struct UTextBlock* tbMarkerName; // 0x268(0x08)
	struct UTextBlock* tbMarkerTime; // 0x270(0x08)
	struct UWTLCommonMapMarkerToolTipText* m_MapMarkerToolTipTextWidget; // 0x278(0x08)
	char pad_280[0x70]; // 0x280(0x70)
	struct TSoftClassPtr<UObject> MapMarkerToolTipTextWidgetClass; // 0x2f0(0x28)
};

// Class WTL.WTLCommonMapMarkerToolTipText
// Size: 0x268 (Inherited: 0x260)
struct UWTLCommonMapMarkerToolTipText : UUserWidget {
	struct UTextBlock* tbToolTip; // 0x260(0x08)
};

// Class WTL.WTLCommonMessageDialogButton
// Size: 0x448 (Inherited: 0x420)
struct UWTLCommonMessageDialogButton : UWTLCommonHotkeyButton {
	char pad_420[0x28]; // 0x420(0x28)
};

// Class WTL.WTLCommonSelectedItem
// Size: 0x4a0 (Inherited: 0x400)
struct UWTLCommonSelectedItem : UWTLCommonHoveredItem {
	char pad_400[0x8]; // 0x400(0x08)
	struct FSlateBrush SelectedBorderBrush; // 0x408(0x88)
	struct FLinearColor SelectedBorderBrushColor; // 0x490(0x10)
};

// Class WTL.WTLCommonMicrotransactionItem
// Size: 0x570 (Inherited: 0x4a0)
struct UWTLCommonMicrotransactionItem : UWTLCommonSelectedItem {
	struct UImage* imgItem; // 0x4a0(0x08)
	struct UTextBlock* tbName; // 0x4a8(0x08)
	struct UTextBlock* tbPrice; // 0x4b0(0x08)
	struct UImage* imgCredits; // 0x4b8(0x08)
	struct UBorder* bDiscount; // 0x4c0(0x08)
	struct UWidgetSwitcher* wsDiscount; // 0x4c8(0x08)
	struct UTextBlock* tbDiscount; // 0x4d0(0x08)
	struct UTextBlock* tbCreditsDiscount; // 0x4d8(0x08)
	struct UBorder* bPremiumDiscountPercent; // 0x4e0(0x08)
	struct UTextBlock* tbPremiumDiscountPercent; // 0x4e8(0x08)
	struct UBackgroundBlur* bBlock; // 0x4f0(0x08)
	char pad_4F8[0x50]; // 0x4f8(0x50)
	struct FSlateColor NotEnoughCreditsColor; // 0x548(0x28)
};

// Class WTL.WTLCommonMicrotransactionWindow
// Size: 0x338 (Inherited: 0x288)
struct UWTLCommonMicrotransactionWindow : UWTLCommonWindowBase {
	struct UWTLCommonURLButton* btnPremiumBonuses; // 0x288(0x08)
	struct UHorizontalBox* hbMicrotransactionItems; // 0x290(0x08)
	struct URichTextBlock* rtbCreditsPurchaseTooltip; // 0x298(0x08)
	struct UHorizontalBox* hbPurchasingIssues; // 0x2a0(0x08)
	struct UWTLCommonURLButton* btnPurchasingIssues; // 0x2a8(0x08)
	char pad_2B0[0x20]; // 0x2b0(0x20)
	struct TSoftClassPtr<UObject> MicrotransactionItemWidgetClass; // 0x2d0(0x28)
	struct TArray<struct FWTLCreditsItemData> CreditsData; // 0x2f8(0x10)
	struct TArray<struct FWTLPremiumItemData> PremiumData; // 0x308(0x10)
	struct FString SteamPurchasingIssuesURL; // 0x318(0x10)
	struct FString MailruPurchasingIssuesURL; // 0x328(0x10)

	void OnPremiumBonusesButtonClicked(); // Function WTL.WTLCommonMicrotransactionWindow.OnPremiumBonusesButtonClicked // (Final|Native|Private) // @ game+0x17c9c60
	void OnBuyPremiumResult(bool Success); // Function WTL.WTLCommonMicrotransactionWindow.OnBuyPremiumResult // (Final|Native|Private) // @ game+0x17c9c80
	void OnBuyPremiumConfirmed(); // Function WTL.WTLCommonMicrotransactionWindow.OnBuyPremiumConfirmed // (Final|Native|Private) // @ game+0x17c9d60
	void OnBuyPremium(int32_t PremiumDaysCount, int32_t Price); // Function WTL.WTLCommonMicrotransactionWindow.OnBuyPremium // (Final|Native|Private) // @ game+0x17c9d80
	void OnBuyCredits(uint64_t StoreItemID); // Function WTL.WTLCommonMicrotransactionWindow.OnBuyCredits // (Final|Native|Private) // @ game+0x17c9ee0
};

// Class WTL.WTLCommonNotificationItem
// Size: 0x280 (Inherited: 0x260)
struct UWTLCommonNotificationItem : UUserWidget {
	struct UTextBlock* tbNotificationMessage; // 0x260(0x08)
	char pad_268[0x18]; // 0x268(0x18)
};

// Class WTL.WTLCommonNotificator
// Size: 0x2a8 (Inherited: 0x260)
struct UWTLCommonNotificator : UUserWidget {
	struct UBorder* bNotificationsList; // 0x260(0x08)
	struct UScrollBox* sbNotificationsList; // 0x268(0x08)
	char pad_270[0x8]; // 0x270(0x08)
	struct TSoftClassPtr<UObject> NotificationItemWidgetClass; // 0x278(0x28)
	float ChildHeight; // 0x2a0(0x04)
	char pad_2A4[0x4]; // 0x2a4(0x04)

	void OnChildsCountChange(); // Function WTL.WTLCommonNotificator.OnChildsCountChange // (Final|Native|Protected) // @ game+0x17ca210
};

// Class WTL.WTLCommonOptions
// Size: 0x3e8 (Inherited: 0x260)
struct UWTLCommonOptions : UUserWidget {
	char pad_260[0x38]; // 0x260(0x38)
	struct UCanvasPanel* cpMain; // 0x298(0x08)
	struct UBackgroundBlur* bBackgroundBlur; // 0x2a0(0x08)
	struct UHorizontalBox* hbTabController; // 0x2a8(0x08)
	struct UHorizontalBox* hbOptionsBtns; // 0x2b0(0x08)
	struct UBorder* bBackground; // 0x2b8(0x08)
	struct UWidgetSwitcher* wsOptions; // 0x2c0(0x08)
	struct UWTLOptionsGame* ucOptionsGame; // 0x2c8(0x08)
	struct UWTLOptionsGraphic* ucOptionsGraphic; // 0x2d0(0x08)
	struct UWTLOptionsPostProcess* ucOptionsPostProcess; // 0x2d8(0x08)
	struct UWTLOptionsAudio* ucOptionsAudio; // 0x2e0(0x08)
	struct UWTLOptionsControl* ucOptionsControl; // 0x2e8(0x08)
	struct UWTLOptionsInterface* ucOptionsInterface; // 0x2f0(0x08)
	struct UWTLOptionsIdentification* ucOptionsIdentification; // 0x2f8(0x08)
	struct UWTLOptionsBase* m_CurrentOptionsWidget; // 0x300(0x08)
	struct UWTLCommonMessageDialog* m_MessageDialogWidget; // 0x308(0x08)
	struct UWTLCommonHotkeyButton* ucBtnOK; // 0x310(0x08)
	struct UWTLCommonHotkeyButton* ucBtnCancel; // 0x318(0x08)
	struct UWTLCommonButton* ucBtnApply; // 0x320(0x08)
	struct UWTLCommonButton* ucBtnReset; // 0x328(0x08)
	struct UWTLCommonButton* ucBtnResetAll; // 0x330(0x08)
	struct UWTLCommonColorPicker* m_CrosshairColorPickerWidget; // 0x338(0x08)
	char pad_340[0x30]; // 0x340(0x30)
	struct TSoftClassPtr<UObject> MessageDialogWidgetClass; // 0x370(0x28)
	struct TSoftClassPtr<UObject> TabButtonClass; // 0x398(0x28)
	struct TSoftClassPtr<UObject> CrosshairColorPickerWidgetClass; // 0x3c0(0x28)

	void ShowNextApplySettingsMessage(); // Function WTL.WTLCommonOptions.ShowNextApplySettingsMessage // (Final|Native|Private) // @ game+0x17cac50
	void ResetCurrentSetting(); // Function WTL.WTLCommonOptions.ResetCurrentSetting // (Final|Native|Private) // @ game+0x17ca880
	void ResetAllSettings(); // Function WTL.WTLCommonOptions.ResetAllSettings // (Final|Native|Private) // @ game+0x17ca7c0
	void OnTabBtnClicked(char TabIndex); // Function WTL.WTLCommonOptions.OnTabBtnClicked // (Final|Native|Private) // @ game+0x17cab80
	void OnResetBtnClicked(); // Function WTL.WTLCommonOptions.OnResetBtnClicked // (Final|Native|Private) // @ game+0x17ca970
	void OnResetAllBtnClicked(); // Function WTL.WTLCommonOptions.OnResetAllBtnClicked // (Final|Native|Private) // @ game+0x17ca950
	void OnOkBtnClickedConfirmed(); // Function WTL.WTLCommonOptions.OnOkBtnClickedConfirmed // (Final|Native|Private) // @ game+0x17cab10
	void OnOKBtnClicked(); // Function WTL.WTLCommonOptions.OnOKBtnClicked // (Final|Native|Private) // @ game+0x17cab40
	void OnExperimentalTextureStreamingValueOnOKNotConfirmed(); // Function WTL.WTLCommonOptions.OnExperimentalTextureStreamingValueOnOKNotConfirmed // (Final|Native|Private) // @ game+0x17caa90
	void OnExperimentalTextureStreamingValueOnApplyNotConfirmed(); // Function WTL.WTLCommonOptions.OnExperimentalTextureStreamingValueOnApplyNotConfirmed // (Final|Native|Private) // @ game+0x17ca9b0
	void OnCrosshairColorSelection(struct FLinearColor& CurrentColor, struct FGeometry& Geometry, struct FPointerEvent& InMouseEvent); // Function WTL.WTLCommonOptions.OnCrosshairColorSelection // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x17ca4f0
	void OnCrosshairColorPickingCanceled(); // Function WTL.WTLCommonOptions.OnCrosshairColorPickingCanceled // (Final|Native|Private) // @ game+0x17ca2d0
	void OnCrosshairColorPicked(struct FLinearColor& PickedColor); // Function WTL.WTLCommonOptions.OnCrosshairColorPicked // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x17ca2f0
	void OnCrosshairColorChanged(struct FLinearColor& ChangedColor); // Function WTL.WTLCommonOptions.OnCrosshairColorChanged // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x17ca3d0
	void OnCancelBtnClicked(); // Function WTL.WTLCommonOptions.OnCancelBtnClicked // (Final|Native|Private) // @ game+0x17ca990
	void OnApplySettingsConfirmed(); // Function WTL.WTLCommonOptions.OnApplySettingsConfirmed // (Final|Native|Private) // @ game+0x17caa20
	void OnApplyBtnClicked(); // Function WTL.WTLCommonOptions.OnApplyBtnClicked // (Final|Native|Private) // @ game+0x17caa40
	bool ApplyAllSettings(); // Function WTL.WTLCommonOptions.ApplyAllSettings // (Final|Native|Private) // @ game+0x17ca920
};

// Class WTL.WTLCommonSwitcher
// Size: 0x2c8 (Inherited: 0x290)
struct UWTLCommonSwitcher : UWTLCommonBase {
	struct UFMODEvent* ButtonPressedSoundEvent; // 0x290(0x08)
	struct UFMODEvent* ButtonHoveredSoundEvent; // 0x298(0x08)
	char pad_2A0[0x10]; // 0x2a0(0x10)
	struct UButton* btnPrevious; // 0x2b0(0x08)
	struct UButton* btnNext; // 0x2b8(0x08)
	enum class EWTLSwitcherType SwitcherType; // 0x2c0(0x01)
	char pad_2C1[0x7]; // 0x2c1(0x07)

	void OnPreviousButtonClicked(); // Function WTL.WTLCommonSwitcher.OnPreviousButtonClicked // (Native|Protected) // @ game+0x17c4de0
	void OnNextButtonClicked(); // Function WTL.WTLCommonSwitcher.OnNextButtonClicked // (Native|Protected) // @ game+0x17c4dc0
	void OnButtonPressed(); // Function WTL.WTLCommonSwitcher.OnButtonPressed // (Final|Native|Private) // @ game+0x17d28c0
	void OnButtonHovered(); // Function WTL.WTLCommonSwitcher.OnButtonHovered // (Final|Native|Private) // @ game+0x17d28a0
};

// Class WTL.WTLCommonPageSwitcher
// Size: 0x2f8 (Inherited: 0x2c8)
struct UWTLCommonPageSwitcher : UWTLCommonSwitcher {
	struct UTextBlock* tbCurrentPage; // 0x2c8(0x08)
	struct UTextBlock* tbPagesCount; // 0x2d0(0x08)
	char pad_2D8[0x20]; // 0x2d8(0x20)
};

// Class WTL.WTLCommonParameterName
// Size: 0x2d8 (Inherited: 0x260)
struct UWTLCommonParameterName : UUserWidget {
	struct UImage* imgBackground; // 0x260(0x08)
	struct UBorder* bMain; // 0x268(0x08)
	struct UTextBlock* tbParameterName; // 0x270(0x08)
	char pad_278[0x10]; // 0x278(0x10)
	struct FText ParameterName; // 0x288(0x18)
	struct FText DescriptionText; // 0x2a0(0x18)
