#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------

enum class EWTLMailPackageState : uint8
{
	None                           = 0,
	Traveling                      = 1,
	ReadyToPickup                  = 2,
	Delivered                      = 3,
	EWTLMailPackageState_MAX       = 4,
};

enum class EWTLArtefactType : uint8
{
	None                           = 0,
	Quest                          = 1,
	Food                           = 2,
	StimulatorContainer            = 3,
	Artefact                       = 4,
	Houseware                      = 5,
	Instruments                    = 6,
	Electronics                    = 7,
	Junk                           = 8,
	AmmoComponents                 = 9,
	Document                       = 10,
	SpareParts                     = 11,
	ModificationParts              = 12,
	Money                          = 13,
	FishingBait                    = 14,
	Fish                           = 15,
	Miscellaneous                  = 16,
	EWTLArtefactType_MAX           = 17,
};

enum class EWTLResourceType : uint8
{
	Base                           = 0,
	Complex                        = 1,
	EWTLResourceType_MAX           = 2,
};

enum class EWTLArmorClass : uint8
{
	None                           = 0,
	Light                          = 1,
	Medium                         = 2,
	Heavy                          = 3,
	EWTLArmorClass_MAX             = 4,
};

enum class EWTLClothesType : uint8
{
	None                           = 0,
	Boots                          = 1,
	Trousers                       = 2,
	Jacket                         = 3,
	Helmet                         = 4,
	ArmorPlate                     = 5,
	CustomizationItem              = 100,
	EWTLClothesType_MAX            = 101,
};

enum class EWTLItemType : uint8
{
	None                           = 0,
	Weapon                         = 1,
	Ammo                           = 2,
	Medicine                       = 3,
	Stuff                          = 4,
	Clothes                        = 5,
	Resource                       = 6,
	Artefact                       = 7,
	EWTLItemType_MAX               = 8,
};

enum class EWTLStuffType : uint8
{
	None                           = 0,
	WeaponRepairKit                = 1,
	AmmoReloadingKit               = 2,
	UnlockingKit                   = 3,
	FlashLight                     = 4,
	Equipment                      = 5,
	Detector                       = 6,
	ResourceMiner                  = 7,
	BuilderKit                     = 8,
	WeaponAttachment               = 9,
	OpticDevice                    = 10,
	Battery                        = 11,
	Extractor                      = 12,
	ArtefactContainerS             = 13,
	ArtefactContainerM             = 14,
	ArtefactContainerL             = 15,
	PDAModule                      = 16,
	ClothesRepairKit               = 17,
	PlacementKit                   = 18,
	WeaponSprayCan                 = 19,
	ClothesSprayCan                = 20,
	WeaponModificationKit          = 21,
	ClothesModificationKit         = 22,
	EngravingKit                   = 23,
	FishingItem                    = 24,
	RepairItem                     = 25,
	HealingItem                    = 26,
	UniversalScaner                = 27,
	EnergyEquipment                = 28,
	ProductionModule               = 29,
	TeleportationDevice            = 30,
	Vehicle                        = 31,
	Fuel                           = 32,
	Drone                          = 33,
	ControlledDrone                = 34,
	RadioDevice                    = 35,
	EWTLStuffType_MAX              = 36,
};

enum class EWTLCharacterEffectType : uint8
{
	None                           = 0,
	Radiation                      = 1,
	Chemicals                      = 2,
	Poison                         = 3,
	Bleeding                       = 4,
	Suffocation                    = 5,
	Burn                           = 6,
	Wounded                        = 7,
	Immobilization                 = 8,
	Consternation                  = 9,
	Alcohol                        = 101,
	RadiationProtection            = 102,
	ChemicalsProtection            = 103,
	PoisonProtection               = 104,
	BleedingProtection             = 105,
	Medicine                       = 200,
	Stimulator                     = 201,
	IntruderState                  = 252,
	IntruderStateLethal            = 253,
	Invulnerability                = 255,
	EWTLCharacterEffectType_MAX    = 256,
};

enum class EWTLMedicineType : uint8
{
	MedKit                         = 0,
	Stimulator                     = 1,
	EWTLMedicineType_MAX           = 2,
};

enum class EWTLCaliber : uint8
{
	None                           = 0,
	Caliber_22LR                   = 1,
	Caliber_9x18PM                 = 2,
	Caliber_9x19Parabellum         = 3,
	Caliber_7_62x25TT              = 4,
	Caliber_38Special              = 5,
	Caliber_45ACP                  = 6,
	Caliber_20                     = 7,
	Caliber_12                     = 8,
	Caliber_5_45x39                = 9,
	Caliber_5_56x45NATO            = 10,
	Caliber_7_62x39                = 11,
	Caliber_308WIN                 = 12,
	Caliber_7_62x54                = 13,
	Caliber_9x39                   = 14,
	Caliber_7_62x38                = 15,
	Caliber_30_06                  = 16,
	Caliber_338LM                  = 17,
	Caliber_357Magnum              = 18,
	Caliber_5_7x28                 = 19,
	Caliber_43mm                   = 20,
	Caliber_44Magnum               = 21,
	Caliber_500SWMagnum            = 22,
	Caliber_40mm                   = 23,
	Caliber_76mm                   = 24,
	EWTLCaliber_MAX                = 25,
};

enum class EWTLAmmoType : uint8
{
	Ammo                           = 0,
	Case                           = 1,
	Projectile                     = 2,
	EWTLAmmoType_MAX               = 3,
};

enum class EWTLWeaponType : uint8
{
	None                           = 0,
	Knife                          = 1,
	Pistol                         = 2,
	Shotgun                        = 3,
	SubMachineGun                  = 4,
	AssaultRifle                   = 5,
	Rifle                          = 6,
	Machinegun                     = 7,
	GrenadeLauncher                = 8,
	Missile                        = 9,
	Explosive                      = 10,
	EWTLWeaponType_MAX             = 11,
};

enum class EWTLLocationStorageType : uint8
{
	None                           = 0,
	Stash                          = 1,
	CraftObject                    = 2,
	PremiumStash                   = 3,
	EWTLLocationStorageType_MAX    = 4,
};

enum class EWTLStorageType : uint8
{
	None                           = 0,
	Inventory                      = 1,
	Commission                     = 2,
	CraftObject                    = 3,
	LocationStorage                = 4,
	PrivateStorage                 = 5,
	ClanStorage                    = 6,
	FortificationObject            = 7,
	MailPackage                    = 8,
	EWTLStorageType_MAX            = 9,
};

enum class EWTLMailPackageDeliveryType : uint8
{
	None                           = 0,
	Regular                        = 1,
	Fast                           = 2,
	EWTLMailPackageDeliveryType_MAX = 3,
};

enum class EWTLColliderType : uint8
{
	None                           = 0,
	Body                           = 1,
	Head                           = 2,
	Arm                            = 3,
	Leg                            = 4,
	Foot                           = 5,
	EWTLColliderType_MAX           = 6,
};

enum class EWTLCharacterClass : uint8
{
	None                           = 0,
	Miner                          = 1,
	Hunter                         = 2,
	Mercenary                      = 3,
	Engineer                       = 4,
	EWTLCharacterClass_MAX         = 5,
};

enum class EWTLFaction : uint8
{
	None                           = 0,
	Confederation                  = 1,
	BlackSunset                    = 2,
	EWTLFaction_MAX                = 3,
};

enum class EDBConnectionType : uint8
{
	TCP                            = 0,
	NamedPipe                      = 1,
	EDBConnectionType_MAX          = 2,
};

enum class EDBDriverType : uint8
{
	None                           = 0,
	MySQL                          = 1,
	MySQLDevart                    = 2,
	MariaDB                        = 3,
	EDBDriverType_MAX              = 4,
};

enum class EWTLActivatableAnomalyState : uint8
{
	Idle                           = 0,
	BeginActivate                  = 1,
	Activated                      = 2,
	EWTLActivatableAnomalyState_MAX = 3,
};

enum class EWTLAIStateDeath : uint8
{
	None                           = 0,
	ToDeath                        = 1,
	Death                          = 2,
	EWTLAIStateDeath_MAX           = 3,
};

enum class EWTLAmbientSoundDayTimeType : uint8
{
	AllDay                         = 0,
	Day                            = 1,
	Night                          = 2,
	EWTLAmbientSoundDayTimeType_MAX = 3,
};

enum class EWTLAmbientSoundLocationType : uint8
{
	Foreground                     = 0,
	Underground                    = 1,
	EWTLAmbientSoundLocationType_MAX = 2,
};

enum class EWTLReloadingNotifyType : uint8
{
	ReloadStart                    = 0,
	ReloadEnd                      = 1,
	EWTLReloadingNotifyType_MAX    = 2,
};

enum class EWTLAnomalyCheckResult : uint8
{
	Result_False                   = 0,
	Result_True                    = 1,
	Result_MAX                     = 2,
};

enum class EWTLAnomalyActionResult : uint8
{
	Failed                         = 0,
	Success                        = 1,
	EWTLAnomalyActionResult_MAX    = 2,
};

enum class EWTLBPLogVerbosity : uint8
{
	Information                    = 4,
	Warning                        = 3,
	Error                          = 2,
	Fatal                          = 1,
	EWTLBPLogVerbosity_MAX         = 5,
};

enum class EWTLBulletHellTraceResultType : uint8
{
	None                           = 0,
	Character                      = 1,
	WorldStatic                    = 2,
	EWTLBulletHellTraceResultType_MAX = 3,
};

enum class EWTLBulletHellAngularType : uint8
{
	Forward                        = 0,
	Reverse                        = 1,
	PingPong                       = 2,
	EWTLBulletHellAngularType_MAX  = 3,
};

enum class EWTLDisplayInputType : uint8
{
	None                           = 0,
	InputUp                        = 1,
	InputDown                      = 2,
	InputRight                     = 3,
	InputLeft                      = 4,
	ButtonPressed1                 = 5,
	ButtonPressed2                 = 6,
	EWTLDisplayInputType_MAX       = 7,
};

enum class EWTLCharacterAnimationInstanceMovementState : uint8
{
	None                           = 0,
	Stand                          = 1,
	StandWalking                   = 2,
	StandSprinting                 = 3,
	Crouch                         = 4,
	CrouchWalking                  = 5,
	Prone                          = 6,
	ProneWalking                   = 7,
	EWTLCharacterAnimationInstanceMovementState_MAX = 8,
};

enum class EWTLRootMotionControlLockingType : uint8
{
	None                           = 0,
	LockOnlyYaw                    = 1,
	LockOnlyPitch                  = 2,
	LockAll                        = 3,
	EWTLRootMotionControlLockingType_MAX = 4,
};

enum class EWTLSimplifiedIdentificationType : uint8
{
	None                           = 0,
	OriginalSimplified             = 1,
	HealthbarCombined              = 2,
	CharacterNameOnly              = 3,
	EWTLSimplifiedIdentificationType_MAX = 4,
};

enum class EWTLLadderMontageType : uint8
{
	None                           = 0,
	LadderUpStart                  = 1,
	LadderUpEnd                    = 2,
	LadderDownStart                = 3,
	LadderDownEnd                  = 4,
	EWTLLadderMontageType_MAX      = 5,
};

enum class EWTLCharacterPreviewType : uint8
{
	None                           = 0,
	CustomizationOnly              = 1,
	Equipment                      = 2,
	EquipmentWithUsableItem        = 3,
	EWTLCharacterPreviewType_MAX   = 4,
};

enum class EWTLTurretState : uint8
{
	None                           = 0,
	Prewarm                        = 1,
	Firing                         = 2,
	Cooldown                       = 3,
	EWTLTurretState_MAX            = 4,
};

enum class EWTLConfirmationType : uint8
{
	None                           = 0,
	DropItemFromInventory          = 1,
	DestroyItemInInventory         = 2,
	RemoveStash                    = 3,
	EWTLConfirmationType_MAX       = 4,
};

enum class EWTLBackButtonActionType : uint8
{
	None                           = 0,
	BackToStoreItems               = 1,
	BackToViewItem                 = 2,
	BackToCart                     = 3,
	EWTLBackButtonActionType_MAX   = 4,
};

enum class EFontSize : uint8
{
	None                           = 0,
	Default                        = 16,
	Increased                      = 18,
	EFontSize_MAX                  = 19,
};

enum class EWTLControlledPawnType : uint8
{
	Monster                        = 0,
	Robot                          = 1,
	EWTLControlledPawnType_MAX     = 2,
};

enum class EWTLEnemyNPCExclamationType : uint8
{
	None                           = 0,
	Attack                         = 1,
	DamageDone                     = 2,
	Grenade                        = 3,
	Reload                         = 4,
	Warning                        = 5,
	TargetSighted                  = 6,
	TargetListened                 = 7,
	TalkToTarget                   = 8,
	EWTLEnemyNPCExclamationType_MAX = 9,
};

enum class EWTLEnemyNPCSpawnType : uint8
{
	Wave                           = 0,
	ReplanishTheRanks              = 1,
	EWTLEnemyNPCSpawnType_MAX      = 2,
};

enum class EWTLCannotUseRangedWeaponOnClientSideReason : uint8
{
	None                           = 0,
	AmmoIsFireworkAndLocationIsUndeground = 1,
	EWTLCannotUseRangedWeaponOnClientSideReason_MAX = 2,
};

enum class EWTLDroneMovementMode : uint8
{
	None                           = 0,
	RotateAroundCharacter          = 1,
	FollowCharacterFromAbove       = 2,
	EWTLDroneMovementMode_MAX      = 3,
};

enum class EWTLWeaponModificationPartsType : uint8
{
	None                           = 0,
	Damage                         = 1,
	Accuracy                       = 2,
	Durability                     = 3,
	EWTLWeaponModificationPartsType_MAX = 4,
};

enum class EWTLCannotCraftRecipeInCraftObjectReason : uint8
{
	None                           = 0,
	StorageIsFull                  = 1,
	NotEnoughAvailableSlotsInStorage = 2,
	EWTLCannotCraftRecipeInCraftObjectReason_MAX = 3,
};

enum class EWTLDebugSuggestionType : uint8
{
	None                           = 0,
	Account                        = 1,
	Friend                         = 2,
	EWTLDebugSuggestionType_MAX    = 3,
};

enum class EWTLCannotBuyItemReason : uint8
{
	None                           = 0,
	ItemIsOutOfStock               = 1,
	ItemPriceHasBeenChanged        = 2,
	EWTLCannotBuyItemReason_MAX    = 3,
};

enum class EWTLPlayerPawnType : uint8
{
	NoneOrDead                     = 0,
	Character                      = 1,
	Monster                        = 2,
	Spectator                      = 3,
	EWTLPlayerPawnType_MAX         = 4,
};

enum class EWTLAchievementRarity : uint8
{
	Common                         = 0,
	Rare                           = 1,
	VeryRare                       = 2,
	UltraRare                      = 3,
	IncredibleRare                 = 4,
	Legendary                      = 5,
	EWTLAchievementRarity_MAX      = 6,
};

enum class EWTLCharacterStateInVehicle : uint8
{
	None                           = 0,
	Idle                           = 1,
	Riding                         = 2,
	Reverse                        = 3,
	Jump                           = 4,
	SlideRight                     = 5,
	SlideLeft                      = 6,
	Acceleration                   = 7,
	EWTLCharacterStateInVehicle_MAX = 8,
};

enum class EWTLVehicleState : uint8
{
	None                           = 0,
	CharacterLanded                = 1,
	CharacterUnlanded              = 2,
	Idle                           = 3,
	EWTLVehicleState_MAX           = 4,
};

enum class EWTLCannotTeleportOnFortificationReason : uint8
{
	None                           = 0,
	NotEnoughTeleportationDeviceEnergy = 1,
	ControlFactionNotEqualCharacterFaction = 2,
	CharacterReputationTooLow      = 3,
	CommandCoreEnergyNotEnoughForSafeZoneFunctionality = 4,
	EWTLCannotTeleportOnFortificationReason_MAX = 5,
};

enum class EWTLCheckType : uint8
{
	MustHaveAll                    = 0,
	MustHaveOneOf                  = 1,
	MustNotHaveAll                 = 2,
	MustNotHaveOneOf               = 3,
	EWTLCheckType_MAX              = 4,
};

enum class EWTLCharacterStateIndicatorNatureType : uint8
{
	Neutral                        = 0,
	Positive                       = 1,
	Negative_Average               = 2,
	Negative_Severe                = 3,
	EWTLCharacterStateIndicatorNatureType_MAX = 4,
};

enum class EWTLCharacterEffectNatureType : uint8
{
	Negative                       = 0,
	Positive                       = 1,
	EWTLCharacterEffectNatureType_MAX = 2,
};

enum class EWTLStoreItemType : uint8
{
	All                            = 0,
	Weapons                        = 1,
	Ammo                           = 2,
	Medicine                       = 3,
	Equipment                      = 4,
	ClothesAndArmor                = 5,
	Resources                      = 6,
	Other                          = 7,
	Tokens                         = 8,
	Bundles                        = 9,
	NewItems                       = 10,
	EWTLStoreItemType_MAX          = 11,
};

enum class EWTLCountryRegion : uint8
{
	Unknown                        = 0,
	Asia                           = 1,
	America                        = 2,
	Europe                         = 3,
	CIS                            = 4,
	Oceania                        = 5,
	EWTLCountryRegion_MAX          = 6,
};

enum class EWTLMicrotransactionType : uint8
{
	Credits                        = 0,
	Premium                        = 1,
	EWTLMicrotransactionType_MAX   = 2,
};

enum class EWTLCannotPutToAccountInventoryReason : uint8
{
	None                           = 0,
	CannotPut                      = 1,
	HaveNoPremium                  = 2,
	LoadedWeapon                   = 3,
	WeaponWithAttachments          = 4,
	ModifiedWeapon                 = 5,
	AmmoLoadedInWeapon             = 6,
	VehicleCurrentInUse            = 7,
	ClothesWithArmorPlates         = 8,
	EWTLCannotPutToAccountInventoryReason_MAX = 9,
};

enum class EWTLCannotTakeFromAccountInventoryReason : uint8
{
	None                           = 0,
	CannotTake                     = 1,
	LowCharacterLevel              = 2,
	NotEnoughAvailableSlotsInInventory = 3,
	EWTLCannotTakeFromAccountInventoryReason_MAX = 4,
};

enum class EWTLClanScoreType : uint8
{
	None                           = 0,
	PVP                            = 1,
	PVE                            = 2,
	Craft                          = 3,
	Technology                     = 4,
	EWTLClanScoreType_MAX          = 5,
};

enum class EWTLSlotMachineSymbolCheckType : uint8
{
	NotAny                         = 0,
	Any                            = 1,
	EWTLSlotMachineSymbolCheckType_MAX = 2,
};

enum class EWTLSlotMachineSymbol : uint8
{
	Blank                          = 0,
	Cherry                         = 1,
	Bar                            = 2,
	DoubleBar                      = 3,
	TripleBar                      = 4,
	Seven                          = 5,
	Jackpot                        = 6,
	EWTLSlotMachineSymbol_MAX      = 7,
};

enum class EWTLComboBoxStringType : uint8
{
	None                           = 0,
	CommonComboBoxString           = 1,
	StoreComboBoxString            = 2,
	HUDComboBoxString              = 3,
	PDAComboBoxString              = 4,
	EWTLComboBoxStringType_MAX     = 5,
};

enum class EWTLCheckBoxType : uint8
{
	None                           = 0,
	CommonCheckBox                 = 1,
	HUDCheckBox                    = 2,
	PDACheckBox                    = 3,
	EWTLCheckBoxType_MAX           = 4,
};

enum class EWTLSwitcherType : uint8
{
	None                           = 0,
	PageSwitcher                   = 1,
	ParameterSwitcher              = 2,
	Common_Parameter_PointSpin     = 3,
	HUD_Parameter_PointSpin        = 4,
	PDA_Parameter_PointSpin        = 5,
	EWTLSwitcherType_MAX           = 6,
};

enum class EWTLCommonClickedItemType : uint8
{
	None                           = 0,
	CommonClickedItem              = 1,
	MainMenuClickedItem            = 2,
	StoreClickedItem               = 3,
	HUDClickedItem                 = 4,
	PDAClickedItem                 = 5,
	EWTLCommonClickedItemType_MAX  = 6,
};

enum class EWTLCommonButtonType : uint8
{
	None                           = 0,
	CommonButton                   = 1,
	CommonTabButton                = 2,
	CommonTypeButton               = 3,
	HUDButton                      = 4,
	HUDTabButton                   = 5,
	HUDPopupMenuButton             = 6,
	PDAButton                      = 7,
	ColorButton                    = 8,
	StoreButton                    = 9,
	ColorPresetButton              = 10,
	EWTLCommonButtonType_MAX       = 11,
};

enum class EWTLFoodActionType : uint8
{
	None                           = 0,
	Drink                          = 1,
	Eat                            = 2,
	EWTLFoodActionType_MAX         = 3,
};

enum class EWTLMessageDialogText : uint8
{
	HasNotPurchasedCustomizationItemsErrorText = 0,
	NotEnoughTokensToBuyWantToPopUpErrorText = 1,
	EWTLMessageDialogText_MAX      = 2,
};

enum class EWTLLootBoxType : uint8
{
	None                           = 0,
	Beginner                       = 1,
	Regular                        = 2,
	Advanced                       = 3,
	Special                        = 4,
	Rare                           = 5,
	EWTLLootBoxType_MAX            = 6,
};

enum class EWTLSocialNetworkType : uint8
{
	None                           = 0,
	VK                             = 1,
	Facebook                       = 2,
	Twitter                        = 3,
	EWTLSocialNetworkType_MAX      = 4,
};

enum class EWTLArenaMatchState : uint8
{
	None                           = 0,
	WaitingForStart                = 1,
	InProgress                     = 2,
	Done                           = 3,
	EWTLArenaMatchState_MAX        = 4,
};

enum class EWTLButtonText : uint8
{
	None                           = 0,
	OK                             = 1,
	Cancel                         = 2,
	Yes                            = 3,
	No                             = 4,
	Apply                          = 5,
	Back                           = 6,
	TopUp                          = 7,
	Send                           = 8,
	Take                           = 9,
	TakeAll                        = 10,
	Update                         = 11,
	Log                            = 12,
	Settings                       = 13,
	Withdraw                       = 14,
	Deposit                        = 15,
	Details                        = 16,
	Open                           = 17,
	Close                          = 18,
	Receive                        = 19,
	Buy                            = 20,
	Info                           = 21,
	ThreeD                         = 22,
	Play                           = 23,
	Set                            = 24,
	Add                            = 25,
	Remove1                        = 26,
	Remove2                        = 27,
	RemoveAll1                     = 28,
	RemoveAll2                     = 29,
	Delete                         = 30,
	DeleteAll                      = 31,
	Edit                           = 32,
	Convert                        = 33,
	Unite                          = 34,
	Read                           = 35,
	Create                         = 36,
	Rename                         = 37,
	Execute                        = 38,
	Save                           = 39,
	InviteToGroup                  = 40,
	Exchange                       = 41,
	ClanApplication                = 42,
	EWTLButtonText_MAX             = 43,
};

enum class EWTLTutorialMessageType : uint8
{
	None                           = 0,
	Tutorial                       = 1,
	Warning                        = 2,
	EWTLTutorialMessageType_MAX    = 3,
};

enum class EWTLTutorialMessage : uint8
{
	None                           = 0,
	ShowPDA                        = 1,
	ShowMap                        = 2,
	ShowMapLegend                  = 3,
	EmotionsMenu                   = 9,
	FirstSkillPoint                = 10,
	GasMaskStuffSlot               = 16,
	HasSteamInventoryItems         = 20,
	PlaceStash                     = 21,
	AccountInventoryInStore        = 22,
	AccountInventoryInStoreFastAccess = 23,
	HungerAffects                  = 24,
	ThirstAffects                  = 25,
	Satiety                        = 26,
	Exhaustion                     = 27,
	DelayedDeathSanatoriumTutorial = 28,
	WantToPlacePremiumStash        = 29,
	PlacedPremiumStash             = 30,
	EWTLTutorialMessage_MAX        = 31,
};

enum class EWTLRepairKitState : uint8
{
	None                           = 0,
	StartRepair                    = 1,
	StopRepair                     = 2,
	OutOfEnergy                    = 3,
	EWTLRepairKitState_MAX         = 4,
};

enum class EWTLFortificationNotificationState : uint8
{
	None                           = 0,
	StartLoosingPoint              = 1,
	StartCapturingPoint            = 2,
	PointCaptured                  = 3,
	PointSecured                   = 4,
	PointLost                      = 5,
	PointCaptureFailed             = 6,
	EWTLFortificationNotificationState_MAX = 7,
};

enum class EWTLFortificationPointState : uint8
{
	None                           = 0,
	CaptureStarted                 = 1,
	Captured                       = 2,
	Restored                       = 3,
	EWTLFortificationPointState_MAX = 4,
};

enum class EWTLFortificationJammerState : uint8
{
	None                           = 0,
	Connected                      = 1,
	ConnectedOutOfEnergy           = 2,
	ConnectionRefused              = 3,
	UnableToConnect                = 4,
	EWTLFortificationJammerState_MAX = 5,
};

enum class EWTLEquipmentType : uint8
{
	None                           = 0,
	NightVision                    = 1,
	NDPDetector                    = 2,
	MetalDetector                  = 3,
	RespiratoryProtection          = 4,
	RadiationDetector              = 5,
	PersonalEnergyShield           = 6,
	EWTLEquipmentType_MAX          = 7,
};

enum class EWTLAITeam : uint8
{
	None                           = 0,
	Vagrants                       = 1,
	Monsters                       = 2,
	Confederation                  = 250,
	BlackSunset                    = 251,
	Neutrals                       = 255,
	EWTLAITeam_MAX                 = 256,
};

enum class EWTLCharacterStunhitDirection : uint8
{
	None                           = 0,
	Right                          = 1,
	Left                           = 2,
	InPlace                        = 3,
	Back                           = 4,
	FallDown                       = 5,
	SpikeInShoulder                = 6,
	SpikeInStomach                 = 7,
	SpikeInHip                     = 8,
	EWTLCharacterStunhitDirection_MAX = 9,
};

enum class EWTLRenderTargetType : uint8
{
	Square                         = 0,
	Landscape                      = 1,
	EWTLRenderTargetType_MAX       = 2,
};

enum class EWTLDialogMessageType : uint8
{
	Information                    = 0,
	Warning                        = 1,
	Error                          = 2,
	EWTLDialogMessageType_MAX      = 3,
};

enum class EWTLNPCType : uint8
{
	None                           = 0,
	Doctor                         = 1,
	Stockman                       = 2,
	Gunsmith                       = 3,
	Trader                         = 4,
	Barman                         = 5,
	BlackMarketDealer              = 6,
	EWTLNPCType_MAX                = 7,
};

enum class EWTLReportFormResponseError : uint8
{
	None                           = 0,
	ServerDoesNotResponse          = 1,
	ServerRequestError             = 2,
	EWTLReportFormResponseError_MAX = 3,
};

enum class EWTLReportFormState : uint8
{
	FeedbackForm                   = 0,
	RequestSending                 = 1,
	RequestSuccess                 = 2,
	RequestError                   = 3,
	EWTLReportFormState_MAX        = 4,
};

enum class EWTLUseMenuActionType : uint8
{
	None                           = 0,
	ShowInformationAboutCharacter  = 1,
	SendTextChatMessageToCharacter = 2,
	GiveTokensToCharacter          = 3,
	OfferBarterToCharacter         = 4,
	InviteCharacterToGroup         = 5,
	MuteCharacter                  = 6,
	UnmuteCharacter                = 7,
	TextChatMuteCharacter          = 8,
	TextChatUnmuteCharacter        = 9,
	ReportCharacter                = 10,
	CommendCharacter               = 11,
	Pickup                         = 12,
	Charge                         = 13,
	Use                            = 14,
	OpenAmmoBox                    = 15,
	EWTLUseMenuActionType_MAX      = 16,
};

enum class EWTLTriggerObjectActionType : uint8
{
	None                           = 0,
	Read                           = 1,
	Inspect                        = 2,
	InsertBatteries                = 3,
	TakeAndRead                    = 4,
	Take                           = 5,
	EWTLTriggerObjectActionType_MAX = 6,
};

enum class EWTLQTEType : uint8
{
	None                           = 0,
	Repetative                     = 1,
	RepetativeWithDecreasing       = 2,
	MachingSequence                = 3,
	RepetativeControlsEnabled      = 4,
	RepetativeWithDecreasingControlsEnabled = 5,
	MachingSequenceWithDecreasing  = 6,
	Fishing                        = 7,
	EWTLQTEType_MAX                = 8,
};

enum class EWTLArmorPlateType : uint8
{
	None                           = 0,
	FrontPlate                     = 1,
	BackPlate                      = 2,
	EWTLArmorPlateType_MAX         = 3,
};

enum class EWTLHUDRequestWindowType : uint8
{
	None                           = 0,
	GroupInvite                    = 1,
	ClanInvite                     = 2,
	BarterOffer                    = 3,
	MarkerSharing                  = 4,
	EWTLHUDRequestWindowType_MAX   = 5,
};

enum class EWTLMoneyTransferWindowWidgetType : uint8
{
	None                           = 0,
	WithdrawFromClanStorage        = 1,
	DepositToClanStorage           = 2,
	EWTLMoneyTransferWindowWidgetType_MAX = 3,
};

enum class EWTLCommissionAddUpdateWindowType : uint8
{
	None                           = 0,
	Add                            = 1,
	Update                         = 2,
	EWTLCommissionAddUpdateWindowType_MAX = 3,
};

enum class EWTLCheatType : uint8
{
	None                           = 0,
	RX_Throttle                    = 1,
	TX_Throttle                    = 2,
	BadPing                        = 3,
	TimeDiscrepancy                = 4,
	Unrandomizer                   = 5,
	ClientValuesHack               = 6,
	SpeedHack                      = 7,
	FireMacrosUse                  = 8,
	HitOutsideHitbox               = 9,
	FireNotInView                  = 10,
	FireWithNoAmmo                 = 11,
	FireWithHighRate               = 12,
	CheatSoftwareDetected          = 13,
	SuspiciousModule               = 100,
	AnticheatResponseFailed        = 200,
	EWTLCheatType_MAX              = 201,
};

enum class EWTLCountdownSliderWidgetFillingType : uint8
{
	Increasing                     = 0,
	Decreasing                     = 1,
	EWTLCountdownSliderWidgetFillingType_MAX = 2,
};

enum class EWTLActionTimerWidgetType : uint8
{
	None                           = 0,
	AnomalyResearch                = 1,
	SafeZoneLeaveInvulnerableCooldown = 2,
	ItemPlacement                  = 3,
	EWTLActionTimerWidgetType_MAX  = 4,
};

enum class EWTLWarningTitleWidgetType : uint8
{
	CannotPickupNotAnyAvailableSlotInInventory = 0,
	CannotMoveInventoryOverload    = 1,
	CannotSprintInventoryOverload  = 2,
	CannotPickupInventoryOverload  = 3,
	CannotUseNotCondition          = 4,
	CannotUseNotEnergy             = 5,
	WeaponReloadAdvice             = 6,
	CannotUsePortal                = 7,
	CannotInviteToGroupAlreadyIn   = 8,
	NotInClan                      = 9,
	NotInFaction                   = 10,
	CannotUsePlaceableStuff        = 11,
	CannotCollectWaterInventoryOverload = 12,
	CannotCollectWaterInventoryWillBeOverloaded = 13,
	CannotCollectWaterNotAnyAvailableSlotInInventory = 14,
	GunOverheated                  = 15,
	NoAmmoForShooting              = 16,
	NoNutsInInventoryToThrow       = 17,
	EventJoined                    = 18,
	EventLeaved                    = 19,
	EventCompleted                 = 20,
	EventFailed                    = 21,
	FishingRodIsBroken             = 22,
	MustBeInAFishingZoneToUseFishingRod = 23,
	ToUseFishingRodAimAtTheWater   = 24,
	TooCloseToUseFishingRod        = 25,
	TooFarToUseFishingRod          = 26,
	FishDontBite                   = 27,
	HaveNotAnyBaitInInventory      = 28,
	NotEnoughStaminaToSprint       = 29,
	NotEnoughStaminaToJump         = 30,
	CannotUseVehicleNotAllowedInLocation = 31,
	CannotUseVehicleIsInSafeZone   = 32,
	CannotSpawnVehicleOnUnevenSurface = 33,
	ResourceWasDepletedInSource    = 34,
	NoOrNotEnoughRequiredItemsToGatherResourceFromSource = 35,
	FireWithCurrentLoadedAmmoIsProhibitedInThisLocation = 36,
	EWTLWarningTitleWidgetType_MAX = 37,
};

enum class EWTLItemSlotActionPermission : uint8
{
	AddOnCustomization             = 0,
	AddForModification             = 1,
	AddWeaponPartToExchange        = 2,
	RemoveFromCustomization        = 3,
	RemoveFromModification         = 4,
	RemoveWeaponPartFromExchange   = 5,
	OpenExtractor                  = 6,
	CloseExtractor                 = 7,
	AddToStimulatorContainerSlot   = 8,
	RemoveFromStimulatorContainerSlot = 9,
	AddOnSale                      = 10,
	AddOnRepair                    = 11,
	AddToExtractor                 = 12,
	AddToBarter                    = 13,
	AddToSteamInventory            = 14,
	AddToMailBox                   = 15,
	AddToUtilization               = 16,
	AddToCommission                = 17,
	AddToExistingItemOnCommission  = 18,
	RemoveFromSale                 = 19,
	RemoveFromRepair               = 20,
	RemoveFromExtractor            = 21,
	RemoveFromBarter               = 22,
	RemoveFromSteamInventory       = 23,
	RemoveFromMailBox              = 24,
	RemoveFromUtilization          = 25,
	PutInStorage                   = 26,
	TakeFromStorage                = 27,
	PutInClanStorage               = 28,
	TakeFromClanStorage            = 29,
	PutToAccountInventory          = 30,
	TakeFromAccountInventory       = 31,
	AssignToFastAccess             = 32,
	RemoveFromFastAccess           = 33,
	PlaceItem                      = 34,
	AttachToWeaponByStuffItem      = 35,
	AttachStuffItemToWeapon        = 36,
	RemoveAttachmentFromWeapon     = 37,
	RemoveAttachmentFromWeaponBySlot = 38,
	RemoveAllAttachmentsFromWeapon = 39,
	UseItem                        = 40,
	ChargeEnergySourceItemToStuff  = 41,
	ChargeStuffItemByEnergySource  = 42,
	ChangeGasMaskFilterFromFilter  = 43,
	ChangeGasMaskFilterFromGasMask = 44,
	RefuelFuelSourceItemToStuff    = 45,
	RefuelStuffItemByFuelSource    = 46,
	PlaceArtefactItemInContainer   = 47,
	RemoveArtefactItemFromContainer = 48,
	InstallPDAModule               = 49,
	RepairWeaponByKit              = 50,
	RepairClothesByKit             = 51,
	ModifyWeaponByKit              = 52,
	ModifyClothesByKit             = 53,
	PaintWeaponBySprayCan          = 54,
	PaintClothesBySprayCan         = 55,
	LoadAmmoToWeapon               = 56,
	LoadWeapon                     = 57,
	UnloadWeapon                   = 58,
	BreakWeapon                    = 59,
	InstallArmoredPlate            = 60,
	RemoveArmoredPlate             = 61,
	UseNewPassport                 = 62,
	UseClassCertificate            = 63,
	UseGenderChangeCertificate     = 64,
	DrinkItem                      = 65,
	EatItem                        = 66,
	ViewItem                       = 67,
	ReadItem                       = 68,
	CutFish                        = 69,
	EquipClothesItem               = 70,
	UnequipClothesItem             = 71,
	OpenArmoredPlatesWindow        = 72,
	RemoveAllArmoredPlates         = 73,
	EquipStuffItem                 = 74,
	UnequipStuffItem               = 75,
	CombineItem                    = 76,
	SplitItem                      = 77,
	DropItem                       = 78,
	DestroyItem                    = 79,
	ShowItemInformation            = 80,
	RepairByRepairDevice           = 81,
	EWTLItemSlotActionPermission_MAX = 82,
};

enum class EWTLMonsterActivityState : uint8
{
	Normal                         = 0,
	Passive                        = 1,
	DeepSleep                      = 2,
	EWTLMonsterActivityState_MAX   = 3,
};

enum class EWTLMonsterActionBase : uint8
{
	None                           = 0,
	MainAttack                     = 1,
	SecondaryAttack                = 2,
	SpecialAbility0                = 3,
	SpecialAbility1                = 4,
	SpecialAbility2                = 5,
	SpecialAbility3                = 6,
	SpecialAbility4                = 7,
	SpecialAbility5                = 8,
	Immobilized                    = 9,
	Stunned                        = 10,
	Die                            = 11,
	CustomAction0                  = 12,
	CustomAction1                  = 13,
	CustomAction2                  = 14,
	CustomAction3                  = 15,
	CustomAction4                  = 16,
	CustomAction5                  = 17,
	CustomAction6                  = 18,
	CustomAction7                  = 19,
	CustomAction8                  = 20,
	CustomAction9                  = 21,
	EWTLMonsterActionBase_MAX      = 22,
};

enum class EWTLMonsterAttachState : uint8
{
	None                           = 0,
	AttachTo                       = 1,
	Attached                       = 2,
	DetachTo                       = 3,
	Detached                       = 4,
	AttachedForward                = 5,
	AttachedBack                   = 6,
	EWTLMonsterAttachState_MAX     = 7,
};

enum class EWTLMonsterAttackModificator : uint8
{
	AllowCritical                  = 0,
	DisallowCritical               = 1,
	AlwaysCritical                 = 2,
	EWTLMonsterAttackModificator_MAX = 3,
};

enum class EWTLMonsterStateFollowTarget : uint8
{
	MoveTo                         = 0,
	Attack                         = 1,
	FarAttack                      = 2,
	Hide                           = 3,
	Attach                         = 4,
	AttachedForward                = 5,
	Detach                         = 6,
	WithoutStateChange             = 7,
	AttachedBack                   = 8,
	RandomLocation                 = 9,
	JumpToEnemy                    = 10,
	EWTLMonsterStateFollowTarget_MAX = 11,
};

enum class EWTMonsterSecondaryState : uint8
{
	Idle                           = 0,
	Follow                         = 1,
	MoveTo                         = 2,
	Attack                         = 3,
	MoveToForFarAttack             = 4,
	FarAttack                      = 5,
	Attach1                        = 6,
	Attach2                        = 7,
	Attach3                        = 8,
	Attach4                        = 9,
	Detach                         = 10,
	RandomLocation                 = 11,
	JumpToEnemy                    = 12,
	HearingMoveTo                  = 13,
	Hide                           = 14,
	Stealth                        = 15,
	MovingInStealth                = 16,
	CustomAction0                  = 17,
	CustomAction1                  = 18,
	CustomAction2                  = 19,
	CustomAction3                  = 20,
	CustomAction4                  = 21,
	CustomAction5                  = 22,
	SpecialAbility0                = 23,
	SpecialAbility1                = 24,
	SpecialAbility2                = 25,
	SpecialAbility3                = 26,
	EWTMonsterSecondaryState_MAX   = 27,
};

enum class EWTLMonsterState : uint8
{
	Idle                           = 0,
	Walk                           = 1,
	AggressUp                      = 2,
	FollowTarget                   = 3,
	Attack                         = 4,
	Escaping                       = 5,
	Jump                           = 6,
	JumpToEnemy                    = 7,
	Teleport                       = 8,
	Fly                            = 9,
	FarAttackToBadCharacter        = 10,
	ToStealth                      = 11,
	InStealth                      = 12,
	StealthMoveTo                  = 13,
	StealthFollowEnemy             = 14,
	FromStealth                    = 15,
	DropItemFromCharacter          = 16,
	CustomAction0                  = 17,
	CustomAction1                  = 18,
	CustomAction2                  = 19,
	CustomAction3                  = 20,
	CustomAction4                  = 21,
	CustomAction5                  = 22,
	GetRandomTarget                = 23,
	PlayMontage                    = 24,
	ToSacrifice                    = 25,
	FindTheVictim                  = 26,
	SpawnMonster                   = 27,
	EWTLMonsterState_MAX           = 28,
};

enum class EWTLMonsterActionType : uint8
{
	None                           = 0,
	MainAttack                     = 1,
	SecondaryAttack                = 2,
	SpecialAbility0                = 3,
	SpecialAbility1                = 4,
	SpecialAbility2                = 5,
	SpecialAbility3                = 6,
	SpecialAbility4                = 7,
	SpecialAbility5                = 8,
	Idle0                          = 9,
	Idle1                          = 10,
	Idle2                          = 11,
	Idle3                          = 12,
	Idle4                          = 13,
	Idle5                          = 14,
	Immobilized                    = 15,
	Stunned                        = 16,
	Die                            = 17,
	CustomAction0                  = 18,
	CustomAction1                  = 19,
	CustomAction2                  = 20,
	CustomAction3                  = 21,
	CustomAction4                  = 22,
	CustomAction5                  = 23,
	CustomAction6                  = 24,
	ToStealth                      = 25,
	InStealth                      = 26,
	FromStealth                    = 27,
	Aggression                     = 28,
	FarAttack0                     = 29,
	FarAttack1                     = 30,
	FarAttackToBadEnemy1           = 31,
	EWTLMonsterActionType_MAX      = 32,
};

enum class EWTLMonsterMovementMode : uint8
{
	None                           = 0,
	Loaf                           = 1,
	Walk                           = 2,
	Sprint                         = 3,
	EWTLMonsterMovementMode_MAX    = 4,
};

enum class EWTLPDAWidget : uint8
{
	Menu                           = 0,
	CharacterInfo                  = 1,
	CharacterParameters            = 2,
	CharacterSkills                = 3,
	QuestLog                       = 4,
	Map                            = 5,
	Mail                           = 6,
	Group                          = 7,
	Clan                           = 8,
	Faction                        = 9,
	FriendsAndEnemies              = 10,
	CraftRecipes                   = 11,
	Achievements                   = 12,
	Settings                       = 13,
	Premium                        = 14,
	NVIDIA_Highlights              = 15,
	SocialNetworkVK                = 16,
	SocialNetworkFacebook          = 17,
	EWTLPDAWidget_MAX              = 18,
};

enum class EWTLCustomizationColorPresetType : uint8
{
	None                           = 0,
	Hair                           = 1,
	Skin                           = 2,
	Clothes                        = 3,
	Feet                           = 4,
	Backpack                       = 5,
	EWTLCustomizationColorPresetType_MAX = 6,
};

enum class EWTLMonsterDangerLevel : uint8
{
	None                           = 0,
	Low                            = 1,
	BelowNormal                    = 2,
	Normal                         = 3,
	AboveNormal                    = 4,
	High                           = 5,
	Critical                       = 6,
	EWTLMonsterDangerLevel_MAX     = 7,
};

enum class EWTLMedicineEffectType : uint8
{
	None                           = 0,
	Strength                       = 1,
	Dexterity                      = 2,
	Stamina                        = 3,
	Accuracy                       = 4,
	Intelligence                   = 5,
	Fortune                        = 6,
	MaxHealth                      = 7,
	EWTLMedicineEffectType_MAX     = 8,
};

enum class EWTLSuicideState : uint8
{
	None                           = 0,
	SuicideInProgress              = 1,
	SuicideDone                    = 2,
	EWTLSuicideState_MAX           = 3,
};

enum class EWTLWeaponAttachmentType : uint8
{
	None                           = 0,
	RedDotSight                    = 1,
	Scope                          = 2,
	MuzzleBrake                    = 3,
	Silencer                       = 4,
	Flashlight                     = 5,
	Laser                          = 6,
	EWTLWeaponAttachmentType_MAX   = 7,
};

enum class EWTLWeaponAttachmentSlotType : uint8
{
	None                           = 0,
	Muzzle                         = 1,
	Flashlight                     = 2,
	Scope                          = 3,
	EWTLWeaponAttachmentSlotType_MAX = 4,
};

enum class EWTLParameterInfluenceType : uint8
{
	Add                            = 0,
	Multiply                       = 1,
	Set                            = 2,
	EWTLParameterInfluenceType_MAX = 3,
};

enum class EWTLClanParameter : uint8
{
	None                           = 0,
	PVPExperienceMultiplier        = 1,
	PVEExperienceMultiplier        = 2,
	PVPDamageMultiplier            = 3,
	PVEDamageMultiplier            = 4,
	ItemExperienceMultiplier       = 5,
	ClanStorageMaxWeightMultiplier = 6,
	InventoryMaxWeightMultiplier   = 7,
	ItemProductionSpeedMultiplier  = 8,
	FactionTechonologiesLevel      = 9,
	MedicineEfficiencyMultiplier   = 10,
	KnifePVPDamageMultiplier       = 11,
	PistolPVPDamageMultiplier      = 12,
	ShotgunPVPDamageMultiplier     = 13,
	SMGPVPDamageMultiplier         = 14,
	AssaultRiflePVPDamageMultiplier = 15,
	RiflePVPDamageMultiplier       = 16,
	MachinegunPVPDamageMultiplier  = 17,
	GrenadeLauncherPVPDamageMultiplier = 18,
	ExplosivePVPDamageMultiplier   = 19,
	KnifePVEDamageMultiplier       = 20,
	PistolPVEDamageMultiplier      = 21,
	ShotgunPVEDamageMultiplier     = 22,
	SMGPVEDamageMultiplier         = 23,
	AssaultRiflePVEDamageMultiplier = 24,
	RiflePVEDamageMultiplier       = 25,
	MachinegunPVEDamageMultiplier  = 26,
	GrenadeLauncherPVEDamageMultiplier = 27,
	ExplosivePVEDamageMultiplier   = 28,
	MovementSpeedMultiplier        = 29,
	MonsterPartsDropChanceMultiplier = 30,
	ResourceDropChanceMultiplier   = 31,
	MiningChanceMultiplier         = 32,
	PVPCriticalChanceMultiplier    = 33,
	PVECriticalChanceMultiplier    = 34,
	EWTLClanParameter_MAX          = 35,
};

enum class EWTLCharacterParameter : uint8
{
	None                           = 0,
	CriticalDamageChance           = 1,
	AvoidCriticalDamageChance      = 2,
	ResourceDropChance             = 3,
	MaxHealth                      = 4,
	MaxStamina                     = 5,
	TakenDamageAmount              = 6,
	Accuracy                       = 7,
	MovementSpeed                  = 8,
	EnvironmentResistance          = 9,
	SatietyHealthRegenerationRate  = 10,
	HealingEfficiency              = 11,
	WeaponHandlingSpeed            = 12,
	DeathLootLoss                  = 13,
	UsingItemsExperienceAmount     = 14,
	UsingRepairKitsEfficiency      = 15,
	SaveLockpicksChance            = 16,
	IHR_Efficiency                 = 17,
	AdditionalInventorySlots       = 18,
	MaxInventoryWeight             = 19,
	ItemProductionSpeed            = 20,
	AdditionalProductionQueueSlots = 21,
	PVP_Damage                     = 22,
	PVP_SlowChanceOnHit            = 23,
	PVP_BleedingChanceOnHit        = 24,
	PVP_KillLootAmount             = 25,
	PVE_EnemyDamage                = 26,
	PVE_MonsterDamage              = 27,
	PVE_MonsterKillLootAmount      = 28,
	PVE_MonsterKillExperienceAmount = 29,
	MeleeDamage                    = 30,
	MeleeBleedingChance            = 31,
	MeleeCriticalDamageChance      = 32,
	PistolDamage                   = 33,
	PistolAccuracy                 = 34,
	PistolCriticalDamageChance     = 35,
	SubMachineGunDamage            = 36,
	SubMachineGunAccuracy          = 37,
	ShotgunDamage                  = 38,
	RifleDamage                    = 39,
	RifleAccuracy                  = 40,
	AssaultRifleDamage             = 41,
	AssaultRifleAccuracy           = 42,
	GrenadeLauncherDamage          = 43,
	ExplosiveDamage                = 44,
	ArmorWeightSpeedMultiplier     = 45,
	EWTLCharacterParameter_MAX     = 46,
};

enum class EWTLStateSpeedAIMonster : uint8
{
	Stop                           = 0,
	Speed01                        = 1,
	Speed03                        = 2,
	Speed05                        = 3,
	Speed07                        = 4,
	Speed1                         = 5,
	EWTLStateSpeedAIMonster_MAX    = 6,
};

enum class EWTLItemSlotType : uint8
{
	None                           = 0,
	Inventory                      = 1,
	Storage                        = 2,
	FastAccess                     = 3,
	Armor                          = 4,
	Buy                            = 5,
	Repair                         = 6,
	Extractor                      = 7,
	Customization                  = 8,
	StimulatorContainer            = 9,
	Stuff                          = 10,
	ClanStorage                    = 11,
	Barter                         = 12,
	ArmoredPlate                   = 13,
	Modification                   = 14,
	SteamInventory                 = 15,
	MailBox                        = 16,
	Utilization                    = 17,
	WeaponPartForExchange          = 18,
	AccountInventory               = 19,
	EWTLItemSlotType_MAX           = 20,
};

enum class EWTLSplitWindowType : uint8
{
	None                           = 0,
	SplitInPlayerInventory         = 1,
	TakeFromStorage                = 2,
	PutInBuyStorage                = 3,
	PutInStorage                   = 4,
	PutInExtractorStorage          = 5,
	TakeFromClanStorage            = 6,
	PutInClanStorage               = 7,
	PutInBarterStorage             = 8,
	PutInSteamInventoryStorage     = 9,
	PutInMailBoxStorage            = 10,
	DropFromInventory              = 11,
	DestroyInInventory             = 12,
	TakeFromAccountInventory       = 13,
	PutToAccountInventory          = 14,
	PutInUtilizationStorage        = 15,
	EWTLSplitWindowType_MAX        = 16,
};

enum class EWTLFiltersChat : uint8
{
	Common                         = 0,
	Faction                        = 1,
	Private                        = 2,
	Log                            = 3,
	Server                         = 4,
	Loot                           = 5,
	Environment                    = 6,
	ConsoleCommand                 = 7,
	Chat                           = 8,
	GlobalChat                     = 9,
	Battle                         = 10,
	Group                          = 11,
	Clan                           = 12,
	Warning                        = 13,
	CollapseChatBox                = 250,
	EWTLFiltersChat_MAX            = 251,
};

enum class EWTLCharacterStateIndicatorType : uint8
{
	None                           = 0,
	InSafeZone                     = 1,
	MediumOverload                 = 2,
	HeavyOverload                  = 3,
	Invulnerable                   = 4,
	InMobileResurectionPointWorkZone = 5,
	InSafeZoneCannotSpawn          = 6,
	InFortificationScoreZone       = 7,
	AverageHunger                  = 8,
	SevereHunger                   = 9,
	AverageThirst                  = 10,
	SevereThirst                   = 11,
	Satiety                        = 12,
	PhysicalExhaustion             = 13,
	InFishingZone                  = 14,
	EWTLCharacterStateIndicatorType_MAX = 15,
};

enum class EWTLMedicineEffectParameter : uint8
{
	None                           = 0,
	Health                         = 1,
	Strength                       = 2,
	Dexterity                      = 3,
	Stamina                        = 4,
	Accuracy                       = 5,
	Intelligence                   = 6,
	Fortune                        = 7,
	StaminaRecovery                = 8,
	EWTLMedicineEffectParameter_MAX = 9,
};

enum class EWTLCustomMovementMode : uint8
{
	CUSTOM_None                    = 0,
	CUSTOM_LadderClimbing          = 1,
	CUSTOM_VehicleRiding           = 2,
	CUSTOM_MAX                     = 3,
};

enum class EWTLHUDNotificationType : uint8
{
	None                           = 0,
	Experience                     = 1,
	LevelUp                        = 2,
	BalanceIncrease                = 3,
	BalanceDecrease                = 4,
	InventoryChange                = 5,
	ObjectivesChange               = 6,
	TeamLeadChange                 = 7,
	GotItem                        = 8,
	LostItem                       = 9,
	Achievement                    = 10,
	SafeZoneEnter                  = 11,
	SafeZoneLeave                  = 12,
	ReputationIncrease             = 13,
	ReputationDecrease             = 14,
	SystemEvent                    = 15,
	SystemQuest                    = 16,
	ConfederationReputationIncrease = 17,
	ConfederationReputationDecrease = 18,
	BlackSunsetReputationIncrease  = 19,
	BlackSunsetReputationDecrease  = 20,
	MailMessageReceived            = 21,
	QuestCompleted                 = 22,
	QuestFailed                    = 23,
	GetGroupInvite                 = 24,
	RemoveFromGroup                = 25,
	BecameGroupLeader              = 26,
	InstableNetworkConnection      = 27,
	CraftObjectProcessStarted      = 28,
	CraftObjectProcessFinished     = 29,
	MailPackageArrived             = 30,
	StuffItemAttachedToWeapon      = 31,
	PDAModuleInstalled             = 32,
	ItemRepaired                   = 33,
	ItemsRepaired                  = 34,
	ItemEquipped                   = 35,
	OnSendGlobalGroupInviteResponse = 36,
	OnSteamInventoryConsumeItemError = 37,
	JoinedClan                     = 38,
	LeftClan                       = 39,
	ExcludedFromClan               = 40,
	FactionScoreIncrease           = 41,
	FactionScoreDecrease           = 42,
	FactionRankIncrease            = 43,
	FactionRankDecrease            = 44,
	FortificationStartLoosingPoint = 45,
	FortificationStartCapturingPoint = 46,
	ForticiationPointCaptured      = 47,
	FortificationPointSecured      = 48,
	FortificationPointLost         = 49,
	FortificationPointCaptureFailed = 50,
	QuestCanBeCompleted            = 51,
	AccountAchievementTrigger      = 52,
	NewClanMemberRequest           = 53,
	EnterFishingZone               = 54,
	LeaveFishingZone               = 55,
	ClanLevelUp                    = 56,
	AccountBalanceIncrease         = 57,
	AccountBalanceDecrease         = 58,
	TakeQuest                      = 59,
	ReceivedMarkerFromPlayer       = 60,
	CanNotAcceptMarkerFromPlayer   = 61,
	FishingLineBroke               = 62,
	CanNotFishingInThisPlace       = 63,
	EWTLHUDNotificationType_MAX    = 64,
};

enum class EWTLArenaActivationVolumeType : uint8
{
	None                           = 0,
	ActivatePlayerStart            = 1,
	ActivatePlayerStartByRating    = 2,
	ActivatableObject              = 3,
	EWTLArenaActivationVolumeType_MAX = 4,
};

enum class EWTLEventLogRecordType : uint8
{
	None                           = 0,
	MonsterKilled                  = 1,
	CharacterKilled                = 2,
	EnemyNPCKilled                 = 3,
	CharacterDied                  = 4,
	CharacterSuicide               = 5,
	DamageToMonster                = 6,
	DamageToEnemyNPC               = 7,
	DamageToCharacter              = 8,
	CriticalDamageToMonster        = 9,
	CriticalDamageToEnemyNPC       = 10,
	CriticalDamageToCharacter      = 11,
	DamageFromMonster              = 12,
	CriticalDamageFromMonster      = 13,
	DamageFromEnemyNPC             = 14,
	CriticalDamageFromEnemyNPC     = 15,
	DamageFromCharacter            = 16,
	CriticalDamageFromCharacter    = 17,
	DamageFromEnvironment          = 18,
	CharacterEntersLocation        = 19,
	CharacterLeaveLocation         = 20,
	StartMatch                     = 21,
	FinishMatch                    = 22,
	CharacterEarnsExperience       = 23,
	CharacterLevelUp               = 24,
	CharacterDestroyMonsterSpawnPoint = 25,
	CharacterGotItem               = 26,
	CharacterLostItem              = 27,
	CharacterDepositedItem         = 28,
	CharacterTakeItem              = 29,
	CharacterDropItem              = 30,
	CharacterEarnsScores           = 31,
	FactionEarnsScores             = 32,
	EnemyPositionsSentToTeamSuccess = 33,
	EnemyPositionsSentToTeamError  = 34,
	TeamLeadChanged                = 35,
	CapturePointChanged            = 36,
	PointCaptureByTeam             = 37,
	PointCaptureByEnemy            = 38,
	PointCaptureFailed             = 39,
	SafeZoneEnter                  = 40,
	SafeZoneLeave                  = 41,
	ReputationIncrease             = 42,
	ReputationDecrease             = 43,
	BalanceChange                  = 44,
	ConfederationReputationIncrease = 45,
	ConfederationReputationDecrease = 46,
	BlackSunsetReputationIncrease  = 47,
	BlackSunsetReputationDecrease  = 48,
	InstableNetworkConnection      = 49,
	MadeEffectToCharacter          = 50,
	TakeItemFromAccountInventory   = 51,
	PutItemToAccountInventory      = 52,
	EWTLEventLogRecordType_MAX     = 53,
};

enum class EWTLMonsterEventType : uint8
{
	None                           = 0,
	MonsterMakeDamage              = 1,
	StopedByDamage                 = 2,
	RecoverFromDamage              = 3,
	Attack                         = 4,
	FarAttack                      = 5,
	EWTLMonsterEventType_MAX       = 6,
};

enum class EWTLMonsterAIStateOfAggression : uint8
{
	None                           = 0,
	Normal                         = 1,
	Hard                           = 2,
	EWTLMonsterAIStateOfAggression_MAX = 3,
};

enum class EWTLMonsterAIStateMoving : uint8
{
	Stop                           = 0,
	Moving                         = 1,
	EWTLMonsterAIStateMoving_MAX   = 2,
};

enum class EWTLMonsterAIState : uint8
{
	Walk                           = 0,
	RateAggressUp                  = 1,
	FollowTarget                   = 2,
	Attack                         = 3,
	FarAttack                      = 4,
	FindInstigator                 = 5,
	Escaping                       = 6,
	TakeDamageHigh                 = 7,
	Stealth                        = 8,
	Bug                            = 250,
	EWTLMonsterAIState_MAX         = 251,
};

enum class EWTLMonsterAnimationState : uint8
{
	Movement                       = 0,
	Idle                           = 1,
	Attack                         = 2,
	FarAttack                      = 3,
	Damage                         = 4,
	RateAggressUp                  = 5,
	TakeDamageHight                = 6,
	Stealth                        = 7,
	Death                          = 200,
	EWTLMonsterAnimationState_MAX  = 201,
};

enum class EWTLMonsterAIStateAnim : uint8
{
	None                           = 0,
	Movement                       = 1,
	Fly                            = 2,
	Idle                           = 3,
	Attack                         = 4,
	FarAttack                      = 5,
	Damage                         = 6,
	RateAggressUp                  = 7,
	TakeDamageHigh                 = 8,
	Stealth                        = 9,
	Death                          = 200,
	EWTLMonsterAIStateAnim_MAX     = 201,
};

enum class EWTLUsableItemUseType : uint8
{
	None                           = 0,
	Main                           = 1,
	Alternative                    = 2,
	EWTLUsableItemUseType_MAX      = 3,
};

enum class EWTLUsableItemState : uint8
{
	None                           = 0,
	Idle                           = 1,
	ReloadedOneRound               = 2,
	ReloadedFullMagazine           = 3,
	MissileThrow                   = 4,
	TacticalPlace                  = 5,
	TakeInArms                     = 6,
	PutToInventory                 = 7,
	MissileReadyToThrow            = 8,
	MeleeWeaponHit                 = 9,
	ResourceMinerHit               = 10,
	ResourceMinerZoneUse           = 11,
	RepairItemUse                  = 12,
	HealingItemUse                 = 13,
	RechargeItem                   = 14,
	DetectorPowerButtonPress       = 15,
	SetDetectorMode                = 16,
	StartToUse                     = 17,
	EWTLUsableItemState_MAX        = 18,
};

enum class EFSteelTargetState : uint8
{
	None                           = 0,
	Rised                          = 1,
	Droped                         = 2,
	FSteelTargetState_MAX          = 3,
};

enum class EFSteelTargetType : uint8
{
	None                           = 0,
	AlwaysActive                   = 1,
	ActivateByCharacter            = 2,
	ActivateByController           = 3,
	FSteelTargetType_MAX           = 4,
};

enum class EWTLMonsterTakeDamageType : uint8
{
	None                           = 0,
	Low                            = 1,
	Medium                         = 2,
	High                           = 3,
	EWTLMonsterTakeDamageType_MAX  = 4,
};

enum class EWTLAIStateMoving : uint8
{
	Stop                           = 0,
	Walk                           = 1,
	EasyRun                        = 2,
	QuickRun                       = 3,
	EWTLAIStateMoving_MAX          = 4,
};

enum class EWTLAIStateMonster : uint8
{
	Walk                           = 0,
	RateAggressUp                  = 1,
	FollowTarget                   = 2,
	FindInstigator                 = 3,
	Escaping                       = 4,
	EWTLAIStateMonster_MAX         = 5,
};

enum class EWTLAITypeTakeDamage : uint8
{
	None                           = 0,
	Low                            = 1,
	Medium                         = 2,
	High                           = 3,
	EWTLAITypeTakeDamage_MAX       = 4,
};

enum class EWTLAIStateAnimMonster : uint8
{
	Idle                           = 0,
	Idle2                          = 1,
	Idle3                          = 2,
	TakeHighDamage                 = 3,
	RateAggressUp                  = 4,
	Movement                       = 5,
	Attack1                        = 6,
	Attack2                        = 7,
	Death                          = 8,
	EWTLAIStateAnimMonster_MAX     = 9,
};

enum class EWTLDetectorMode : uint8
{
	AliveCreaturesSearchMode       = 0,
	MinesDetectorMode              = 1,
	PlaceableStuffsSearchMode      = 2,
	EWTLDetectorMode_MAX           = 3,
};

enum class EWTLWeaponState : uint8
{
	Idle                           = 0,
	Firing                         = 1,
	FireLast                       = 2,
	Reloading                      = 3,
	Equiping                       = 4,
	Empty                          = 5,
	EWTLWeaponState_MAX            = 6,
};

enum class EWTLFireMode : uint8
{
	None                           = 0,
	Single                         = 1,
	Burst2                         = 2,
	Burst3                         = 3,
	Auto                           = 4,
	EWTLFireMode_MAX               = 5,
};

enum class EProjectileType : uint8
{
	None                           = 0,
	Bullet                         = 1,
	Grenade                        = 2,
	EProjectileType_MAX            = 3,
};

enum class EWTLBulletType : uint8
{
	FMJ                            = 0,
	HP                             = 1,
	AP                             = 2,
	EWTLBulletType_MAX             = 3,
};

enum class EWTLCharacterMoveState : uint8
{
	NotMoving                      = 0,
	Prone                          = 1,
	Crouch                         = 2,
	Walk                           = 3,
	Sprint                         = 4,
	EWTLCharacterMoveState_MAX     = 5,
};

enum class EWTLCharacterPose : uint8
{
	Stand                          = 0,
	Crouch                         = 1,
	Prone                          = 2,
	Swim                           = 3,
	EWTLCharacterPose_MAX          = 4,
};

enum class EWTLHandsState : uint8
{
	Empty                          = 0,
	Idle                           = 1,
	TakingItemInArms               = 2,
	PuttingItemInInventory         = 3,
	Reloading                      = 4,
	Action                         = 5,
	Running                        = 6,
	AimingTransition               = 7,
	Jamming                        = 8,
	ItemPlacement                  = 9,
	ThrowNut                       = 10,
	QuickThrow                     = 11,
	EWTLHandsState_MAX             = 12,
};

enum class EWTLClientMessageType : uint8
{
	Building                       = 1,
	Mining                         = 2,
	EWTLClientMessageType_MAX      = 3,
};

enum class EWTLKeyCategory : uint8
{
	None                           = 0,
	Common                         = 1,
	Movement                       = 2,
	Actions                        = 3,
	Slots                          = 4,
	HUD                            = 5,
	PDA                            = 6,
	Communication                  = 7,
	EWTLKeyCategory_MAX            = 8,
};

enum class EWTLInputMode : uint8
{
	Game                           = 0,
	GameAndUI                      = 1,
	UI                             = 2,
	EWTLInputMode_MAX              = 3,
};

enum class EWTLMapMarkerType : uint8
{
	Player                         = 0,
	Enemy                          = 1,
	Ally                           = 2,
	Monster                        = 3,
	QuestMonster                   = 4,
	CapturePoint                   = 5,
	TeamLead                       = 6,
	SafeHouse                      = 7,
	MobileStartPoint               = 8,
	QuestPoint                     = 9,
	CompleteQuestPoint             = 10,
	CompleteActiveQuestPoint       = 11,
	TakeQuestPoint                 = 12,
	PlayerKiller                   = 13,
	LastDeath                      = 14,
	CampfireLocation               = 15,
	StashLocation                  = 16,
	NPC                            = 17,
	Label                          = 18,
	Portal                         = 19,
	PortalQuestPoint               = 20,
	PortalCompleteQuestPoint       = 21,
	PortalCompleteActiveQuestPoint = 22,
	WaterSource                    = 23,
	NPCDoctor                      = 24,
	NPCStockman                    = 25,
	NPCGunsmith                    = 26,
	NPCTrader                      = 27,
	FortificationNeutralCaptureInProgress = 28,
	FortificationConfederationCaptureInProgress = 29,
	FortificationBlackSunsetCaptureInProgress = 30,
	FortificationNeutralCanBeCaptured = 31,
	FortificationConfederationCanBeCaptured = 32,
	FortificationBlackSunsetCanBeCaptured = 33,
	FortificationNeutralCannotBeCaptured = 34,
	FortificationConfederationCannotBeCaptured = 35,
	FortificationBlackSunsetCannotBeCaptured = 36,
	EventPointMonsterSpawn         = 37,
	EventPointEnvironment          = 38,
	EventPointFindItem             = 39,
	SafeZoneArea                   = 40,
	SafeZoneNeutral                = 41,
	SafeZoneConfederation          = 42,
	SafeZoneBlackSunset            = 43,
	EWTLMapMarkerType_MAX          = 44,
};

enum class EWTLEventPointActivationType : uint8
{
	ByRange                        = 0,
	ByVolume                       = 1,
	EWTLEventPointActivationType_MAX = 2,
};

enum class EWTLEventPointType : uint8
{
	None                           = 0,
	MonsterSpawn                   = 1,
	Environment                    = 2,
	FindItem                       = 3,
	EWTLEventPointType_MAX         = 4,
};

enum class EWTLFishState : uint8
{
	None                           = 0,
	Pecking                        = 1,
	Recovering                     = 2,
	EWTLFishState_MAX              = 3,
};

enum class EWTLFishingMontageType : uint8
{
	None                           = 0,
	Throwing                       = 1,
	ThrowingEnd                    = 2,
	Peck                           = 3,
	PeckEnd                        = 4,
	LeftHook                       = 5,
	UpHook                         = 6,
	RightHook                      = 7,
	DownHook                       = 8,
	EWTLFishingMontageType_MAX     = 9,
};

enum class EWTLHUDType : uint8
{
	None                           = 0,
	Character                      = 1,
	Spectator                      = 2,
	Monster                        = 3,
	EWTLHUDType_MAX                = 4,
};

enum class ECannotActionType : uint8
{
	Put                            = 0,
	Take                           = 1,
	ECannotActionType_MAX          = 2,
};

enum class EWTLAccountInventoryOperationType : uint8
{
	None                           = 0,
	UpdateItems                    = 1,
	TakeItem                       = 2,
	PutItem                        = 3,
	EWTLAccountInventoryOperationType_MAX = 4,
};

enum class EWTLHumanoidAnimInstanceState : uint8
{
	None                           = 0,
	Walking                        = 1,
	Crouch                         = 2,
	CombatWalking                  = 3,
	CombatCrouch                   = 4,
	EWTLHumanoidAnimInstanceState_MAX = 5,
};

enum class EWTLRequestType : uint8
{
	None                           = 0,
	PurchaseStoreItems             = 1,
	GetAccountInventory            = 2,
	GetAccountInventoryAfterPurchaseStoreItems = 3,
	EWTLRequestType_MAX            = 4,
};

enum class EWTLMonsterAcceleration : uint8
{
	Normal                         = 0,
	Fast                           = 1,
	EWTLMonsterAcceleration_MAX    = 2,
};

enum class EWTLMonsterFindingVisibleCharacterType : uint8
{
	Random                         = 0,
	Near                           = 1,
	Hamster                        = 2,
	Stimulus                       = 3,
	EWTLMonsterFindingVisibleCharacterType_MAX = 4,
};

enum class EWTLMonsterFindingCharacterType : uint8
{
	Random                         = 0,
	MinHealth                      = 1,
	MaxHealth                      = 2,
	MinLevel                       = 3,
	MaxLevel                       = 4,
	MinTotalTakeDamage             = 5,
	MaxTotalTakeDamage             = 6,
	Near                           = 7,
	EWTLMonsterFindingCharacterType_MAX = 8,
};

enum class EWTLMonsterStateDeath : uint8
{
	None                           = 0,
	ToDeath                        = 1,
	Death                          = 2,
	EWTLMonsterStateDeath_MAX      = 3,
};

enum class EWTLControlledActionKeyType : uint8
{
	None                           = 0,
	MainAttack                     = 1,
	SecondaryAttack                = 2,
	CustomAction0                  = 3,
	CustomAction1                  = 4,
	CustomAction2                  = 5,
	CustomAction3                  = 6,
	CustomAction4                  = 7,
	CustomAction5                  = 8,
	CustomAction6                  = 9,
	CustomAction7                  = 10,
	Die                            = 99,
	EWTLControlledActionKeyType_MAX = 100,
};

enum class EWTLMonsterSpawnerSpawnMethod : int32
{
	Reachable                      = 0,
	Navigable                      = 1,
	EWTLMonsterSpawnerSpawnMethod_MAX = 2,
};

enum class EWTLWayPointMovingType : uint8
{
	Sequential                     = 0,
	Random                         = 1,
	EWTLWayPointMovingType_MAX     = 2,
};

enum class EWTLNPCReplicaAction : uint8
{
	None                           = 0,
	ShowMainDialog                 = 1,
	ShowGreetingDefault            = 2,
	ShowGreetingDialog             = 3,
	ShowGreetingAndMainDialog      = 4,
	ShowTakeQuestDialog            = 5,
	ShowCompleteQuestDialog        = 6,
	EndDialog                      = 7,
	EWTLNPCReplicaAction_MAX       = 8,
};

enum class EWTLCharacterCanTakeCompleteQuest : uint8
{
	None                           = 0,
	Take                           = 1,
	Complete                       = 2,
	TakeComplete                   = 3,
	EWTLCharacterCanTakeCompleteQuest_MAX = 4,
};

enum class EWTLInventoryToSteamConversionErrorCode : uint8
{
	None                           = 0,
	InternalError                  = 1,
	ItemsNotFoundInInventory       = 2,
	ItemsConditionsError           = 3,
	WrongItemType                  = 4,
	SteamResponseError             = 5,
	EWTLInventoryToSteamConversionErrorCode_MAX = 6,
};

enum class EWTLNPCReason : uint8
{
	None                           = 0,
	FullBag                        = 1,
	WeightOverload                 = 2,
	EWTLNPCReason_MAX              = 3,
};

enum class EWTLNPCCheckResult : uint8
{
	Result_False                   = 0,
	Result_True                    = 1,
	Result_MAX                     = 2,
};

enum class EWTLNPCActionResult : uint8
{
	Success                        = 0,
	Failed                         = 1,
	EWTLNPCActionResult_MAX        = 2,
};

enum class EWTLNPCAction : uint8
{
	DoNothing                      = 0,
	SpawnReplica                   = 1,
	GiveExperience                 = 2,
	GiveItem                       = 3,
	EWTLNPCAction_MAX              = 4,
};

enum class EWTLHighlightID : uint8
{
	None                           = 0,
	BossKill                       = 1,
	Kill                           = 11,
	DoubleKill                     = 12,
	MultiKill                      = 13,
	TrophyKill                     = 21,
	LongDistanceHit                = 31,
	Jackpot                        = 41,
	EWTLHighlightID_MAX            = 42,
};

enum class EWTLClanLogType : uint8
{
	None                           = 0,
	Score                          = 1,
	Actions                        = 2,
	EWTLClanLogType_MAX            = 3,
};

enum class EWTLClanLeaderboardSortType : uint8
{
	None                           = 0,
	MembersCount                   = 1,
	PvPScore                       = 2,
	PvEScore                       = 3,
	CraftScore                     = 4,
	Reputation                     = 5,
	Rating                         = 6,
	EWTLClanLeaderboardSortType_MAX = 7,
};

enum class EWTLPDASkillState : uint8
{
	NotAvailable                   = 0,
	Available                      = 1,
	Learned                        = 2,
	EWTLPDASkillState_MAX          = 3,
};

enum class EWTLPortalActionResult : uint8
{
	Success                        = 0,
	Failed                         = 1,
	EWTLPortalActionResult_MAX     = 2,
};

enum class EWTLControlledDroneAbilityType : uint8
{
	None                           = 0,
	GetInfo                        = 1,
	SwitchCameraMode               = 2,
	SingleShot                     = 3,
	PickUp                         = 4,
	SelfDestruction                = 5,
	EWTLControlledDroneAbilityType_MAX = 6,
};

enum class EWTLMarkerType : uint8
{
	None                           = 0,
	Enemy                          = 1,
	EnemyNPC                       = 2,
	Friend                         = 3,
	Monster                        = 4,
	Device                         = 5,
	EWTLMarkerType_MAX             = 6,
};

enum class EWTLClanActionLogRecordType : uint8
{
	None                           = 0,
	AcceptInvite                   = 1,
	AcceptRequest                  = 2,
	SetClanLeadership              = 3,
	SetClanMemberType              = 4,
	SetClanPolicyGroup             = 5,
	ChangeClanDescription          = 6,
	LeaveClan                      = 7,
	DismissCharacterFromClan       = 8,
	UpdateClanTabAccess            = 9,
	EWTLClanActionLogRecordType_MAX = 10,
};

enum class EWTLClanScoreLogRecordType : uint8
{
	None                           = 0,
	QuestComplete                  = 1,
	TakeClanSkill                  = 2,
	ScoreExchange                  = 3,
	FortificationCapture           = 4,
	EWTLClanScoreLogRecordType_MAX = 5,
};

enum class EWTLPlatform : uint8
{
	None                           = 0,
	Steam                          = 1,
	Abyss                          = 2,
	Mailru                         = 3,
	EWTLPlatform_MAX               = 4,
};

enum class EWTLCharacterContactType : uint8
{
	None                           = 0,
	Friend                         = 1,
	Enemy                          = 2,
	EWTLCharacterContactType_MAX   = 3,
};

enum class EWTLVoicePacketType : uint8
{
	None                           = 0,
	ClientIdentity                 = 1,
	Regular                        = 100,
	Private                        = 101,
	Group                          = 102,
	Clan                           = 103,
	EWTLVoicePacketType_MAX        = 104,
};

enum class EWTLAccountType : uint8
{
	Regular                        = 0,
	Tester                         = 1,
	Developer                      = 250,
	EWTLAccountType_MAX            = 251,
};

enum class EWTLClanStorageMoneyOperationType : uint8
{
	None                           = 0,
	PutMoney                       = 1,
	TakeMoney                      = 2,
	EWTLClanStorageMoneyOperationType_MAX = 3,
};

enum class EWTLClanStorageItemOperationType : uint8
{
	None                           = 0,
	PutItem                        = 1,
	TakeItem                       = 2,
	EWTLClanStorageItemOperationType_MAX = 3,
};

enum class EWTLServerEventType : uint8
{
	None                           = 0,
	ServerShutdown                 = 1,
	VersionUpdate                  = 2,
	Important                      = 3,
	Average                        = 4,
	Quest                          = 5,
	EWTLServerEventType_MAX        = 6,
};

enum class EWTLPlayerType : uint8
{
	Regular                        = 0,
	Moderator                      = 100,
	Administrator                  = 200,
	EWTLPlayerType_MAX             = 201,
};

enum class EWTLQuestState : uint8
{
	None                           = 0,
	InProgress                     = 1,
	Canceled                       = 2,
	CompletedSuccess               = 3,
	CompletedFailed                = 4,
	EWTLQuestState_MAX             = 5,
};

enum class EWTLClanMemberType : uint8
{
	None                           = 0,
	Leader                         = 1,
	DeputyLeader                   = 2,
	Steward                        = 10,
	Member                         = 100,
	Candidate                      = 200,
	EWTLClanMemberType_MAX         = 201,
};

enum class EWTLQuestType : uint8
{
	None                           = 0,
	OneTime                        = 1,
	Repeatable                     = 2,
	EWTLQuestType_MAX              = 3,
};

enum class EWTLCharacterCustomizationPart : uint8
{
	None                           = 0,
	Head                           = 1,
	Torso                          = 2,
	Legs                           = 3,
	Feet                           = 4,
	Glasses                        = 20,
	Watches                        = 21,
	Backpack                       = 22,
	EWTLCharacterCustomizationPart_MAX = 23,
};

enum class EWTLGameServerStopReason : uint8
{
	None                           = 0,
	ConnectionLost                 = 1,
	Shutdown                       = 2,
	EWTLGameServerStopReason_MAX   = 3,
};

enum class EWTLGameServerType : uint8
{
	None                           = 0,
	Official                       = 1,
	Community                      = 2,
	EWTLGameServerType_MAX         = 3,
};

enum class EWTLCraftType : uint8
{
	None                           = 0,
	Inventory                      = 1,
	CampFire                       = 2,
	Furnace                        = 3,
	PressMachine                   = 4,
	ChemicalStation                = 5,
	AmmoPress                      = 6,
	SmallCNCMachine                = 7,
	BigCNCMachine                  = 8,
	EWTLCraftType_MAX              = 9,
};

enum class EWTLBuildingDoorLockType : uint8
{
	None                           = 0,
	KeyLock                        = 1,
	CodeLock                       = 2,
	EWTLBuildingDoorLockType_MAX   = 3,
};

enum class EWTLSkillDependencyType : uint8
{
	MustHave                       = 0,
	MustNotHave                    = 1,
	MustHaveOneOf                  = 2,
	EWTLSkillDependencyType_MAX    = 3,
};

enum class EWTLSkillType : uint8
{
	Passive                        = 0,
	Active                         = 1,
	EWTLSkillType_MAX              = 2,
};

enum class EWTLBalanceChangeType : uint8
{
	Income                         = 0,
	Charge                         = 1,
	EWTLBalanceChangeType_MAX      = 2,
};

enum class EWTLAmmoProjectileType : uint8
{
	FMJ                            = 0,
	HP                             = 1,
	AP                             = 2,
	EWTLAmmoProjectileType_MAX     = 3,
};

enum class EWTLShopType : uint8
{
	System                         = 0,
	EWTLShopType_MAX               = 1,
};

enum class EWTLMiningPointType : uint8
{
	None                           = 0,
	Tree                           = 1,
	EWTLMiningPointType_MAX        = 2,
};

enum class EWTLBuildingBlockState : uint8
{
	Stable                         = 0,
	Building                       = 1,
	Repairing                      = 2,
	EWTLBuildingBlockState_MAX     = 3,
};

enum class EWTLBuildingJointType : uint8
{
	None                           = 0,
	North                          = 1,
	East                           = 2,
	South                          = 3,
	West                           = 4,
	Top                            = 5,
	Middle                         = 6,
	EWTLBuildingJointType_MAX      = 7,
};

enum class EWTLBuildingType : uint8
{
	None                           = 0,
	House                          = 1,
	EWTLBuildingType_MAX           = 2,
};

enum class EWTLBlockType : uint8
{
	Base                           = 0,
	Wall                           = 1,
	WindowBlock                    = 2,
	DoorBlock                      = 3,
	Pillar                         = 4,
	Top                            = 5,
	FrontSteps                     = 6,
	Stairs                         = 7,
	Staircase                      = 8,
	StorageBox                     = 252,
	Workbench                      = 253,
	Empty                          = 254,
	EWTLBlockType_MAX              = 255,
};

enum class EWTLBodyPart : uint8
{
	None                           = 0,
	Head                           = 1,
	Torso                          = 2,
	Legs                           = 3,
	Feet                           = 4,
	EWTLBodyPart_MAX               = 5,
};

enum class EWTLChatMessageType : uint8
{
	Common                         = 0,
	Private                        = 1,
	Group                          = 2,
	Clan                           = 3,
	Faction                        = 4,
	Global                         = 5,
	System                         = 250,
	EWTLChatMessageType_MAX        = 251,
};

enum class EWTLWeatherType : uint8
{
	Clear                          = 0,
	Cloudy                         = 1,
	Rain                           = 2,
	HeavyRain                      = 3,
	EWTLWeatherType_MAX            = 4,
};

enum class EWTLCloudsType : uint8
{
	Custom                         = 0,
	None                           = 1,
	Few                            = 2,
	Scattered                      = 3,
	Broken                         = 4,
	Overcast                       = 5,
	EWTLCloudsType_MAX             = 6,
};

enum class EWTLSex : uint8
{
	Female                         = 0,
	Male                           = 1,
	EWTLSex_MAX                    = 2,
};

enum class EWTLConnectionCloseType : uint8
{
	InvalidPackets                 = 0,
	InvalidLogin                   = 1,
	ServerConsoleCommand           = 2,
	HighPingValue                  = 3,
	CharacterBan                   = 4,
	ConnecionClosedByServer        = 5,
	EWTLConnectionCloseType_MAX    = 6,
};

enum class EWTLAITargetState : uint8
{
	None                           = 0,
	Warning                        = 1,
	Chasing                        = 2,
	EWTLAITargetState_MAX          = 3,
};

enum class EWTLAITargetType : uint8
{
	None                           = 0,
	Waypoint                       = 1,
	Player                         = 2,
	Monster                        = 3,
	EWTLAITargetType_MAX           = 4,
};

enum class EWTLNPCAIClientEventType : uint8
{
	None                           = 0,
	TargetEnterSightRange          = 1,
	TargetLeaveSightRange          = 2,
	TargetEnterWarningRange        = 3,
	TargetLeaveWarningRange        = 4,
	TargetEnterChaseRange          = 5,
	TargetLeaveChaseRange          = 6,
	EWTLNPCAIClientEventType_MAX   = 7,
};

enum class EWTLAIState : uint8
{
	Sleeping                       = 0,
	Idle                           = 1,
	WalkingToWaypoint              = 2,
	Warning                        = 3,
	Chasing                        = 4,
	Escaping                       = 100,
	Dead                           = 200,
	EWTLAIState_MAX                = 201,
};

enum class EWTLLocationType : uint8
{
	Normal                         = 0,
	Underground                    = 1,
	ClanHall                       = 2,
	EWTLLocationType_MAX           = 3,
};

enum class EWTLPlaceType : uint8
{
	Normal                         = 0,
	Underground                    = 1,
	EWTLPlaceType_MAX              = 2,
};

enum class EWTLQuestCheckResult : uint8
{
	Result_False                   = 0,
	Result_True                    = 1,
	Result_MAX                     = 2,
};

enum class EWTLObjFAActionResult : uint8
{
	Success                        = 0,
	Failed                         = 1,
	EWTLObjFAActionResult_MAX      = 2,
};

enum class EWTLObjFACheckResult : uint8
{
	Result_False                   = 0,
	Result_True                    = 1,
	Result_MAX                     = 2,
};

enum class EWTLRainAudioRemoveMethod : uint8
{
	None                           = 0,
	AlwaysCovered                  = 1,
	RemoveCompletely               = 2,
	EWTLRainAudioRemoveMethod_MAX  = 3,
};

enum class EClassRepNodeMapping : uint8
{
	NotRouted                      = 0,
	RelevantAllConnections         = 1,
	Spatialize_Static              = 2,
	Spatialize_Dynamic             = 3,
	Spatialize_Dormancy            = 4,
	EClassRepNodeMapping_MAX       = 5,
};

enum class EWTLSafeZoneType : uint8
{
	SafeZone                       = 0,
	CheckPoint                     = 1,
	EWTLSafeZoneType_MAX           = 2,
};

enum class EWTLScriptedEventMethodType : int32
{
	SpawnObject                    = 0,
	SpawnMonster                   = 1,
	SpawnEnemy                     = 2,
	AnnounceEvent                  = 3,
	EWTLScriptedEventMethodType_MAX = 4,
};

enum class EWTLSecurityViolationType : uint8
{
	None                           = 0,
	DriverDetected                 = 1,
	EWTLSecurityViolationType_MAX  = 2,
};

enum class EWTLSlotMachineState : uint8
{
	None                           = 0,
	StartGame                      = 1,
	EndGame                        = 3,
	EWTLSlotMachineState_MAX       = 4,
};

enum class EWTLClanRelation : uint8
{
	Neutral                        = 0,
	Friend                         = 1,
	Enemy                          = 2,
	EWTLClanRelation_MAX           = 3,
};

enum class EWTLTiltState : uint8
{
	None                           = 0,
	TiltRight                      = 1,
	TiltLeft                       = 2,
	EWTLTiltState_MAX              = 3,
};

enum class EWTLTriggerCheckResult : uint8
{
	Result_False                   = 0,
	Result_True                    = 1,
	Result_MAX                     = 2,
};

enum class EWTLTriggerObjectState : uint8
{
	Off                            = 0,
	On                             = 1,
	EWTLTriggerObjectState_MAX     = 2,
};

enum class EWTLTriggerActionResult : uint8
{
	Failed                         = 0,
	Success                        = 1,
	EWTLTriggerActionResult_MAX    = 2,
};

enum class EWTLRadialMenuType : uint8
{
	None                           = 0,
	Use                            = 1,
	Emotions                       = 2,
	EWTLRadialMenuType_MAX         = 3,
};

enum class EWTLBPCheckResult : uint8
{
	Result_False                   = 0,
	Result_True                    = 1,
	Result_MAX                     = 2,
};

enum class EWTLBPActionResult : uint8
{
	Failed                         = 0,
	Success                        = 1,
	EWTLBPActionResult_MAX         = 2,
};

enum class EWTLClothesTorsoMeshVariant : uint8
{
	Full                           = 0,
	FullArms                       = 1,
	HalfArms                       = 2,
	HandsOnly                      = 3,
	EWTLClothesTorsoMeshVariant_MAX = 4,
};

enum class EWTLGlobalLevelObjectType : uint8
{
	None                           = 0,
	Camp                           = 1,
	EWTLGlobalLevelObjectType_MAX  = 2,
};

enum class EWTLFortificationObjectType : uint8
{
	None                           = 0,
	MachinuGun                     = 1,
	EWTLFortificationObjectType_MAX = 2,
};

enum class EWTLNPCIdentificationAbility : uint8
{
	CanTrade                       = 0,
	HasStorage                     = 1,
	CanTakeQuest                   = 2,
	CanCompleteQuest               = 3,
	IsGunsmith                     = 4,
	HasComission                   = 5,
	EWTLNPCIdentificationAbility_MAX = 6,
};

enum class EWTLDaytimeCubemapBlendType : uint8
{
	Increment                      = 0,
	Decrement                      = 1,
	EWTLDaytimeCubemapBlendType_MAX = 2,
};

enum class EWTLEnergyFieldType : uint8
{
	None                           = 0,
	SafeZone                       = 1,
	EWTLEnergyFieldType_MAX        = 2,
};

enum class EWTLSuffocationVolumeType : uint8
{
	None                           = 0,
	Water                          = 1,
	EWTLSuffocationVolumeType_MAX  = 2,
};

enum class EWTLSuspensionType : uint8
{
	Regular                        = 0,
	Enduro                         = 1,
	EWTLSuspensionType_MAX         = 2,
};

enum class EWTLVehicleEngineSoundMode : uint8
{
	Simple                         = 0,
	Advanced                       = 1,
	EWTLVehicleEngineSoundMode_MAX = 2,
};


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x28 (0x28 - 0x0)
// ScriptStruct WTL.WTLPacket
struct FWTLPacket
{
public:
	uint8                                        Pad_27C6[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct WTL.WTLDateTime
struct FWTLDateTime
{
public:
	int64                                        Value;                                             // 0x0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// 0x8 (0x30 - 0x28)
// ScriptStruct WTL.WTLItemRecord
struct FWTLItemRecord : public FWTLPacket
{
public:
	uint8                                        Pad_27C7[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x70 - 0x30)
// ScriptStruct WTL.WTLResourceItem
struct FWTLResourceItem : public FWTLItemRecord
{
public:
	uint64                                       ID;                                                // 0x30(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       ResourceID;                                        // 0x38(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLResourceType                  Type;                                              // 0x3A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27C8[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Name;                                              // 0x40(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Description;                                       // 0x50(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x60(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Weight;                                            // 0x64(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalWeight;                                       // 0x68(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        SlotNumber;                                        // 0x6C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27C9[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x38 - 0x28)
// ScriptStruct WTL.WTLCharacterEffectInfluence
struct FWTLCharacterEffectInfluence : public FWTLPacket
{
public:
	enum class EWTLCharacterEffectType           EffectType;                                        // 0x28(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27CA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        InfluenceAtStart;                                  // 0x2C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InfluencePerTick;                                  // 0x30(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Duration;                                          // 0x34(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x78 (0xA8 - 0x30)
// ScriptStruct WTL.WTLMedicineItem
struct FWTLMedicineItem : public FWTLItemRecord
{
public:
	uint64                                       ID;                                                // 0x30(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       MedicineID;                                        // 0x38(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLMedicineType                  Type;                                              // 0x3A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27CB[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Name;                                              // 0x40(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Description;                                       // 0x50(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x60(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27CC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWTLDateTime                          CreationDate;                                      // 0x68(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CreatorName;                                       // 0x70(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Weight;                                            // 0x80(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalWeight;                                       // 0x84(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWTLDateTime                          ValidityDate;                                      // 0x88(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWTLCharacterEffectInfluence>  Influences;                                        // 0x90(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        SlotNumber;                                        // 0xA0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27CD[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x80 (0xB0 - 0x30)
// ScriptStruct WTL.WTLClothesItem
struct FWTLClothesItem : public FWTLItemRecord
{
public:
	uint64                                       ID;                                                // 0x30(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       ClothesID;                                         // 0x38(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLClothesType                   Type;                                              // 0x3A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27CF[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Name;                                              // 0x40(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Description;                                       // 0x50(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLArmorClass                    ArmorClass;                                        // 0x60(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27D0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWTLDateTime                          CreationDate;                                      // 0x68(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CreatorName;                                       // 0x70(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       ArmorMin;                                          // 0x80(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       ArmorMax;                                          // 0x82(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Weight;                                            // 0x84(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalWeight;                                       // 0x88(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Condition;                                         // 0x8C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ConditionDelta;                                    // 0x90(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        ModCount;                                          // 0x94(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationScalar;                               // 0x95(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationColor;                                // 0x96(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27D1[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint16                                       FrontPlateTypeID;                                  // 0x98(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27D2[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        FrontPlateCondition;                               // 0x9C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       BackPlateTypeID;                                   // 0xA0(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27D4[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        BackPlateCondition;                                // 0xA4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        SlotNumber;                                        // 0xA8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27D5[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xA8 (0xD8 - 0x30)
// ScriptStruct WTL.WTLWeaponItem
struct FWTLWeaponItem : public FWTLItemRecord
{
public:
	uint64                                       ID;                                                // 0x30(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       WeaponID;                                          // 0x38(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLWeaponType                    Type;                                              // 0x3A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLCaliber                       Caliber;                                           // 0x3B(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27D6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Name;                                              // 0x40(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Description;                                       // 0x50(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWTLDateTime                          CreationDate;                                      // 0x60(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CreatorName;                                       // 0x68(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MagazineCapacity;                                  // 0x78(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MagazineAmmoCount;                                 // 0x79(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       DamageMin;                                         // 0x7A(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       DamageMax;                                         // 0x7C(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       Accuracy;                                          // 0x7E(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalWeight;                                       // 0x80(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       EffectiveRange;                                    // 0x84(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27D8[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Condition;                                         // 0x88(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ConditionDelta;                                    // 0x8C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        ModCount;                                          // 0x90(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27D9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint64                                       CurrentAmmoItemID;                                 // 0x98(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       MuzzleAttachmentTypeID;                            // 0xA0(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27DA[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MuzzleAttachmentCondition;                         // 0xA4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       FlashlightAttachmentTypeID;                        // 0xA8(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27DB[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        FlashlightAttachmentCondition;                     // 0xAC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       ScopeAttachmentTypeID;                             // 0xB0(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27DC[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ScopeAttachmentCondition;                          // 0xB4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationScalar;                               // 0xB8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationColor;                                // 0xB9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27DD[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CustomizationName;                                 // 0xC0(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        SlotNumber;                                        // 0xD0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27DF[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x68 (0x98 - 0x30)
// ScriptStruct WTL.WTLAmmoItem
struct FWTLAmmoItem : public FWTLItemRecord
{
public:
	uint64                                       ID;                                                // 0x30(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       AmmoID;                                            // 0x38(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLAmmoType                      Type;                                              // 0x3A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLCaliber                       Caliber;                                           // 0x3B(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27E0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Name;                                              // 0x40(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Description;                                       // 0x50(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x60(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27E1[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWTLDateTime                          CreationDate;                                      // 0x68(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CreatorName;                                       // 0x70(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       DamageMin;                                         // 0x80(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       DamageMax;                                         // 0x82(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       ArmorPiercingMin;                                  // 0x84(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       ArmorPiercingMax;                                  // 0x86(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       Accuracy;                                          // 0x88(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27E2[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Weight;                                            // 0x8C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalWeight;                                       // 0x90(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        SlotNumber;                                        // 0x94(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27E3[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x70 (0xA0 - 0x30)
// ScriptStruct WTL.WTLArtefactItem
struct FWTLArtefactItem : public FWTLItemRecord
{
public:
	uint64                                       ID;                                                // 0x30(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       ArtefactID;                                        // 0x38(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLArtefactType                  Type;                                              // 0x3A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27E5[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Name;                                              // 0x40(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Description;                                       // 0x50(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWTLDateTime                          CreationDate;                                      // 0x60(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CreatorName;                                       // 0x68(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x78(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Weight;                                            // 0x7C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalWeight;                                       // 0x80(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27E6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWTLDateTime                          ValidityDate;                                      // 0x88(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                       InteractiveObjectID;                               // 0x90(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        SlotNumber;                                        // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27E7[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x68 (0x98 - 0x30)
// ScriptStruct WTL.WTLStuffItem
struct FWTLStuffItem : public FWTLItemRecord
{
public:
	uint64                                       ID;                                                // 0x30(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       StuffID;                                           // 0x38(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLStuffType                     Type;                                              // 0x3A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27E8[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Name;                                              // 0x40(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Description;                                       // 0x50(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWTLDateTime                          CreationDate;                                      // 0x60(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CreatorName;                                       // 0x68(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Weight;                                            // 0x78(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalWeight;                                       // 0x7C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Condition;                                         // 0x80(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ConditionDelta;                                    // 0x84(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Energy;                                            // 0x88(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLItemType                      StorageObjectType;                                 // 0x8C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27E9[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint16                                       StorageObjectTypeID;                               // 0x8E(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationScalar;                               // 0x90(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationColor;                                // 0x91(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        SlotNumber;                                        // 0x92(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27EA[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x80 (0xA8 - 0x28)
// ScriptStruct WTL.WTLStorageContent
struct FWTLStorageContent : public FWTLPacket
{
public:
	enum class EWTLStorageType                   StorageType;                                       // 0x28(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLLocationStorageType           LocationStorageType;                               // 0x29(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27EB[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint64                                       StorageID;                                         // 0x30(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWTLWeaponItem>                WeaponItems;                                       // 0x38(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWTLAmmoItem>                  AmmoItems;                                         // 0x48(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWTLMedicineItem>              MedicineItems;                                     // 0x58(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWTLStuffItem>                 StuffItems;                                        // 0x68(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWTLClothesItem>               ClothesItems;                                      // 0x78(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWTLResourceItem>              ResourceItems;                                     // 0x88(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWTLArtefactItem>              ArtefactItems;                                     // 0x98(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x120 (0x148 - 0x28)
// ScriptStruct WTL.WTLMailPackageRecord
struct FWTLMailPackageRecord : public FWTLPacket
{
public:
	uint64                                       ID;                                                // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                       FromCharacterID;                                   // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                FromCharacterName;                                 // 0x38(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                       ToCharacterID;                                     // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ToCharacterName;                                   // 0x50(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWTLDateTime                          MailDate;                                          // 0x60(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLMailPackageDeliveryType       DeliveryType;                                      // 0x68(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27ED[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWTLDateTime                          PlanDeliveryDate;                                  // 0x70(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                       TotalWeight;                                       // 0x78(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                       TotalPrice;                                        // 0x7C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                MessageText;                                       // 0x80(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                       MoneyAmount;                                       // 0x90(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27EE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWTLStorageContent                    Items;                                             // 0x98(0xA8)(NativeAccessSpecifierPublic)
	enum class EWTLMailPackageState              State;                                             // 0x140(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27EF[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct WTL.WTLOperationResult
struct FWTLOperationResult
{
public:
	int32                                        OperationID;                                       // 0x0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Success;                                           // 0x4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27F2[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ErrorInfo;                                         // 0x8(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Processed;                                         // 0x18(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        ReplicationState;                                  // 0x19(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27F3[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0xC8 - 0xB0)
// ScriptStruct WTL.BulletDamageEvent
struct FBulletDamageEvent : public FPointDamageEvent
{
public:
	enum class EWTLWeaponType                    WeaponType;                                        // 0xB0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27F4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ArmorPiercingValue;                                // 0xB4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Velocity;                                          // 0xB8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ImpulseMultiplier;                                 // 0xBC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Critical;                                          // 0xC0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Stealth;                                           // 0xC1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLColliderType                  ColliderType;                                      // 0xC2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27F5[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0xC0 - 0xB0)
// ScriptStruct WTL.ShrapnelDamageEvent
struct FShrapnelDamageEvent : public FPointDamageEvent
{
public:
	uint16                                       WeaponTypeID;                                      // 0xB0(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27F7[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ImpulseMultiplier;                                 // 0xB4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Critical;                                          // 0xB8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLColliderType                  ColliderType;                                      // 0xB9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27F8[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x18 - 0x10)
// ScriptStruct WTL.FallDamageEvent
struct FFallDamageEvent : public FDamageEvent
{
public:
	float                                        GroundHitVelocity;                                 // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27F9[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x220 (0x220 - 0x0)
// ScriptStruct WTL.TakeHitInfo
struct FTakeHitInfo
{
public:
	float                                        ActualDamage;                                      // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27FA[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                DamageTypeClass;                                   // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AWTLCharacter>          PawnInstigator;                                    // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                 DamageCauser;                                      // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       DamageEventClassID;                                // 0x20(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bKilled;                                           // 0x22(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStealth;                                          // 0x23(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WorldTime;                                         // 0x24(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        EnsureReplicationByte;                             // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_27FB[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDamageEvent                          GeneralDamageEvent;                                // 0x30(0x10)(NativeAccessSpecifierPrivate)
	struct FBulletDamageEvent                    BulletDamageEvent;                                 // 0x40(0xC8)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FShrapnelDamageEvent                  ShrapnelDamageEvent;                               // 0x108(0xC0)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FRadialDamageEvent                    RadialDamageEvent;                                 // 0x1C8(0x40)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FFallDamageEvent                      FallDamageEvent;                                   // 0x208(0x18)(NativeAccessSpecifierPrivate)
};

// 0x240 (0x240 - 0x0)
// ScriptStruct WTL.WTLKillStats
struct FWTLKillStats
{
public:
	class FString                                KillerName;                                        // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTakeHitInfo                          HitInfo;                                           // 0x10(0x220)(ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FString                                VictimName;                                        // 0x230(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x58 - 0x28)
// ScriptStruct WTL.WTLAccountInventoryItem
struct FWTLAccountInventoryItem : public FWTLPacket
{
public:
	uint64                                       ID;                                                // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                       StoreItemID;                                       // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Condition;                                         // 0x3C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         New;                                               // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27FD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ModificationData;                                  // 0x48(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE0 (0x108 - 0x28)
// ScriptStruct WTL.WTLStoreItem
struct FWTLStoreItem : public FWTLPacket
{
public:
	uint64                                       ID;                                                // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CreditsAmount;                                     // 0x30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MoneyAmount;                                       // 0x34(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLItemType                      ItemType;                                          // 0x38(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27FE[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint16                                       ItemTypeID;                                        // 0x3A(0x2)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x3C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Condition;                                         // 0x40(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationScalar;                               // 0x44(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationColor;                                // 0x45(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27FF[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CustomizationName;                                 // 0x48(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ModificationData;                                  // 0x58(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Name;                                              // 0x68(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                NameRU;                                            // 0x78(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Description;                                       // 0x88(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                DescriptionRU;                                     // 0x98(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                BackgroundColor;                                   // 0xA8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                NameColor;                                         // 0xAC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        ItemQuality;                                       // 0xB0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2801[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                IconURL;                                           // 0xB8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                LargeIconURL;                                      // 0xC8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Tags;                                              // 0xD8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Price;                                             // 0xE8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DiscountPercent;                                   // 0xEC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        PromotionType;                                     // 0xF0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Hidden;                                            // 0xF1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2802[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                BundleDefinition;                                  // 0xF8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x48 - 0x28)
// ScriptStruct WTL.WTLInAppPurchaseResult
struct FWTLInAppPurchaseResult : public FWTLPacket
{
public:
	bool                                         Success;                                           // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2804[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Info;                                              // 0x30(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentBalance;                                    // 0x40(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2805[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// ScriptStruct WTL.WTLArenaLeaderboardRecord
struct FWTLArenaLeaderboardRecord
{
public:
	enum class EWTLFaction                       Faction;                                           // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2806[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint64                                       CharacterID;                                       // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLCharacterClass                CharacterClass;                                    // 0x10(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2807[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CharacterName;                                     // 0x18(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CharacterLevel;                                    // 0x28(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2808[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Score;                                             // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct WTL.WTLQuestItemDropChance
struct FWTLQuestItemDropChance
{
public:
	int32                                        QuestID;                                           // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Chance;                                            // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x78 (0x78 - 0x0)
// ScriptStruct WTL.WTLItemSpawnInfo
struct FWTLItemSpawnInfo
{
public:
	enum class EWTLItemType                      ItemType;                                          // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_281C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ItemTypeID;                                        // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinCount;                                          // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxCount;                                          // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinCondition;                                      // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxCondition;                                      // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinInteractiveObjectID;                            // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxInteractiveObjectID;                            // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationScalar;                               // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationColor;                                // 0x21(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_281E[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CustomizationName;                                 // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ModificationData;                                  // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Chance;                                            // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_281F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FWTLQuestItemDropChance>       QuestChances;                                      // 0x50(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         SpawnOnlyIfDoesNotHaveItem;                        // 0x60(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AddToBlackListAfterSpawn;                          // 0x61(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IgnoreNoPrice;                                     // 0x62(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsSpecialItem;                                     // 0x63(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinSpawnDelay;                                     // 0x64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxSpawnDelay;                                     // 0x68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2820[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDateTime                             NextSpawnTime;                                     // 0x70(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x58 - 0x8)
// ScriptStruct WTL.WTLAirDropItemData
struct FWTLAirDropItemData : public FTableRowBase
{
public:
	class FText                                  Name;                                              // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AActor>                  BlueprintClass;                                    // 0x20(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWTLItemSpawnInfo>             SpawnItems;                                        // 0x48(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct WTL.WTLServerEventInfoCommentRowData
struct FWTLServerEventInfoCommentRowData : public FTableRowBase
{
public:
	class FText                                  Text;                                              // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x48 (0x50 - 0x8)
// ScriptStruct WTL.WTLNoteData
struct FWTLNoteData : public FTableRowBase
{
public:
	TSoftObjectPtr<class UTexture2D>             Image;                                             // 0x8(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  Text;                                              // 0x30(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                         bIsCenterText;                                     // 0x48(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2821[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xE0 (0xE8 - 0x8)
// ScriptStruct WTL.WTLGiftCardItemData
struct FWTLGiftCardItemData : public FTableRowBase
{
public:
	class FText                                  Name;                                              // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	enum class EWTLItemType                      ItemType;                                          // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2822[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ItemTypeID;                                        // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChanceMultiplier;                                  // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CountMultiplier;                                   // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             StartTime;                                         // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             EndTime;                                           // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinBlackListTimeout;                               // 0x40(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxBlackListTimeout;                               // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int32, float>                           LocationDropChances;                               // 0x48(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<int32, float>                           MonsterDropChances;                                // 0x98(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct WTL.WTLCharacterClassTexture
struct FWTLCharacterClassTexture
{
public:
	enum class EWTLCharacterClass                Class;                                             // 0x0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2823[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture2D>             Texture;                                           // 0x8(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct WTL.WTLSlotMachineSymbolTexture
struct FWTLSlotMachineSymbolTexture
{
public:
	enum class EWTLSlotMachineSymbol             Symbol;                                            // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2824[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FWTLCharacterClassTexture>     Textures;                                          // 0x8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct WTL.WTLSlotMachineSymbolsTextures
struct FWTLSlotMachineSymbolsTextures : public FTableRowBase
{
public:
	TArray<struct FWTLSlotMachineSymbolTexture>  SymbolsTextures;                                   // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct WTL.WTLSlotMachineItemReward
struct FWTLSlotMachineItemReward
{
public:
	enum class EWTLCharacterClass                CharacterClass;                                    // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2825[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Chance;                                            // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLItemType                      ItemType;                                          // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2826[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ItemTypeID;                                        // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinCount;                                          // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxCount;                                          // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinCondition;                                      // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxCondition;                                      // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinInteractiveObjectID;                            // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxInteractiveObjectID;                            // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationScalar;                               // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationColor;                                // 0x29(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2827[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CustomizationName;                                 // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ModificationData;                                  // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// ScriptStruct WTL.WTLSlotMachineSymbolWinCombination
struct FWTLSlotMachineSymbolWinCombination
{
public:
	enum class EWTLSlotMachineSymbolCheckType    CheckType;                                         // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2828[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EWTLSlotMachineSymbol>     Symbols;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        SymbolsCount;                                      // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2829[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BetMultiplier;                                     // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWTLSlotMachineItemReward>     ItemRewards;                                       // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             WinSoundEvent;                                     // 0x30(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct WTL.WTLSlotMachineWinCombinations
struct FWTLSlotMachineWinCombinations : public FTableRowBase
{
public:
	TArray<struct FWTLSlotMachineSymbolWinCombination> Combination;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x3 (0x3 - 0x0)
// ScriptStruct WTL.WTLSlotMachineSymbolRandRange
struct FWTLSlotMachineSymbolRandRange
{
public:
	enum class EWTLSlotMachineSymbol             Symbol;                                            // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MaxValue;                                          // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Cost;                                              // 0x2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct WTL.WTLSlotMachineCylinder
struct FWTLSlotMachineCylinder : public FTableRowBase
{
public:
	TArray<struct FWTLSlotMachineSymbolRandRange> SymbolRandRange;                                   // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct WTL.WTLItem
struct FWTLItem
{
public:
	enum class EWTLItemType                      Type;                                              // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_282B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        TypeID;                                            // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x10 - 0x8)
// ScriptStruct WTL.WTLFishingBaitData
struct FWTLFishingBaitData : public FTableRowBase
{
public:
	struct FWTLItem                              Item;                                              // 0x8(0x8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// ScriptStruct WTL.WTLFishingTakeItem
struct FWTLFishingTakeItem
{
public:
	float                                        DropChance;                                        // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DifficultyMultiplier;                              // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AWTLFish>                FishActor;                                         // 0x8(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FishingItemConditionDeltaSuccess;                  // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FishingItemConditionDeltaNotSuccess;               // 0x34(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ExperienceReward;                                  // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MoneyReward;                                       // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLItemType                      ItemType;                                          // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_282D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ItemTypeID;                                        // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinCount;                                          // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxCount;                                          // 0x4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinCondition;                                      // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxCondition;                                      // 0x54(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinInteractiveObjectID;                            // 0x58(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxInteractiveObjectID;                            // 0x5C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationScalar;                               // 0x60(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationColor;                                // 0x61(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_282E[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CustomizationName;                                 // 0x68(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ModificationData;                                  // 0x78(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x50 - 0x8)
// ScriptStruct WTL.WTLFishingItemData
struct FWTLFishingItemData : public FTableRowBase
{
public:
	int32                                        MinCharacterLevel;                                 // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinBiteTime;                                       // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxBiteTime;                                       // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2830[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class AWTLFish>                DefaultFishActor;                                  // 0x18(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWTLFishingTakeItem>           ItemsLootTable;                                    // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct WTL.WTLClanLevelItemData
struct FWTLClanLevelItemData : public FTableRowBase
{
public:
	int32                                        PVPScore;                                          // 0x8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PVEScore;                                          // 0xC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CraftScore;                                        // 0x10(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MemberCount;                                       // 0x14(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct WTL.WTLArenaItemReward
struct FWTLArenaItemReward
{
public:
	enum class EWTLItemType                      ItemType;                                          // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2831[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ItemTypeID;                                        // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinCount;                                          // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxCount;                                          // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinCondition;                                      // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxCondition;                                      // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinInteractiveObjectID;                            // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxInteractiveObjectID;                            // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationScalar;                               // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationColor;                                // 0x21(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2833[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CustomizationName;                                 // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ModificationData;                                  // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Chance;                                            // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2834[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x20 - 0x8)
// ScriptStruct WTL.WTLLootBoxItemData
struct FWTLLootBoxItemData : public FTableRowBase
{
public:
	enum class EWTLLootBoxType                   BoxType;                                           // 0x8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2835[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MoneyReward;                                       // 0xC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWTLArenaItemReward>           ItemRewards;                                       // 0x10(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct WTL.WTLSpawnItemLocationInfo
struct FWTLSpawnItemLocationInfo
{
public:
	int32                                        LocationID;                                        // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChanceMultiplier;                                  // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0x90 - 0x8)
// ScriptStruct WTL.WTLLocationSpawnItemData
struct FWTLLocationSpawnItemData : public FTableRowBase
{
public:
	enum class EWTLItemType                      ItemType;                                          // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2837[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ItemTypeID;                                        // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Quality;                                           // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinCount;                                          // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxCount;                                          // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinCondition;                                      // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxCondition;                                      // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinInteractiveObjectID;                            // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxInteractiveObjectID;                            // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationScalar;                               // 0x2C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationColor;                                // 0x2D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2838[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CustomizationName;                                 // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ModificationData;                                  // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Chance;                                            // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2839[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDateTime                             LastSpawnTime;                                     // 0x58(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeBetweenSpawn;                                  // 0x60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinBlackListTimeout;                               // 0x64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxBlackListTimeout;                               // 0x68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         SpawnOnlyInTimePeriod;                             // 0x6C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_283B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDateTime                             SpawnPeriodStartTime;                              // 0x70(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             SpawnPeriodEndTime;                                // 0x78(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWTLSpawnItemLocationInfo>     LocationList;                                      // 0x80(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct WTL.WTLRadialMenuActionInfo
struct FWTLRadialMenuActionInfo
{
public:
	TSoftObjectPtr<class UTexture2D>             Icon;                                              // 0x0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x28(0x18)(Edit, NativeAccessSpecifierPublic)
	class FString                                DebugPreviewText;                                  // 0x40(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x58 - 0x50)
// ScriptStruct WTL.WTLRadialMenuEmotionInfo
struct FWTLRadialMenuEmotionInfo : public FWTLRadialMenuActionInfo
{
public:
	bool                                         NeedPremium;                                       // 0x50(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_283C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x70 (0x70 - 0x0)
// ScriptStruct WTL.WTLEmotion
struct FWTLEmotion
{
public:
	struct FWTLRadialMenuEmotionInfo             RadialMenuEmotionInfo;                             // 0x0(0x58)(Edit, NativeAccessSpecifierPublic)
	bool                                         BlockCameraRotation;                               // 0x58(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         HideUsableItem;                                    // 0x59(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsBlocking;                                        // 0x5A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CanBeInterrupted;                                  // 0x5B(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_283E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimMontage*                          MaleMontage;                                       // 0x60(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          FemaleMontage;                                     // 0x68(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x70 - 0x8)
// ScriptStruct WTL.WTLEmotionTypeItemData
struct FWTLEmotionTypeItemData : public FTableRowBase
{
public:
	struct FWTLRadialMenuEmotionInfo             RadialMenuEmotionInfo;                             // 0x8(0x58)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FWTLEmotion>                   Emotions;                                          // 0x60(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x50 (0x58 - 0x8)
// ScriptStruct WTL.WTLTutorialMessageItemData
struct FWTLTutorialMessageItemData : public FTableRowBase
{
public:
	enum class EWTLTutorialMessageType           Type;                                              // 0x8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_283F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture2D>             Image;                                             // 0x10(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  Text;                                              // 0x38(0x18)(Edit, NativeAccessSpecifierPublic)
	uint8                                        WarningShowCountLimit;                             // 0x50(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2841[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x78 (0x80 - 0x8)
// ScriptStruct WTL.WTLCharacterRankItemData
struct FWTLCharacterRankItemData : public FTableRowBase
{
public:
	class FText                                  Name;                                              // 0x8(0x18)(Edit, NativeAccessSpecifierPublic)
	uint64                                       Score;                                             // 0x20(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                       ScoreToNextRank;                                   // 0x28(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             SmallIcon;                                         // 0x30(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             LargeIcon;                                         // 0x58(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct WTL.WTLEnemyNPCWeaponItemVariation
struct FWTLEnemyNPCWeaponItemVariation
{
public:
	uint16                                       WeaponItemTypeID;                                  // 0x0(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2842[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<uint16>                               AmmoitemTypeIDVariations;                          // 0x8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x78 (0x78 - 0x0)
// ScriptStruct WTL.WTLItemDropInfo
struct FWTLItemDropInfo
{
public:
	enum class EWTLItemType                      ItemType;                                          // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2843[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ItemTypeID;                                        // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinCount;                                          // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxCount;                                          // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinCondition;                                      // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxCondition;                                      // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NormalChance;                                      // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2845[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FWTLQuestItemDropChance>       QuestDropChances;                                  // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        MinLevel;                                          // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2846[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinCountDeltaPerLevel;                             // 0x34(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxCountDeltaPerLevel;                             // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinConditionDeltaPerLevel;                         // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxConditionDeltaPerLevel;                         // 0x40(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinInteractiveObjectID;                            // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxInteractiveObjectID;                            // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationScalar;                               // 0x4C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationColor;                                // 0x4D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2847[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CustomizationName;                                 // 0x50(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ModificationData;                                  // 0x60(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NormalChanceDeltaPerLevel;                         // 0x70(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         DropOnlyIfDoesNotHaveItem;                         // 0x74(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2848[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x108 (0x110 - 0x8)
// ScriptStruct WTL.WTLEnemyNPCItemData
struct FWTLEnemyNPCItemData : public FTableRowBase
{
public:
	int32                                        GroupId;                                           // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseCustomizationVariations;                       // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2849[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSoftObjectPtr<class USkeletalMesh>>  HeadVariations;                                    // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class USkeletalMesh>>  TorsoVariations;                                   // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class USkeletalMesh>>  LegsVariations;                                    // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class USkeletalMesh>>  FeetVariations;                                    // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                         bUseEquipmentVariations;                           // 0x50(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_284B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                HeadClothesItemTypeIDVariations;                   // 0x58(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                TorsoClothesItemTypeIDVariations;                  // 0x68(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                LegsClothesItemTypeIDVariations;                   // 0x78(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                FeetClothesItemTypeIDVariations;                   // 0x88(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWTLEnemyNPCWeaponItemVariation> WeaponItemTypeIDVariationsWithAmmo;                // 0x98(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                FrontPlateTypeIDVariations;                        // 0xA8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                BackPlateTypeIDVariations;                         // 0xB8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        MinLevel;                                          // 0xC8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxLevel;                                          // 0xCC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Strength;                                          // 0xD0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Dexterity;                                         // 0xD4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Stamina;                                           // 0xD8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Accuracy;                                          // 0xDC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Intelligence;                                      // 0xE0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Fortune;                                           // 0xE4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExperienceToHPRate;                                // 0xE8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_284D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimespan                             MaxExperienceGainTimeout;                          // 0xF0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CanDropWeapon;                                     // 0xF8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_284E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FWTLItemDropInfo>              ItemsToDrop;                                       // 0x100(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x40 (0x48 - 0x8)
// ScriptStruct WTL.WTLEnemyGroupItemData
struct FWTLEnemyGroupItemData : public FTableRowBase
{
public:
	class FText                                  GroupName;                                         // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	enum class EWTLAITeam                        Team;                                              // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_284F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FText>                          FirstNameVariations;                               // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FText>                          LastNameVariations;                                // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x50 (0x58 - 0x8)
// ScriptStruct WTL.WTLCustomWeaponItemData
struct FWTLCustomWeaponItemData : public FTableRowBase
{
public:
	int32                                        WeaponID;                                          // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MagazineCapacity;                                  // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2851[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        DamageMin;                                         // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DamageMax;                                         // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ArmorPiercingMin;                                  // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ArmorPiercingMax;                                  // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CriticalHitChanceMultiplier;                       // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Accuracy;                                          // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Condition;                                         // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ConditionDelta;                                    // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Weight;                                            // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ModCount;                                          // 0x34(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  CustomizationName;                                 // 0x38(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                        CustomizationScalar;                               // 0x50(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationColor;                                // 0x51(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2852[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x30 - 0x8)
// ScriptStruct WTL.WTLCustomizationColorPresetItemData
struct FWTLCustomizationColorPresetItemData : public FTableRowBase
{
public:
	enum class EWTLCustomizationColorPresetType  Type;                                              // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2854[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          Color;                                             // 0xC(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          PreviewColor;                                      // 0x1C(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2855[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x88 (0x90 - 0x8)
// ScriptStruct WTL.WTLClanStorageTabImageItemData
struct FWTLClanStorageTabImageItemData : public FTableRowBase
{
public:
	struct FSlateBrush                           ImageBrush;                                        // 0x8(0x88)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct WTL.WTLCraftIngredient
struct FWTLCraftIngredient
{
public:
	enum class EWTLItemType                      ItemType;                                          // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2856[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ItemTypeID;                                        // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ConsumeOnCraft;                                    // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2857[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ConditionDeltaOnCraft;                             // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct WTL.WTLRobotProductionResult
struct FWTLRobotProductionResult
{
public:
	int32                                        MonsterID;                                         // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MinLevel;                                          // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MaxLevel;                                          // 0x5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Rank;                                              // 0x6(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2858[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinLifeSpan;                                       // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxLifeSpan;                                       // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x80 (0x88 - 0x8)
// ScriptStruct WTL.WTLRobotCraftItemData
struct FWTLRobotCraftItemData : public FTableRowBase
{
public:
	class FText                                  Name;                                              // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x20(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             CraftIcon;                                         // 0x38(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWTLCraftIngredient>           Ingredients;                                       // 0x60(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FWTLRobotProductionResult             Result;                                            // 0x70(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                        ProductionTime;                                    // 0x80(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_285A[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// ScriptStruct WTL.WTLCraftPossibleModification
struct FWTLCraftPossibleModification
{
public:
	int32                                        MinDamageMinChange;                                // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxDamageMinChange;                                // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinDamageMaxChange;                                // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxDamageMaxChange;                                // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinConditionDeltaChange;                           // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxConditionDeltaChange;                           // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinAccuracyChange;                                 // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxAccuracyChange;                                 // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinArmorMinChange;                                 // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxArmorMinChange;                                 // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinArmorMaxChange;                                 // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxArmorMaxChange;                                 // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct WTL.WTLCraftResult
struct FWTLCraftResult
{
public:
	enum class EWTLItemType                      ItemType;                                          // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_285B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ItemTypeID;                                        // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationColor;                                // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationScalar;                               // 0xD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_285C[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CustomizationName;                                 // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWTLCraftPossibleModification         PossibleModification;                              // 0x20(0x30)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xA8 (0xB0 - 0x8)
// ScriptStruct WTL.WTLCraftItemData
struct FWTLCraftItemData : public FTableRowBase
{
public:
	class FText                                  Name;                                              // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x20(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             CraftIcon;                                         // 0x38(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLCraftType                     Type;                                              // 0x60(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_285D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        PDAModuleID;                                       // 0x64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        QuestID;                                           // 0x68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CompleteQuestID;                                   // 0x6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AchievementID;                                     // 0x70(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NeedCraftExperience;                               // 0x74(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NeedSurvivalExperience;                            // 0x78(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_285E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FWTLCraftIngredient>           Ingredients;                                       // 0x80(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWTLCraftResult>               Results;                                           // 0x90(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        CraftTime;                                         // 0xA0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CraftExperience;                                   // 0xA4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SurvivalExperience;                                // 0xA8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Experience;                                        // 0xAC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct WTL.WTLInformationDialogItemData
struct FWTLInformationDialogItemData : public FTableRowBase
{
public:
	class FText                                  Text;                                              // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x68 (0x70 - 0x8)
// ScriptStruct WTL.WTLCustomizationScalarOptionItemData
struct FWTLCustomizationScalarOptionItemData : public FTableRowBase
{
public:
	class FText                                  Name;                                              // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                        Price;                                             // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2860[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture>               Texture;                                           // 0x28(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Roughness;                                         // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2861[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FLinearColor>                  DistinctColors;                                    // 0x58(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        ColorAmplifierValue;                               // 0x68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2862[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x18 - 0x8)
// ScriptStruct WTL.WTLCustomizationColorItemData
struct FWTLCustomizationColorItemData : public FTableRowBase
{
public:
	struct FLinearColor                          Color;                                             // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x50 - 0x8)
// ScriptStruct WTL.WTLChatSmileItemData
struct FWTLChatSmileItemData : public FTableRowBase
{
public:
	class FString                                ImageStyleName;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                        TextAliases;                                       // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             SmileImage;                                        // 0x28(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct WTL.WTLSkyLevelPresetItemData
struct FWTLSkyLevelPresetItemData : public FTableRowBase
{
public:
	class FText                                  CloudyDay;                                         // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x88 (0x90 - 0x8)
// ScriptStruct WTL.WTLItemTypeBrushItemData
struct FWTLItemTypeBrushItemData : public FTableRowBase
{
public:
	struct FSlateBrush                           IconBrush;                                         // 0x8(0x88)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x50 (0x58 - 0x8)
// ScriptStruct WTL.WTLPortalItemData
struct FWTLPortalItemData : public FTableRowBase
{
public:
	TMap<int32, class FText>                     LocationDisplayText;                               // 0x8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct WTL.WTLSafeZoneItemData
struct FWTLSafeZoneItemData : public FTableRowBase
{
public:
	class FText                                  Name;                                              // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x88 (0x90 - 0x8)
// ScriptStruct WTL.WTLMapMarkerSubTypeBrushItemData
struct FWTLMapMarkerSubTypeBrushItemData : public FTableRowBase
{
public:
	struct FSlateBrush                           MarkerSubTypeBrush;                                // 0x8(0x88)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x110 (0x118 - 0x8)
// ScriptStruct WTL.WTLMapMarkerBrushItemData
struct FWTLMapMarkerBrushItemData : public FTableRowBase
{
public:
	struct FSlateBrush                           MarkerBrush;                                       // 0x8(0x88)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                           MarkerBrushForLegend;                              // 0x90(0x88)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x8 (0x30 - 0x28)
// ScriptStruct WTL.WTLSkillDependency
struct FWTLSkillDependency : public FWTLPacket
{
public:
	enum class EWTLSkillDependencyType           Type;                                              // 0x28(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2864[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint16                                       SkillID;                                           // 0x2A(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2865[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct WTL.WTLClanParameterInfluence
struct FWTLClanParameterInfluence
{
public:
	enum class EWTLClanParameter                 Parameter;                                         // 0x0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLParameterInfluenceType        InfluenceType;                                     // 0x1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2867[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Influence;                                         // 0x4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xA8 (0xB0 - 0x8)
// ScriptStruct WTL.WTLClanSkillItemData
struct FWTLClanSkillItemData : public FTableRowBase
{
public:
	uint8                                        MinClanLevel;                                      // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2868[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Name;                                              // 0x10(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x28(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	enum class EWTLSkillType                     Type;                                              // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        SkillLevel;                                        // 0x41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2869[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  EffectDescription;                                 // 0x48(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                        TechnologyScore;                                   // 0x60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_286A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FWTLSkillDependency>           Dependencies;                                      // 0x68(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWTLClanParameterInfluence>    Influences;                                        // 0x78(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             Icon;                                              // 0x88(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct WTL.WTLCharacterParameterInfluence
struct FWTLCharacterParameterInfluence
{
public:
	enum class EWTLCharacterParameter            Parameter;                                         // 0x0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLParameterInfluenceType        InfluenceType;                                     // 0x1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_286C[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Influence;                                         // 0x4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x90 (0x98 - 0x8)
// ScriptStruct WTL.WTLCharacterSkillItemData
struct FWTLCharacterSkillItemData : public FTableRowBase
{
public:
	uint8                                        MinCharacterLevel;                                 // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_286D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Name;                                              // 0x10(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x28(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	enum class EWTLSkillType                     Type;                                              // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLCharacterClass                Class;                                             // 0x41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ClassDefault;                                      // 0x42(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_286F[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SkillPoints;                                       // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWTLSkillDependency>           Dependencies;                                      // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWTLCharacterParameterInfluence> Influences;                                        // 0x58(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             Icon;                                              // 0x68(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ForgetPrice;                                       // 0x90(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2871[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// ScriptStruct WTL.WTLKitItem
struct FWTLKitItem
{
public:
	enum class EWTLItemType                      ItemType;                                          // 0x0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2873[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint16                                       ItemTypeID;                                        // 0x2(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Condition;                                         // 0x8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x28 - 0x8)
// ScriptStruct WTL.WTLKitItemData
struct FWTLKitItemData : public FTableRowBase
{
public:
	class FString                                Name;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWTLKitItem>                   Items;                                             // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x48 (0x50 - 0x8)
// ScriptStruct WTL.WTLCharacterStateIndicatorTableRow
struct FWTLCharacterStateIndicatorTableRow : public FTableRowBase
{
public:
	enum class EWTLCharacterStateIndicatorNatureType NatureType;                                        // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2874[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Name;                                              // 0x10(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             IconTexturePtr;                                    // 0x28(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xB0 (0xB8 - 0x8)
// ScriptStruct WTL.WTLCharacterEffectsItemData
struct FWTLCharacterEffectsItemData : public FTableRowBase
{
public:
	enum class EWTLCharacterEffectType           EffectType;                                        // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLCharacterEffectNatureType     NatureType;                                        // 0x9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2875[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EffectCooldownPerSecond;                           // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxVolumesEffectValue;                             // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2876[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Name;                                              // 0x18(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLinearColor                          BorderColor;                                       // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             Icon;                                              // 0x40(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             AddingSound;                                       // 0x68(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             RemovingSound;                                     // 0x90(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct WTL.WTLMapQuestPoint
struct FWTLMapQuestPoint
{
public:
	int32                                        LocationID;                                        // 0x0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               PointLocation;                                     // 0x4(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// ScriptStruct WTL.WTLMonsterKillRequirement
struct FWTLMonsterKillRequirement
{
public:
	int32                                        MonsterID;                                         // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MinLevel;                                          // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MaxLevel;                                          // 0x5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2877[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Count;                                             // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct WTL.WTLQuestItemRequirement
struct FWTLQuestItemRequirement
{
public:
	enum class EWTLItemType                      ItemType;                                          // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2878[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ItemTypeID;                                        // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CustomizationName;                                 // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         LockedInInventory;                                 // 0x1C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ComsumeOnComplete;                                 // 0x1D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2879[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct WTL.WTLQuestRequirement
struct FWTLQuestRequirement
{
public:
	int32                                        QuestID;                                           // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLQuestState                    State;                                             // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_287A[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// ScriptStruct WTL.WTLEnemyNPCKillRequirement
struct FWTLEnemyNPCKillRequirement
{
public:
	int32                                        EnemyNPCID;                                        // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_287B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  EnemyNPCName;                                      // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                        MinLevel;                                          // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MaxLevel;                                          // 0x21(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_287C[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Count;                                             // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct WTL.WTLCustomQuestRequirement
struct FWTLCustomQuestRequirement
{
public:
	class FText                                  Name;                                              // 0x0(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             Icon;                                              // 0x18(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UseBitMaskForProgress;                             // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_287D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CountBits;                                         // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_287E[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// ScriptStruct WTL.WTLQuestItemReward
struct FWTLQuestItemReward
{
public:
	enum class EWTLItemType                      ItemType;                                          // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_287F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ItemTypeID;                                        // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Condition;                                         // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationScalar;                               // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CustomizationColor;                                // 0x11(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2880[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CustomizationName;                                 // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ModificationData;                                  // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         LockedInInventory;                                 // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2881[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x30 - 0x28)
// ScriptStruct WTL.WTLIdentityItemType
struct FWTLIdentityItemType : public FWTLPacket
{
public:
	enum class EWTLItemType                      Type;                                              // 0x28(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2882[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint16                                       TypeID;                                            // 0x2A(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2883[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct WTL.WTLQuestStateAction
struct FWTLQuestStateAction
{
public:
	int32                                        QuestID;                                           // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLQuestState                    State;                                             // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         SetActive;                                         // 0x5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2885[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1F0 (0x1F8 - 0x8)
// ScriptStruct WTL.WTLQuestItemData
struct FWTLQuestItemData : public FTableRowBase
{
public:
	class FText                                  Name;                                              // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	enum class EWTLQuestType                     Type;                                              // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsHidden;                                          // 0x21(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CanBeCanceled;                                     // 0x22(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CanBePerformedInGroup;                             // 0x23(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CanGiveGiftCards;                                  // 0x24(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MinCharacterLevel;                                 // 0x25(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MaxCharacterLevel;                                 // 0x26(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        RecommendedCharacterLevel;                         // 0x27(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MinCharacterReputation;                            // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MaxCharacterReputation;                            // 0x29(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLCharacterClass                CharacterClass;                                    // 0x2A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CheckCharacterFaction;                             // 0x2B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWTLFaction                       CharacterFaction;                                  // 0x2C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2887[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        FactionTechnologiesLevel;                          // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MinClanLevel;                                      // 0x34(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2888[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimespan                             CompleteTimeLimit;                                 // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimespan                             TakeTimeLimit;                                     // 0x40(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AutoCompleteQuest;                                 // 0x48(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2889[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture2D>             QuestIcon;                                         // 0x50(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x78(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                         bIsShowItemStartQuestInActiveQuestInfo;            // 0x90(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_288B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CustomTextRequirement;                             // 0x98(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                         bIsShowCustomTextRequirementOnlyInActiveQuestInfo; // 0xB0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_288C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MoneyRequirement;                                  // 0xB4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         DisplayItemRequirementsInHUD;                      // 0xB8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         DisplayItemRequirementsInPDA;                      // 0xB9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_288D[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FWTLQuestItemRequirement>      ItemRequirements;                                  // 0xC0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWTLQuestRequirement>          QuestRequirements;                                 // 0xD0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWTLMonsterKillRequirement>    MonsterKillRequirements;                           // 0xE0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWTLEnemyNPCKillRequirement>   EnemyNPCKillRequirements;                          // 0xF0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWTLCustomQuestRequirement>    CustomRequirements;                                // 0x100(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bIsShowCustomRequirements;                         // 0x110(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_288F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ExperienceReward;                                  // 0x114(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsShowMoneyRewardAfterQuestComplete;              // 0x118(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2890[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MoneyReward;                                       // 0x11C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsShowItemRewardsAfterQuestComplete;              // 0x120(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2891[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FWTLQuestItemReward>           ItemRewards;                                       // 0x128(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         UseRandomItemReward;                               // 0x138(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSendItemRewardsByMail;                            // 0x139(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2892[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimespan                             SendItemRewardsByMailInterval;                     // 0x140(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWTLQuestItemReward>           ItemRewardsAtStart;                                // 0x148(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        ReputationReward;                                  // 0x158(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CompleteAchievementReward;                         // 0x15C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FailAchievementReward;                             // 0x160(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ClanPVPScoreReward;                                // 0x164(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ClanPVEScoreReward;                                // 0x168(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ClanCraftScoreReward;                              // 0x16C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ClanTechnologyScoreReward;                         // 0x170(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CreditsReward;                                     // 0x174(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  CustomTextReward;                                  // 0x178(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                         bIsHideCustomTextRewardAfterQuestComplete;         // 0x190(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2894[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FWTLIdentityItemType>          WithdrawItemsAfterQuestCompleted;                  // 0x198(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWTLMapQuestPoint>             MapQuestPoints;                                    // 0x1A8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWTLMapQuestPoint>             MapQuestCompletePoints;                            // 0x1B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                MonsterList;                                       // 0x1C8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWTLQuestStateAction>          QuestStateActionsOnComplete;                       // 0x1D8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                DeleteQuestOnCancel;                               // 0x1E8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC8 - 0x8)
// ScriptStruct WTL.WTLDialogReplicaItemData
struct FWTLDialogReplicaItemData : public FTableRowBase
{
public:
	class FText                                  CommonText;                                        // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  MaleText;                                          // 0x20(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  FemaleText;                                        // 0x38(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USoundBase>             MaleSound;                                         // 0x50(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USoundBase>             FemaleSound;                                       // 0x78(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             ReplicaSound;                                      // 0xA0(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x90 (0x98 - 0x8)
// ScriptStruct WTL.WTLAchievementItemData
struct FWTLAchievementItemData : public FTableRowBase
{
public:
	class FText                                  Name;                                              // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x20(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             InProgressIcon;                                    // 0x38(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             EarnedIcon;                                        // 0x60(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Hidden;                                            // 0x88(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2897[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        StatisticsParameterID;                             // 0x8C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Value;                                             // 0x90(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AchievedPercentage;                                // 0x94(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct WTL.WTLStatisticsParameterItemData
struct FWTLStatisticsParameterItemData : public FTableRowBase
{
public:
	class FString                                Name;                                              // 0x8(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                       MaxValue;                                          // 0x18(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct WTL.WTLMonsterAttackEffect
struct FWTLMonsterAttackEffect
{
public:
	enum class EWTLCharacterEffectType           EffectType;                                        // 0x0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2898[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinValue;                                          // 0x4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxValue;                                          // 0x8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Chance;                                            // 0xC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x198 (0x1A0 - 0x8)
// ScriptStruct WTL.WTLAICharacterItemData
struct FWTLAICharacterItemData : public FTableRowBase
{
public:
	class FText                                  Name;                                              // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                        MinLevel;                                          // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MaxLevel;                                          // 0x21(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2899[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DangerLevelMultiplier;                             // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsRegularAnimal;                                   // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_289A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MassInKg;                                          // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AWTLAICharacter>         BlueprintClass;                                    // 0x30(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExperienceToHPRate;                                // 0x58(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ExperienceForKill;                                 // 0x5C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimespan                             MaxExperienceGainTimeout;                          // 0x60(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Health;                                            // 0x68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HealthPerLevel;                                    // 0x6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RegenerateHealthDelay;                             // 0x70(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RegenerateHealthRate;                              // 0x74(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinRegenerationDamageTreshold;                     // 0x78(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_289C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FWTLMonsterAttackEffect>       CausingEffects;                                    // 0x80(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        CloseAttackMinDamage;                              // 0x90(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackMaxDamage;                              // 0x94(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackMinDamagePerLevel;                      // 0x98(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackMaxDamagePerLevel;                      // 0x9C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackRadiusPerLevel;                         // 0xA0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackMinArmorPiercing;                       // 0xA4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackMaxArmorPiercing;                       // 0xA8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackMinArmorPiercingPerLevel;               // 0xAC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackMaxArmorPiercingPerLevel;               // 0xB0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackEffectPercentPerLevel;                  // 0xB4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackCriticalDamageMultiplier;               // 0xB8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FarAttackMinDamage;                                // 0xBC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FarAttackMaxDamage;                                // 0xC0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FarAttackMinDamagePerLevel;                        // 0xC4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FarAttackRadiusPerLevel;                           // 0xC8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FarAttackMaxDamagePerLevel;                        // 0xCC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FarAttackMinArmorPiercingPerLevel;                 // 0xD0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FarAttackMaxArmorPiercingPerLevel;                 // 0xD4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FarAttackCriticalDamageMultiplier;                 // 0xD8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HeadArmor;                                         // 0xDC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BodyArmor;                                         // 0xE0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArmsArmor;                                         // 0xE4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LegsArmor;                                         // 0xE8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FeetArmor;                                         // 0xEC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HeadArmorPerLevel;                                 // 0xF0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BodyArmorPerLevel;                                 // 0xF4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArmsArmorPerLevel;                                 // 0xF8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LegsArmorPerLevel;                                 // 0xFC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FeetArmorPerLevel;                                 // 0x100(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_289F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateBrush                           ObjectiveIconBrush;                                // 0x108(0x88)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FWTLItemDropInfo>              ItemsToDrop;                                       // 0x190(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// ScriptStruct WTL.WTLControlledMonsterSpawnItemInfo
struct FWTLControlledMonsterSpawnItemInfo
{
public:
	enum class EWTLItemType                      ItemType;                                          // 0x0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28A1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ItemTypeID;                                        // 0x4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Chance;                                            // 0x8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1F0 (0x1F8 - 0x8)
// ScriptStruct WTL.WTLMonsterItemData
struct FWTLMonsterItemData : public FTableRowBase
{
public:
	class FText                                  Name;                                              // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                         UseSimpleIdentification;                           // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MinLevel;                                          // 0x21(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MaxLevel;                                          // 0x22(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28A2[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DangerLevelMultiplier;                             // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsRegularAnimal;                                   // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28A3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MassInKg;                                          // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AWTLMonsterPawn>         BlueprintClass;                                    // 0x30(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MasterMonsterID;                                   // 0x58(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28A5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class AWTLControlledMonsterPawn> ControlledBlueprintClass;                          // 0x60(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ControlledMonsterStrength;                         // 0x88(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28A6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FWTLControlledMonsterSpawnItemInfo> ControlledItemsSpawn;                              // 0x90(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        ExperienceToHPRate;                                // 0xA0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ExperienceForKill;                                 // 0xA4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimespan                             MaxExperienceGainTimeout;                          // 0xA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Health;                                            // 0xB0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HealthPerLevel;                                    // 0xB4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RegenerateHealthDelay;                             // 0xB8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RegenerateHealthRate;                              // 0xBC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinRegenerationDamageTreshold;                     // 0xC0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28A8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FWTLMonsterAttackEffect>       CausingEffects;                                    // 0xC8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        CloseAttackMinDamage;                              // 0xD8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackMaxDamage;                              // 0xDC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackMinDamagePerLevel;                      // 0xE0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackMaxDamagePerLevel;                      // 0xE4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackMinArmorPiercing;                       // 0xE8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackMaxArmorPiercing;                       // 0xEC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackMinArmorPiercingPerLevel;               // 0xF0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackMaxArmorPiercingPerLevel;               // 0xF4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackRadiusPerLevel;                         // 0xF8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackEffectPercentPerLevel;                  // 0xFC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseAttackCriticalDamageMultiplier;               // 0x100(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FarAttackMinDamage;                                // 0x104(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FarAttackMaxDamage;                                // 0x108(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FarAttackMinDamagePerLevel;                        // 0x10C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FarAttackMaxDamagePerLevel;                        // 0x110(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FarAttackMinArmorPiercingPerLevel;                 // 0x114(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FarAttackMaxArmorPiercingPerLevel;                 // 0x118(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FarAttackRadiusPerLevel;                           // 0x11C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FarAttackCriticalDamageMultiplier;                 // 0x120(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HeadArmor;                                         // 0x124(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BodyArmor;                                         // 0x128(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArmsArmor;                                         // 0x12C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LegsArmor;                                         // 0x130(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FeetArmor;                                         // 0x134(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HeadArmorPerLevel;                                 // 0x138(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BodyArmorPerLevel;                                 // 0x13C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArmsArmorPerLevel;                                 // 0x140(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LegsArmorPerLevel;                                 // 0x144(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FeetArmorPerLevel;                                 // 0x148(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28AA[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateBrush                           ObjectiveIconBrush;                                // 0x150(0x88)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                        AccountAchievementIDForKill;                       // 0x1D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AccountStatisticsParameterID;                      // 0x1DC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AccountStatisticsParameterDelta;                   // 0x1E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28AB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FWTLItemDropInfo>              ItemsToDrop;                                       // 0x1E8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x18 - 0x8)
// ScriptStruct WTL.WTLCharacterLevelItemData
struct FWTLCharacterLevelItemData : public FTableRowBase
{
public:
	int32                                        Experience;                                        // 0x8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ExperienceToNextLevel;                             // 0xC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SkillPoints;                                       // 0x10(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ParametersPoints;                                  // 0x14(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x20 - 0x8)
// ScriptStruct WTL.WTLLoadingAdviceItemData
struct FWTLLoadingAdviceItemData : public FTableRowBase
{
public:
	class FText                                  AdviceText;                                        // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x28 (0x30 - 0x8)
// ScriptStruct WTL.WTLLoadingScreenImagesItemData
struct FWTLLoadingScreenImagesItemData : public FTableRowBase
{
public:
	struct FSoftObjectPath                       Image;                                             // 0x8(0x18)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                       AdviceID;                                          // 0x20(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28AC[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            ImageTexture;                                      // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x110 (0x118 - 0x8)
// ScriptStruct WTL.WTLMapItemData
struct FWTLMapItemData : public FTableRowBase
{
public:
	class FString                                MapName;                                           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                MapPath;                                           // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  Name;                                              // 0x28(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                        MasterMapID;                                       // 0x40(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               MasterMapOffset;                                   // 0x44(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PDAModuleID;                                       // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28AD[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture2D>             MapTexture;                                        // 0x58(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             LocationPreviewTexture;                            // 0x80(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterial>              MinimapMaterial;                                   // 0xA8(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LandscapeSideSize;                                 // 0xD0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                             WorldCenterOffset;                                 // 0xD4(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ScaleValue;                                        // 0xDC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ZoomInScaleDeltaRange;                             // 0xE0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ZoomOutScaleDeltaRange;                            // 0xE4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MapOriginalSideSize;                               // 0xE8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MapSideSizeWithBorder;                             // 0xEC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                             FirstSectorPosition;                               // 0xF0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SectorSize;                                        // 0xF8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28AE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
